{"id":"angeline-featherstone-fleming","identifier":"ROSIE_INTERVIEW_032","hash":"rosie","url":"http://127.0.0.1:8080/interviews/angeline-featherstone-fleming","label":"Angeline Featherstone Fleming","description":"Raised in a two-room house with a dirt floor, Angeline picked cotton before receiving her teaching certificate.","image":"http://127.0.0.1:8080/images/ROSIE_INTERVIEW_032-interview-thumbnail.jpg","type":"video","content":"Raised in a two-room house with a dirt floor, Angeline picked cotton before receiving her teaching certificate.  1 \r\nAngeline Fleming \r\n \r\nThe Real Rosie the Riveter Project \r\nInterview 32 \r\n \r\n \r\n \r\nInterview Conducted by  \r\nAnne De Mare and Kirsten Kelly \r\nJuly 12, 2010 \r\nDetroit, MI \r\n \r\n \r\n \r\nFor The \r\nFor the Tamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n----------------Page (0) Break----------------\r\n 2 \r\nInterview: Angeline Fleming \r\nInterviewers: Anne De Mare and Kirsten Kelly \r\nDate: July 12, 2010 \r\nPlace: Detroit, MI \r\n \r\nFleming:  Okay, my name is Angeline Featherstone Fleming. I \r\nwas born in Indianola, Mississippi, that’s the Delta \r\nMississippi.  Twelfth month, December the 11\r\nth\r\n 1919. I grew \r\nup in Indianola, went to school in Indianola, to the 11\r\nth\r\n, \r\nthrew the 11\r\nth\r\n grade. They didn’t have 12\r\nth\r\n grade then so I \r\nwas able to go to Little Rock, Arkansas, that’s where I \r\nfinished high schools and then I came back in home and the \r\ngovernment gave us a chances to become teachers. So they \r\nhad a group of ladies and sent us to Mount By, Mississippi, \r\nwhich is an all black town. There we took this course, \r\nwhich as about a nine-month course. And after we finished \r\nthis course, we were appointed to teach. We had an \r\nAssociates degree and we were appointed different schools \r\nin order to teach. So I went to Sunflower, Mississippi that \r\nwas maybe 12 miles from my home and that’s where I taught \r\nfor a year. After that my brothers had come to Detroit, one \r\nat a time, all the brothers came.  He sent for my second \r\noldest brother. When he got there, he got him a job at \r\nGeneral Motors and then he sent for my third oldest \r\n----------------Page (1) Break----------------\r\n 3 \r\nbrother. And then they sent for me. And that’s that’s the \r\npart of Mississippi that I love, is there anything else \r\nyou’d want to know? \r\n \r\nDe Mare: Oh yea, there’s a lot else I’d like to know. Uh \r\ncan you talk a little bit about your childhood in \r\nMississippi and tell me how many were in the family and \r\nwhat life was like for you as a child down there?   \r\n \r\nFleming: Well, we were poor but we were proud family. We \r\njust didn’t take anything. My mother and father taught us \r\nto be—we didn’t have anything—they taught us to be proud.  \r\nLet us know that we could pretend to be somebody if we \r\nwanted anybody.  And we were always respected, my father, \r\nmy mother. We had this thing, you know down in Mississippi, \r\nsegregation. Part of the town was meant for black people \r\nand the other part was for white. So the people in \r\nMississippi, I mean the whites, they always respected my \r\nmother and my father. And she did, my mother did, a— \r\n \r\nDe Mare: She said, “Give some names.” \r\n \r\nFleming: Names of who? \r\n \r\n----------------Page (2) Break----------------\r\n 4 \r\nFamily Member: Your mother’s names and stuff. Tell them, \r\nNathan, tell them names. \r\n \r\nFleming: Oh... \r\n \r\nKelly: You don’t have to but it’s a good idea. \r\n \r\nFleming: I don’t mind. They’ve done passed now haven’t \r\nthey? \r\n \r\nFamily Member: In the future just give names. \r\n \r\nFleming: Oh okay.  My mother was named was Maidy. My father \r\nwas named James, and there was 11 of us...11 (chuckles). \r\n \r\nDe Mares: What did your father do for a living? \r\n \r\nFleming: Some of everything. Leave home and go to Kentucky \r\nand work in the coal mine and then, excuse me (wipes eyes) \r\nand then from there he worked on the railroad in Missouri \r\nand uh then he came back home.  And we had an oil build \r\nthen and an oil build is a place where they separate the \r\ncotton. Well, in Mississippi where we lived in the Delta, \r\nthe cotton was cane. So uh, this oil build is where they \r\n----------------Page (3) Break----------------\r\n 5 \r\nseparate the seeds from the cotton and he was the farmer \r\nthere. He kept the ballers gone. So uh— \r\n \r\n04:52:23------------------------------------------------- \r\n \r\nDe Mare: So your father worked in all these different jobs. \r\nThere were 11 of you kids— \r\n \r\nFleming: We were poor now. We scuffled but we always—we had \r\na cow, where we got our milk from.  My father always got \r\ntwo pigs and raised them up to hogs.  They’d be up to 300 \r\npounds and people would come around and watch them when it \r\nwas time to kill them, which was in October.  And we had \r\nchickens so that kept us with food. \r\n  \r\nDe Mare: What was your life like as a child. I know you \r\nwent to school but what was your social life like as a \r\nchild? Do you remember? \r\n \r\nFleming: um there were so many of us so we didn’t need to \r\nhave no company or anything to have—we would have at night \r\nwhen we were in our different rooms in the beds so forth \r\nand so on. We would call out the cities, the boys against \r\nthe girls. They’d call out the city and we would have to \r\n----------------Page (4) Break----------------\r\n 6 \r\nname the state. And things like that, that’s the way we \r\nwould do. We’d call out different railroads. L and E and M \r\nand O, Missouri and Ohio, things like that. And then, let’s \r\nsee, we had a playground, a park they call it here, but we \r\nhad a playground then but we’s as we’d go out there, \r\nthere’s this guy: James, fixed us a tennis court. Shoot- I \r\nthink then the tennis rackets coast 35 cents. We were, we \r\nweren’t even able to buy a 35-cent racket. He would let us \r\nplay with-he’d lend us rackets. And then we’d have a \r\nbaseball, we’d play baseball in the evening.  Our main \r\nthing were skates.  Everybody got skates, roller skates, \r\nfour-wheel roller skates for Christmas. And then in the \r\nevening, we’d roller skate.  My mother took in washing so \r\nwe had to do so many clothes and then we could go out and \r\nplay. So we-- that’s what taught me to iron in a hurry, \r\nbecause I would all mine and then after doing we could go \r\nout and play at the park, which was about half a block from \r\nour home. \r\n \r\n07:40:09-------------------------------------------------- \r\n \r\nDe Mare: Now, did you pick cotton? Can you talk about \r\npicking cotton? \r\n \r\n----------------Page (5) Break----------------\r\n 7 \r\nFleming: Yea. \r\n \r\nDe Mare: Can you tell us what that was like? \r\n \r\nFleming: Well, it is hard work, uh I can tell you that. \r\nWe’d pick cotton—all of our school would start in September \r\nand we would pick cotton up until October. We’d pick cotton \r\nfor a whole month and that month we would get out of school \r\nclosing. Our, you know, they’d close the school. \r\n \r\nDe Mare: So the money you earned picking cotton would pay \r\nfor your school clothes for the year? \r\n \r\nFleming: Right. Right. \r\n  \r\nDe Mare: And did you--you mentioned, I’m going to go to \r\nsomething that you said earlier, that they only had school \r\nup to 11\r\nth\r\n grade and you had to travel to Little Rock, \r\nArkansas— \r\n \r\nFleming: No, I went there. I had a cousin who lived there \r\nand she took me in.  That’s how a got a chance to finish \r\nhigh school.  \r\n \r\n----------------Page (6) Break----------------\r\n 8 \r\nDe Mare: Ok. \r\n \r\nFleming: And then after I finished high school, that’s when \r\nthe government stepped in and selected so many of us that \r\nhad finished high school to go take this course. Teacher’s \r\ncourse, teacher’s training course. And then that’s when I \r\nbecame a teacher, and I taught school for one semester, one \r\nyear and that’s when my brother sent for me to come to \r\nDetroit. \r\n \r\nDe Mare: Can you talk a little bit about what the schools \r\nwere like down in that area, in Mississippi during that \r\ntime and why you were recruited by the government to \r\nbecome, to become school teachers. \r\n \r\nFleming: Well, the schools—there were black schools and \r\nthere were white schools.  The-the weren’t integrated the \r\nway they are now. The blacks went to the black schools and \r\nwhites went to the white schools. And uh, that’s it. \r\n \r\nDe Mare: And you were recruited to become a teacher in the \r\nblack schools. \r\n \r\nFleming: Right. \r\n----------------Page (7) Break----------------\r\n 9 \r\nDe Mare: ...by the government? \r\n \r\nFleming: After I had finished high school, the government \r\nrecruited so many of us out of the state, you know some of \r\nus from Sunflower County, they’d choose- you know where I \r\nlived, and different other counties. And we all went to a \r\nMoboma, Mississippi, which was a black.  At that time it \r\nwas an all black town but it’s not there anymore.  \r\n \r\n10:23:08------------------------------------------------- \r\n \r\nDe Mare: Now, when your brother came to Detroit, he got a \r\njob at General Motors and uh he sent for your other \r\nbrothers and then for you— \r\n \r\nFleming: Um uh. And my other brother came and he got a job \r\nat General Motors. Both of them worked over there on the \r\nboulevard for so many years until they retired. \r\n \r\nDe Mare: So they worked for General Motors from then all \r\nthe way through. \r\n \r\nFleming: Um uh... \r\n \r\n----------------Page (8) Break----------------\r\n 10 \r\nDe Mare: Wow. \r\n \r\nFleming: Two of my brothers. My older brother worked in the \r\nfactory. \r\n \r\nDe Mare:  Now, uh what was it like, can you talk about the \r\nexperience as a young girl, coming form MS moving up here \r\nto Detroit and what that was like? \r\n \r\nFleming: Well, it was the happiest moments because I didn’t \r\nhave you know coming form the south, coming to the city, it \r\nwas different. \r\n \r\nDe Mare: in what ways? \r\n \r\nFleming: Well, let’s see how many different ways. It was \r\njust different, you know just like like, you know not used \r\nto streetcars and things like that. You’d come to the city, \r\nand you’d have to ride streetcars to work. At that time \r\nthere were streetcars instead of busses, here in Detroit. \r\nSo I came to Detroit, lets see now, after I got here—I mean \r\nI got a job teaching train—I mean this teacher’s training, \r\nI got a job doing the riveting.  I I I got a quite a few \r\nfriends, some of them from Mississippi. \r\n----------------Page (9) Break----------------\r\n 11 \r\n \r\nFamily Member: Well, she’s trying to tell these people in a \r\ndocumentary what it was like for you to live a life like \r\nthat. You know the experience of—people don’t going through \r\nall that now. And what you went through were hard times.  \r\nLet it hang out ma.  I’m through.  I’ll shut up now. \r\n \r\nFleming:  Well, at one time we lived in a little two-room \r\nhouse, which was living room, dining room, kitchen, no \r\nliving room, dining room, bedroom and then there was a \r\nkitchen.  Now we had uh two double beds and a cot in this \r\nliving room, supposed to be a front room we called it. And \r\nthen we had a bedroom—a single—double bed in the kitchen \r\nalong with the stove and everything and that’s how we \r\nlived.  There wasn’t I had a room by myself of this, that, \r\nnothing.  We all three of us slept in a bed, that’s the way \r\nwe lived. We were poor. We didn’t have anything.  We would \r\nuh, they would come by and tell my mother that out on the \r\nfarms that they had—well they had turnips you know greens \r\nthey would tell her that they were giving them to the poor \r\npeople.  And my brothers, my mother would send them out and \r\nthey would get bags of turnips digging in the ground.  Now, \r\nthis was in December. This was in the cold weather. They \r\nwould bring the turnips in and we would eat all of them. \r\n----------------Page (10) Break----------------\r\n 12 \r\nAnd then as I said, we had hogs. We had chickens and we had \r\ncow so it kept us with food.  And then at one time the \r\ngovernment gave, what would I want to say? Gave food. You \r\ngo up to a place in town, we called it uptown in Enola and \r\nthey would give us food.  Families like my mother and my \r\nfather and they would give us food, you know. So you know, \r\nmy father went up and the lady was handing him one of \r\nthese, one of that, one of another.  And one of the ladies \r\nsaid, “James and Maidy have a big family so give them \r\nmore.” So they gave my father more food. They always looked \r\nout for our family, the white people did. \r\n \r\n15:23:22----------------------------------------------- \r\n \r\nDe Mare: Can you talk about how you got the job and how you \r\nwere trained for the job? \r\n \r\nFleming: Well they were hiring at the—hold on a minute— \r\n \r\nDe Mare: Sure. \r\n \r\nFleming: I got to check—Murray Body. That’s all clay on \r\nclay and Russell. They were teaching, they were hiring \r\npeople to teach them how to rivet. So one of the guys that \r\n----------------Page (11) Break----------------\r\n 13 \r\nI I—that lived in the house with my brother.  This was a \r\nboarding house like—he took me over to Murray Body and I \r\ngot hired.  And that’s how I got started. And you know they \r\ntold me how to rivet all the all the fundamentals of \r\nriveting. \r\n \r\nDe Mare:  Now for someone who doesn’t understand what \r\nriveting is, can you explain what you did?  Like physically \r\nwhat you would do? \r\n \r\nFleming: Oh okay. They taught us to make wings for the B-\r\n29. That’s what we were doing, making wings for them. And \r\nhe- and they told us that we have this riveting gun, which \r\nwas a nail gun.  Then you had a bucker on the back and \r\nyou’d rivet these wings, parts of the wings together. And \r\nuh that’s that’s the training we had. We got through all \r\nthe fundamentals of riveting and then Ford Motors come and \r\nhired us out in Highland Park. And that’s when we started \r\nworking out there. \r\n \r\nDe Mare: At the Ford Motor Company in Highland Park and \r\nthey were making the B-29 Bombers? \r\n \r\nFleming: Um uh b-29 wings for the bombers. \r\n----------------Page (12) Break----------------\r\n 14 \r\n \r\nDe Mare: Now, do you remember, can you tell us on camera \r\nhow much you were paid when you started working there? \r\n \r\nFleming: I think we were paid about $1.45 an hour, which \r\nwas big money to me. Laughs. \r\n \r\nDe Mare: And do you remember what it felt like as a young \r\nwoman to earn that kind of big money? \r\n \r\nFleming: Well, you know it gave me independence you know.  \r\nAll of us, the kids, there were four kids of us...let’s see \r\nmy older brother, who was married, my other two brothers \r\nand myself. And we would send money home to my mother and \r\nfather you know to help with the other kids under us. And \r\nuh, it I would have me a little bank account you know. I \r\nwould send so much home and then so much I would put away. \r\n \r\nDe Mare: And what kinds of things would you buy for \r\nyourself with that money? \r\n \r\nFleming: Well, that coat that you saw...that was one of \r\nthem at Anne’s Furs in Enola used—I mean, Detroit, used to \r\nbe Anne’s furs and clothes. \r\n----------------Page (13) Break----------------\r\n 15 \r\n \r\n18:33:15----------------------------------------------- \r\n \r\nDe Mare: You’ve obviously gone through, you’ve been \r\neducated and you’ve learned how to be a teacher and you had \r\ndone that for a year and you find yourself here and you’re \r\ndoing this very difficult work, very physical work and \r\nyou’re earning you’re earning a very good living.  Could \r\nyou talk about, like the way you talked about your \r\nchildhood and what you used to do as a child, could you \r\ntalk about what your day-to-day life was like when you were \r\nliving here with your brothers and you were working and \r\nearning that kid of money? \r\n \r\nFleming: Well, what was my life like? \r\n \r\nDe Mare: Think about it...you can take a moment to think \r\nabout it. \r\n \r\nFleming: Well, I would go to work, come back home. On the \r\nweekends, we would go to uh different...let’s see now, we’d \r\ngo to different clubs.  At that time in Detroit, you could \r\ngo to different...Sam’s, Sunny Wilson’s, the Cellar Door, \r\nthe 3-6’s were all different clubs you could go to. And on \r\n----------------Page (14) Break----------------\r\n 16 \r\nFriday night and Saturday night my sister-in-law and my \r\nbrother would take me with them to different clubs, you \r\nknow.  Back then the 3-6’s were all different clubs, plus \r\nback then it was a bowling alley. Then you could go bowling \r\nand then on Sunday’s I found me a church that I liked and I \r\njoined church and Sunday morning. I mean, Sunday 11 o’clock \r\nI would always go to church. I still go to church. \r\n \r\nDe Mare: Were you dating anyone? Was your social life—what \r\nwas your social life like? \r\n \r\nFleming: Well my social life was pretty good. At first I \r\ndidn’t have a social life when I first got here because I \r\nwas working at Murray Body’s learning how to rivet so I \r\ndidn’t have time for no guys of any kind. But when I went \r\nto Ford Motor Company that’s when I started and I met my \r\nhusband there. \r\n \r\nDe Mare:  And what did your husband do there? \r\n \r\nFleming: he was a uh he was uh a he would drive... \r\n \r\nFamily Member: High loads? \r\n \r\n----------------Page (15) Break----------------\r\n 17 \r\nFleming: High loads, he would deliver different pieces of \r\nmaterial on the high loads.  He was the high load driver. \r\n \r\nDe Mare: Can you talk little bit about working at the Ford \r\nMotor Company? Was the work force integrated or segregated \r\nwhen you worked there?  Did you work with— \r\n \r\nFleming: Oh it was integrated when when when we were there \r\nwell you know, it got integrate by the time I came to \r\nDetroit. \r\n \r\nDe Mare: And what was that like for you as a young woman? \r\n \r\nFleming: Well, it wasn’t nothing... \r\n \r\nDe Mare: Well, coming from the Deep South it was a change. \r\n \r\nFleming: Yea, you’re right. Right, the black and the whites \r\nworked on these wings, these elevators to set these wings \r\nup and then the elevator would rise up as you rivet. You go \r\non until you go to the to and then would take it off, the \r\nrivet off.  It was beautiful— different. I had some friends \r\nthat I had gotten so I had met friends while I was at the \r\nFord Motor Company. And uh most times I would go out with \r\n----------------Page (16) Break----------------\r\n 18 \r\nmy sister and brother-in-law. A lot of times just my \r\nsister-in-law and I would go out. \r\n \r\nKelly: What was the clubs um, what were the clubs—you were \r\ntalk about the clubs and this kind of social-life.  Was \r\nthere, you can still answer to her but were the clubs like? \r\nWas there dancing? \r\n \r\nFleming: Yea... \r\n \r\nKelly: What was the music like? \r\n \r\nFleming: Dancing, you could, you know you’d dance and they \r\nhad drinks you know. You’d go down to the table and sit \r\ndown and drink and dance and so on and so on so you \r\nknow...just some nights just a nice place to be and enjoy \r\nyourself. \r\n \r\nDe Mare: Were you aware—can you talk a little bit about the \r\nwar and how you felt about the war and aware you were about \r\nthe war? \r\n \r\nFleming: Well you know, they called us because they caught \r\nus with our pants down, the Japanese did. We didn’t have—\r\n----------------Page (17) Break----------------\r\n 19 \r\nthey had destroyed just about all of uh our planes, boats, \r\nyou know ships and so forth and so on.  Then that’s why we \r\nhad to uh make up for that, that’s why were building these \r\nB-29, you know wing— So many factories were making, do \r\ndifferent parts you know when they get through it, it will \r\nbe the whole plane.  So we did the wings. \r\n \r\n23:33:20------------------------------------------------- \r\n \r\nDe Mare: And did you feel like you were a part of the \r\neffort for the war? Did you feel connected to the war that \r\nwas going on or did you feel distant, you know? \r\n \r\nFleming: Well, I felt like we were connected. We were \r\nworking, trying to restore what they had destroyed so I \r\nfelt like we were connected with the war.  \r\n \r\nDe Mare: Did you know anyone who was fighting, did you know \r\nanyone in the service? \r\n \r\nFleming:  Well after I got here for a while both of my \r\nbrothers, they were sent to the service.  One went to uh \r\nAustralia and the other one to Belgium. Two different \r\ncountries. So I would write them and keep them informed \r\n----------------Page (18) Break----------------\r\n 20 \r\nabout what was going on in Detroit, so forth and so on. I I \r\nI felt I was a part of it. \r\n \r\nDe Mare: You were.  You were. \r\n \r\nKelly: You...I remember on the phone that you talked about \r\nyou were one of the fastest riveters. \r\n \r\nFleming: Oh yea. \r\n \r\nKelly: Can you talk about that? Tell Anne. \r\n \r\nFleming:  Well you know we had uh there were sections. You \r\nknow, there was wing B and then it would go smaller and \r\nsmaller. That would be about three, I think three or four \r\nof us on uh on this wing. Some of us had, you know we would \r\nchange around. Maybe this time I would do the big part of \r\nit and the next time I would do the second and then the \r\nthird, the small end, the small rivet. And all the folk, I \r\ndon’t know, I guess I always wanted to be the best so me \r\nand my partner, we would start riveting and we would you \r\nknow put the rivets in, shoot it with the air gun, like \r\nthat, that’s the way we would do it.  And we would go so \r\nfar until they the others were down there so we couldn’t \r\n----------------Page (19) Break----------------\r\n 21 \r\nuse the elevators. So I would climb up.  Put my one of my \r\nknees on the wing and the other one on the balance of the \r\nelevator and then we would go on up and we would finish we \r\nwould go in the restroom and relax until the others get \r\nthrough.  And when they get through they would take the \r\nwing down and put fresh wing up and then we’d start all \r\nover again. But I was always—for some reason, I always \r\nwanted to be the best and then the white bosses and \r\neverything would come around and they would watch me rivet.  \r\nI thought I was somebody. So one of them asked me, “Where \r\ndid you learn to rivet from?” And I told him that I took \r\nthe training in Murray Body’s. \r\n \r\nDe Mare: Is there any kind of anecdote or uh— \r\n \r\nKelly: A memory— \r\n \r\nDe Mare: Or a memory that you have, a specific memory that \r\nyou have about something that happened while you were \r\nworking? \r\n \r\nFamily Member: I remember you’s was talking about that... \r\n \r\n----------------Page (20) Break----------------\r\n 22 \r\nFleming: Well this was one of the people that worked with \r\nus. She uh, her husband was in service and she, uh, I was \r\ntrying to think of her name but I can’t think of it now. \r\nBut in anyway she stopped eating and uh eventually her \r\nintestines closed down on her and eventually she died from \r\nthat, but I mean, that’s something... \r\n \r\nDe Mare: We’re curious to see the things that people went \r\nthrough and all the different kinds of things people went \r\nthrough— \r\n \r\nFleming: Oh yea, that’s true. \r\n \r\nDe Mare: and um, you know it was such a drastic time in so \r\nmany ways. \r\n \r\nFleming: Yea, it was a drastic time now all right. And we—\r\neverybody was working.  Everybody who thought they wanted a \r\njob or two jobs. They worked them in order to try and get \r\nthe United States back on foot. \r\n \r\nKelly: Was there—this was a time of a lot of rationing and \r\nand they had ration stamps, is that right?  \r\n \r\n----------------Page (21) Break----------------\r\n 23 \r\nDe Mare: Can you talk about that a little bit? \r\n \r\nFleming: Right. Well, when we would, we were during that \r\ntime they did ration. They rationed gas, you could get so \r\nmany gallons a month. They rationed your whisky. You only \r\ngot one filter, a quarter, whatever you called it because I \r\ndidn’t drink or nothing, the kind so the lady, my land \r\nlady, I would stand in line with her to get her an extra \r\none bottle. And then on Thursdays was we could get meat. \r\nMaybe if you were lucky you could get a stake or some pork \r\nchops like that. Otherwise, spam.  Spam was the name of the \r\ngame...you ate spam all the rest of the time, lunchmeat and \r\nso on and so on. But then if you were lucky and you knew \r\nthe the butcher, you could go from under the counter and he \r\nwould give you extra meat, uh um. \r\n \r\n29:29:16-------------------------------------------------- \r\n \r\nDe Mare: Can you talk a little bit about, did you wear \r\npants to work and what that was like for you. You know what \r\nkind of clothing you wore? \r\n \r\nFleming: Oh we wore pants to work. That’s what we’d work \r\nin, pants you know because you know up on those elevators, \r\n----------------Page (22) Break----------------\r\n 24 \r\nif we wore a dress that wouldn’t be so good. So uh, so we \r\nwore pants to work. \r\n \r\nKelly: Was it the first time you wore pants? \r\n \r\nFleming: Really and truly because when I was in the South \r\nwe didn’t wear pants. Coming up we didn’t wear pants we \r\nwore dresses. And we had a time trying to keep them from \r\nbeing torn off playing, running and playing. \r\n \r\nKelly: And what was it, what did you feel about, what else \r\ndid you wear as a Rosie the Riveter? \r\n \r\nDe Mare: Did you have a uniform that you wore as a Rosie \r\nthe Riveter or was it just slacks? \r\n \r\nFleming: Just slacks. We didn’t have to wear anything else. \r\n \r\nDe Mare: Did you wear anything over your hair on your head? \r\nDo you remember? \r\n \r\nFleming: We had to have glasses, the goggles, I know we had \r\nto have goggles, but I’m trying to remember—I don’t think \r\nwe wore nothing on our heads, otherwise because uh it \r\n----------------Page (23) Break----------------\r\n 25 \r\nwasn’t that skinny thing would jump off and uh hit you in \r\nthe face or nothing of the kind because you know you were \r\njust putting these rivets in the wholes and shooting them \r\nwith the gun, you know. And your bucker back there catching \r\nthem. \r\n \r\nDe Mare: So you had to have a really close relationship \r\nwith your bucker? \r\n \r\nFleming: You know we gave signs. If the other, if she \r\ndidn’t get it straight she would hit hit in the back, one \r\nor two times... \r\n \r\nDe Mare: Can you, can you really explain that because you \r\ncouldn’t see each other so can you tell me how that worked?  \r\nYou know, can you tell me how that would work and the \r\nsignals that you gave. \r\n \r\nFleming: well we knew the signals...we knew if she would \r\ntap one time she wanted me to hit the rivet again so she \r\ncould straighten it out.  Sometimes it would bend over you \r\nknow, the rivet would. I guess it was made out of aluminum. \r\n \r\nDe Mare: They were. \r\n----------------Page (24) Break----------------\r\n 26 \r\n \r\nFleming: Uh um. And then sometimes she would miss it and \r\nthen I had to take a drill, and drill that rivet out and \r\nput another one in.  \r\n \r\nDe Mare: So when you were working at Ford Motor was there a \r\nlabor union and did you join the union? Can you talk about \r\nwhat that was like? \r\n \r\nFleming: Well there were always unions here in Detroit. So \r\nuh we had labor unions but so far the labors and you know \r\nthe people—about this being a war and everybody was \r\ntogether trying to get this thing over with, we didn’t have \r\nany problems.  We didn’t have no problem with the union or \r\nthe labors. \r\n \r\nDe Mare: So you—so there was no tension between them, \r\nbetween the management and the unions? \r\n \r\nFleming: No, right, that’s true. \r\n \r\nDe Mare: Now um did you work, you said the workforce was \r\nintegrated, black and white, you worked together. What \r\nabout men and women? Did you work together in the plant? \r\n----------------Page (25) Break----------------\r\n 27 \r\n \r\nFleming: What do you mean, men and women? \r\n \r\nDe Mare: I mean, your bucker was another woman, right, \r\nnow... \r\n \r\nFleming: Oh yea, there were bucker men and there were men \r\nriveters. \r\n \r\nDe Mare: But the men and women worked together? You you—or \r\nthey only worked—you know what I’m asking? You know, would \r\nthere be a male bucker and a female riveter at times or \r\nwere they separated? \r\n \r\nFleming: Uh it looked like, as far as I can remember, it \r\nlooked like, just like I had a black bucker, this guy would \r\nbe riveter, he had a white bucker but still you know what \r\nI’m talking about, we were there together. But you know \r\nthere were... \r\n \r\nDe Mare: Were there any supervisors who were women or \r\nsupervisors that were black or was the supervising—I’m just \r\ntrying to get a picture of what was going on inside the \r\nplant.  \r\n----------------Page (26) Break----------------\r\n 28 \r\n \r\nFleming: As I can remember, I don’t remember too many black \r\nsupervisors as far as I can remember.   \r\n \r\nKelly: Were there any women? Were all the women on crews or \r\nwere all the women supervisors at all? Or was it all men? \r\n \r\nFleming: As far as—in my section, they were men.  Now this \r\nis a whole factory. You know a big factory.  Now everybody \r\nhad their sections and what was going on in other sections, \r\nI didn’t know nothing about, you know. But as far as my \r\nsection they were men. \r\n \r\nDe Mare: Now um the plant at that point worked 24 hours a \r\nday. They worked three shifts usually. Was that the same at \r\nFord as well? Did you work—at which shift did you work? \r\n \r\nFleming: I worked afternoons and som—and let’s see, when I \r\nfirst stared I worked afternoons and I think I worked \r\nafternoons all the while, all through until I left. You \r\nknow, I got married. When I got married, I got married to a \r\nguy who was working in the Ford factory. And then they were \r\ngoing to send him, he either had to go to un the arm—go to \r\nwar or else he would have to be shipped out to California \r\n----------------Page (27) Break----------------\r\n 29 \r\nand build ships. So he decided, he and I decided that maybe \r\nhe would build ships so we left for and moved out to \r\nRichmond, California.  \r\n \r\nDe Mare: And you worked in the shipyards in Richmond, \r\nCalifornia? \r\n \r\nFleming: No. I worked for the Navy Supply Depot. \r\n \r\nKelly: Can you talk about— \r\n \r\nFleming: The foot, the foot of Oakland. I mean the foot of \r\nOakland I mean, I got a job there. \r\n \r\nDe Mare: What did you do there? \r\n \r\nFleming: I was a storekeeper. We would uh they would take \r\nthese invoices and when these ships, different ships, \r\ndifferent section of the wood needed something this \r\nwarehouse carried all the—all the supplies for ships. We \r\nhad the elbows you know the elbows or these things. You’d \r\nget these invoices and we had to fill these invoices and \r\nthe main time the guys who were in the Navy, they would \r\nhelp us fill these invoices because of these things were \r\n----------------Page (28) Break----------------\r\n 30 \r\nbigger than this table you know, different things they had \r\nto have...these, whatcha you call them?  Elbows... \r\n \r\nDe Mare: Like the parts for-- \r\n \r\nFleming: Th-timber, different things like that. \r\n \r\nDe Mare: And who exactly did you work for? Was it the \r\ngovernment or was it a private company? \r\n \r\nFleming: It was the government. \r\n \r\nDe Mare: It was the government. And what was your husband \r\ndoing there? \r\n \r\nFleming: He was in the shipyards. He worked in the shipyard \r\nin Richmond. \r\n \r\nDe Mare: And what was he doing? \r\n \r\nFleming: And I was in Oakland as a storekeeper for the \r\nNavy, for the United States Navy. \r\n \r\n----------------Page (29) Break----------------\r\n 31 \r\nDe Mare: So you stayed in—you stayed working in the war \r\neffort through the war? \r\n \r\nFleming: We stayed there until, I stayed there for a year \r\nand then the war was over in a year’s time. Then I came, we \r\ncame back to Detroit. \r\n \r\n37:40:13-------------------------------------------------- \r\n \r\nDe Mare: Did you like it in California? What was the \r\nexperience like out there? \r\n \r\nFleming: They were pretty. Tell it like it is... \r\n \r\nDe Mare: Yea, tell it. \r\n \r\nFleming: They were pretty. \r\n \r\nFamily Member: Tell them how you passed the test and you \r\ndidn’t get the job. You were the best typist.  Tell them it \r\nall— \r\n \r\nDe Mare: Yea, no I want to hear the story. \r\n \r\n----------------Page (30) Break----------------\r\n 32 \r\nFamily Member: That’s what they want to hear. \r\n \r\nFamily Member: Remember how you got, how you passed the \r\ntyping test. Remember how you told me you typed real well \r\nand you passed the typing and you didn’t get you the job. \r\nRemember? \r\n \r\nFleming: I didn’t type. \r\n \r\nFamily Member: What did you do?  You took a test. \r\n \r\nFleming: Yea, hun, and got a 100 on the test. \r\n \r\nFamily Member: Tell ‘em. \r\n \r\nDe Mare: What was the test for? Do you remember? \r\n \r\nFleming: Different jobs there. The only reason they said I \r\ndidn’t get it was because I couldn’t type. I didn’t know \r\nhow to type.  Well, that was their excuse anyway, you know. \r\nSo I went from there—I was trying to get a job there in \r\nRichmond, California so I couldn’t that job.  So they sent \r\nme-gave me this job at the Navy Supply Depot in Oakland, \r\nCalifornia and that’s where I worked for that year. \r\n----------------Page (31) Break----------------\r\n 33 \r\n \r\nKelly: Why do you think you didn’t get that job? \r\n \r\nFleming: Um? \r\n \r\nKelly: Why do you think you didn’t get that job really? \r\n \r\nFleming: Because I was black.  They’ve got prejudices out \r\nthere now.  \r\n \r\nKelly: So you experience more of that out there in \r\nCalifornia than you did in Detroit? \r\n \r\nFleming: Right, right.  \r\n \r\nKelly: Interesting...so when you were out there you wanted \r\nto come back to Detroit because the experience out there \r\nwasn’t so great? Is that... \r\n \r\nFleming: I didn’t...that’s why I came back to Detroit \r\nbecause they weren’t nice out there in California as far as \r\nI was concerned. So much difference in here than out there. \r\nAt that time now, that was in the ‘40s.  \r\n \r\n----------------Page (32) Break----------------\r\n 34 \r\nKelly: Do you remember—so you were out in Richmond when the \r\nwar was over, right? Do you remember the day, like where \r\nwere you and what happened and how you found out the war \r\nwas over? \r\n \r\nFleming: Evidently this must have the weekend or close to \r\nthe weekend or something the time because I think I was at \r\nhome—you know out there at home when they said—well you \r\nknow when they dropped that bomb. It wasn’t too long before \r\nthe war was over. That was the last part of the war. So \r\nthey dropped that bomb and the war was over then.  \r\n \r\nDe Mare: What was it like, how did you feel about that? \r\nWhat was is like? Was there— \r\n \r\nFleming:  Well you know there was shouting and hollarin’ \r\nand celebrating and so forth and so on. I was glad too it \r\nwas over. \r\n \r\nDe Mare: And then—what what—how did your life change when \r\nthe war was over? Can you talk about that because you came \r\nback to Detroit, I was married now, remember and I got \r\npregnant then in California so I came back to Detroit. My \r\nhusband was working at uh he was a delivery guy living \r\n----------------Page (33) Break----------------\r\n 35 \r\ndowntown.  Plus he was still got a job back in the factory \r\nso uh life and everything settled down and everything and \r\nlife was beautiful...end up with five babies. \r\n \r\nDe Mare:  As you look back, if you think about the rest of \r\nyour life after you were a Rosie, when you were a young \r\nmother, how do you think being a Rosie effected you? Do you \r\nthink it changed you in any way? \r\n \r\nFleming: Well, I can’t say it changed me because I always \r\nworked you know, picking cotton, chopping cotton when I was \r\nin Mississippi, you know. But it gave—made me independent. \r\nYou know I had my own money and everything and kind until I \r\ngot married really.  The money was between the both of us \r\nyou know. \r\n \r\nDe Mare:  Did it change the way you thought about what \r\nwomen can do? \r\n \r\nFleming: I guess everybody had a chance to uh, you know \r\nbefore the war, things were tight. You know, we had this \r\nthis...rough times.  Then when the war came everybody was \r\nable to uh work. They gave ‘em a chance to buy homes and \r\nautomobiles and everything of the kind. So uh the really \r\n----------------Page (34) Break----------------\r\n 36 \r\nand truly the war helped people.  Helped everybody.  And \r\nthe people here in the South moved north where they were \r\ngetting jobs you know, working at Ford Highland Park and \r\nFord inaudible Plants you know and everything of the kind. \r\nAnd everybody was living food, but then after the war was \r\nover and everything of the kind they I guess they were \r\nstill doing pretty good with themselves.  They still had \r\njobs, most of them did. \r\n \r\nDe Mare: Now your brother stayed working for the Ford Motor \r\nCompany after the war? \r\n \r\nFleming: My brother worked for—my older brother worked for \r\nCrystler. I’m the one who worked for Ford. \r\n \r\nDe Mare: Ok. \r\n \r\nFleming:  My other two brothers worked for General Motors \r\nup here on the boulevard. One was the cook and the other \r\none was—I think both of them were cooks then in the \r\ncafeteria. And they stayed there until they retired.  After \r\nthey came back from service, they went back on their jobs, \r\nthey saved them their jobs.  That’s the way they did, you \r\nknow. If you worked in a place and left and went to \r\n----------------Page (35) Break----------------\r\n 37 \r\nservice, when you came back your job was waiting on you. So \r\nthat’s the way that was. \r\n \r\n44:14:20--------------------------------------------------- \r\n \r\nKelly: Did you know any Rosies or any friends of yours who \r\nwere Rosies did then—you know after the war all the men \r\ncame back and a lot of the women like left or were told \r\nthere wasn’t any more work because they had to give the \r\nwork to the men— \r\n \r\nFleming: Right. \r\n \r\nKelly: Was that happening? \r\n \r\nFleming: I don’t know about that because when I came back, \r\nI was pregnant; I had a husband so he did the working and \r\ndid the thing staying at home taking care of the kids as I \r\nstarted having kids. But uh I imagine uh they laid off \r\nafter the war was over, didn’t have to make no wings for B-\r\n29s or nothing of the kind and so on and so on. They laid \r\nthe la—the women off. The—If some of the women still worked \r\nat the Ford in uh Rouge but uh the majority I guess were in \r\n----------------Page (36) Break----------------\r\n 38 \r\nHighland Park and laid them off just for men now, you know, \r\nthe jobs they had before the war started. \r\n \r\nDe Mare: Do you—after you raised your family did you ever \r\ngo back to work or no? \r\n \r\nFleming: Oh yea. \r\n \r\nDe Mare: Can you talk about what you did after that? \r\n \r\nFleming: Well after I raised my—after my family come up I \r\nwent to work uh laundry wasn’t it? Um uh I worked in the \r\nlaundry.  I started cleaning uniforms, I worked—I helped \r\ndrying cleaning the uniforms and pressing. And then after I \r\nleft there I went as a housekeeper for the Heart Hospital \r\nfor so long and after I worked there I was 65 years old.  \r\nIt was time for me to retire.  And I retired. Kids were all \r\nup, some of them were married, some of them grown and \r\neverything, yea most of ‘em. So that’s about my life. \r\n \r\nDe Mare: Is that about your life?  That’s a life! \r\n \r\n----------------Page (37) Break----------------\r\n 39 \r\nKelly: Incredible!  Now can you tell us before we wrap up, \r\ncan you tell the story about your 90\r\nth\r\n birthday and how \r\nDetroit honored you? \r\n \r\nFleming: Well, my daughters gave me a birthday party and \r\nthey still talk about that birthday party. It was so \r\nbeautiful. I had a different one—it was integrated. Had a \r\nwhite doctor and I had...laughs \r\n \r\nFamily Member: laughs \r\n \r\nFleming: What’s wrong? ...What’s wrong? \r\n \r\nFamily Member: We thought there was a rattlesnake. \r\n \r\nFleming: Anyway, each one of my brothers and sisters sent \r\nme $90 for birthday. In fact my sister send me $125 but \r\nthey can afford it. \r\n \r\nDe Mare: And what—and what did the—can you tell the story \r\nabout the Proclamation from the City of Detroit? Because \r\nthat happened on your 90\r\nth\r\n birthday, right? \r\n \r\nFleming: Right. \r\n----------------Page (38) Break----------------\r\n 40 \r\n \r\nDe Mare: Can you tell us— \r\n \r\nFleming: Is this when we went to the City County Building? \r\nWe went to the City County Building. The first time I had \r\nbeen in there—I mean not the building but up where \r\nthe...council, council people were.  And I had a chance to \r\nmeet all the council people.  You know all the council \r\npeople. They were very nice and everything. \r\n \r\nDe Mare: What did they do for you while you were there? \r\n \r\nFleming: Oh they had me to come up with my children and \r\nfriends and so forth and so on and they honored me with uh— \r\n \r\nFamily Member: Resolution. \r\n \r\nFleming: Resolution. She read it off and everything—Brenda, \r\nCouncilwoman Brenda Jones and she read it off to everybody \r\nand then she passed it on to me, which was very nice. \r\n \r\nKelly: And that was for your 90\r\nth\r\n birthday? \r\n \r\nFleming: My 90\r\nth\r\n birthday. \r\n----------------Page (39) Break----------------\r\n 41 \r\n \r\nDe Mare: And they honored you being 90 and for being a \r\nRosie? \r\n \r\nFleming: Both. \r\n \r\nDe Mare: Both. Uh uh, she says I wasn’t Rosie the Riveter I \r\nwas Angeline the Riveter. Well... \r\n \r\nThe End. \r\n \r\n \r\n----------------Page (40) Break----------------\r\n"}