{"id":"evelyn-davidson","identifier":"ROSIE_INTERVIEW_013","hash":"rosie","url":"http://127.0.0.1:8080/interviews/evelyn-davidson","label":"Evelyn Davidson","description":"When the war broke out, Evelyn Davidson became an aircraft mechanic and a civilian employee of the Air Force. ","image":"http://127.0.0.1:8080/images/ROSIE_INTERVIEW_013-interview-thumbnail.jpg","type":"video","content":"When the war broke out, Evelyn Davidson became an aircraft mechanic and a civilian employee of the Air Force.   1 \r\n \r\nEvelyn Davidson \r\n \r\n \r\nThe Real Rosie the Riveter Project \r\nInterview 13 \r\n \r\n \r\n \r\nInterview Conducted by  \r\nAnne de Mare  \r\nJune 27, 2010 \r\nNashville, Tennessee  \r\n \r\n \r\n \r\nFor The \r\nFor the Tamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n----------------Page (0) Break----------------\r\n 2 \r\nInterview: Evelyn Davidson \r\nInterviewers: Anne de Mare  \r\nDate: June 27, 2010 \r\nPlace: Nashville, Tennessee \r\n \r\nDe Mare: The way I’d like to just start is if you could \r\njust introduce yourself to me. Tell me your name and tell \r\nwhere you were born.  \r\n \r\nDavidson: Alright. \r\n \r\nDe Mare: Whenever \r\n \r\nDavidson:  You tell me when to start.  \r\n \r\nDe Mare: You can start right now. \r\n \r\nDavidson: OK.  My name is Evelyn Davidson and I was born in \r\nNorthville, Michigan and came here because of aircraft. \r\n \r\nDe Mare:  You came to this area? \r\n \r\nDavidson: Came to this area, to Nashville to work in \r\naircraft. \r\n----------------Page (1) Break----------------\r\n 3 \r\nDe Mare:  And how did you make your way here from Michigan? \r\n \r\nDavidson:  My daddy was a Superintendant of the aircraft \r\ncompany. And there was an opening for a typist and I was \r\nunderage but I got in.  And read- I learned to read \r\nblueprints and that’s what really got me started on it. \r\n \r\nDe Mare:  And how did you learn to read the blueprints? \r\nJust from- \r\n \r\nDavidson:  My daddy just- I was a daddy’s girl. \r\n \r\nDe Mare: So um, just to take it back for a minute and we’ll \r\ncome back to the aircraft.  Can you tell me a little bit \r\nabout your childhood? \r\n \r\nDavidson:  My childhood was farm work.  We lived on a farm \r\nand daddy worked at the aircraft factory. \r\n \r\nDe Mare:  What did you farm?  What did you grow? \r\n \r\nDavidson: Crops. Just food crops.  In those days that’s \r\nwhat it was. \r\n \r\n----------------Page (2) Break----------------\r\n 4 \r\nDe Mare: And when you- did you ever work- was the job as \r\nthe typist the first job that you had office work? \r\n \r\nDavidson: First job I ever had.  I bought an old Remington \r\nfor $40.00 and learned to type. \r\n \r\n1:33:00---------------------------------------------------- \r\n \r\nDe Mare: Do you remember how much money you earned as a \r\ntypist? \r\n \r\nDavidson:  No. I don’t remember it. \r\n \r\nDe Mare: Ok. \r\n \r\nDavidson:  Money really wasn’t a factor. \r\n \r\nDe Mare: Yea... \r\n \r\nDavidson:  I had a job. \r\n \r\nDe Mare: So where were you when the war broke out? \r\n \r\n----------------Page (3) Break----------------\r\n 5 \r\nDavidson: I was in Nashville. And I signed up the boys at \r\nthe place I worked. I signed up the boys for the draft \r\nfirst. \r\n \r\nDe Mare:  Oh really? \r\n \r\nDavidson:  Yea.  Volunteers. \r\n \r\nDe Mare:  What was that like? \r\n \r\nDavidson: Uh the boys, there not boys, they’re young men. I \r\nhate to call them boys. And uh they were from 19 to 24 age. \r\nAnd uh, they were, we knew that we were going to have a \r\nwar. Period...you help me. \r\n \r\nDe Mare: No I was just curious like it was that’s a \r\nvery...interesting position to be in to sign them up to go \r\naway. And I was just wondering- \r\n \r\nDavidson:  I got an honorary certificate from the Governor \r\nfor being a volunteer.  I was proud of that. I’ve still got \r\nit. \r\n \r\nDe Mare:  Yea... \r\n----------------Page (4) Break----------------\r\n 6 \r\n \r\nDavidson:  But then I married and my husband was drafted.  \r\nHe was in the Air Force, Military Police. And he was sent \r\nto Yuma, Arizona.  So I saved up my $50.00 a month \r\nallotment and flew out there. Stayed out there and uh, \r\nstarted working at the airbase. \r\n \r\nDe Mare:  Can you tell me a little bit about the work you \r\ndid there? \r\n \r\nDavidson: I was aircraft mechanic.  They said I was really \r\nfit for it.  They gave us test after test. And they were \r\nplanning to replace eight men to send them overseas.  They \r\nwanted eight girls to see if they could do the job the men \r\ndid. So uh, we didn’t know what we were applying for. We \r\nthought it was for to be a typist. All of us.  They didn’t \r\ntell us what it was.  We thought- we thought we were going \r\nto apply to be a typist or a filing clerk. So everyone in \r\ntown went out there and you had to be a wife of a military \r\nman in order to qualify first. \r\n \r\n04:00:20------------------------------------------------- \r\n \r\n----------------Page (5) Break----------------\r\n 7 \r\nDe Mare: Really?  So you, but you were working for the \r\nmilitary? You were actually employed by the military? \r\n \r\nDavidson:  I was a civilian employee of the Air Force. \r\n \r\nDe Mare: Wow. \r\n \r\nDavidson: Yea. And they found that I was qualified to be a \r\nmechanic because, mainly because I had followed my daddy \r\naround so much and learned tools and how particular you \r\nhave to be. \r\n \r\nDe Mare: Yea...And would you work on, what were the plans \r\nthat you worked on? \r\n \r\nDavidson: Anything that came in pursuits, bombers, \r\ncarriers... whatever came in I was rained extensively. But \r\nbefore they put me on that they did IQ test, physical, any \r\nkind of a mental.  They did many tests. \r\n \r\nDe Mare: Well I’m sure, you were sending- you were \r\nresponsible for those machines. \r\n \r\n----------------Page (6) Break----------------\r\n 8 \r\nDavidson:  I was responsible for the machines, lives, \r\nwinning the war. \r\n \r\nDe Mare: And how old were you when you were doing that \r\nwork? \r\n \r\nDavidson:  I was probably 20. \r\n \r\nDe Mare: Wow, that’s incredible actually. \r\n \r\nDavidson: It is if you stop to think back about it. \r\n \r\nDe Mare: Did you enjoy doing that kind of work? \r\n \r\nDavidson: I loved it. Yea, I knew I was good at it. And I \r\ntook care with it. I knew what was involved. \r\n \r\nDe Mare:  Now was your husband overseas at that point. \r\n \r\nDavidson:  No.  He was still at Yuma. \r\n \r\nDe Mare: Ok. \r\n \r\n----------------Page (7) Break----------------\r\n 9 \r\nDavidson: And when he transferred to different states, they \r\ntransferred me. I went on the troop trains with the other \r\nguys. \r\n \r\n05:38:07------------------------------------------------ \r\n \r\nDe Mare: And then would you be an aircraft engineer at— \r\n \r\nDavidson:  I was an aircraft mechanic at every- at seven \r\ndifferent places. And they had the job waiting for me when \r\nI got there. \r\n \r\nDe Mare: So where else did work? Do you remember? \r\n \r\nDavidson: I worked from Arizona I went to Shreveport, \r\nLouisiana, Mount Clemens, Michigan, Wilmington, North \r\nCarolina.  The others I don’t know. And then I- yea I think \r\nI retired from the Air Force.  I got a little pay.  And I \r\nretired form it and went to Marietta, Georgia where I was- \r\nbucked rivet for a while. And I broke my hand and of course \r\nthat stopped my bucking rivets because that took strength. \r\n \r\n06:27:16---------------------------------------------- \r\n \r\n----------------Page (8) Break----------------\r\n 10 \r\nDe Mare: Now explain to me what you were doing in Marietta, \r\nGeorgia.  You were bucking rivets for who? For what \r\ncompany? \r\n \r\nDavidson:  Lockheed.  \r\n \r\nDe Mare:  ok. And this was during or after the war? \r\n \r\nDavidson: During the war. \r\n \r\nDe Mare: During the war ok. \r\n \r\nDavidson: So I broke my hand and that stopped that right \r\nquick. And I went to Pennsylvania with my parents and \r\nthat’s when the war ended. My husband got critically \r\ninjured so I never went back into the work. \r\n \r\nDe Mare: What happened to your husband? \r\n \r\nDavidson: He was an MP. He was patrolling the- on Iwo Jima \r\npatrolling the runway. Shooting snipers. And a plane was \r\ncrippled coming in couldn’t help it. The pilot was not at \r\nfault but he landed on my husband who was on a motorcycle \r\n----------------Page (9) Break----------------\r\n 11 \r\nand so that hurt him quite bad.  And uh, so he eventually \r\ngot out of the Air Force on disability.  \r\n \r\nDe Mare: Yea... Now when- did you have children when he was \r\nin the military? \r\n \r\nDavidson: No. \r\n \r\nDe Mare: No. \r\n \r\nDavidson: No I had the children later. \r\n \r\nDe Mare:  Ok... \r\n \r\n07:46:20--------------------------------------------------- \r\n \r\nDe Mare:  And it’s interesting that kind of life where you \r\nare traveling so much between bases as a wife.  Can you \r\ntalk a little about what that was like for you personally? \r\n \r\nDavidson: Actually, I didn’t think about it.  It was not \r\ntops in my mind.  The war was tops. I lived in one place-in \r\nYuma where in a screened in front porch. I got water out of \r\nthe facet in the front yard. And uh, food in a kept in an \r\n----------------Page (10) Break----------------\r\n 12 \r\nice chest. And our bathroom was little building out back \r\nand uh it was in Yuma. The Air Force had a list of places, \r\nrooms mainly, not apartment that the wives go and live \r\nwhile their husbands were on base. \r\n \r\nDe Mare:  So you didn’t live on the base with your husband? \r\n \r\nDavidson: No. \r\n \r\nDe Mare: No, but you were with him? You travelled with him? \r\n \r\nDavidson: He would come home.  Yea he would come home at \r\nnight. And uh, we didn’t worry about it.  We were on \r\nrations, everything was rationed. But it didn’t bother us.  \r\n \r\nDe Mare:  It’s interesting, a lot of the ladies talk about \r\nhow um, they were in the same boat so you really didn’t \r\nfeel the hardship. Did you feel the same way? \r\n \r\nDavidson:  We didn’t- didn’t I felt no hardship. No, \r\nnothing. It’s surprising you think now. If you think back, \r\noh poor me but I didn’t- we didn’t think that way. None of \r\nus did I’m sure. \r\n \r\n----------------Page (11) Break----------------\r\n 13 \r\n09:23:17--------------------------------------------------- \r\n \r\nDe Mare: Now when you broke your hand, you broke it bucking \r\nrivets?  That’s how you broke it? \r\n \r\nDavidson: No. \r\n \r\nDe Mare: No? \r\n \r\nDavidson: Actually no.  I broke it putting things in the \r\ntrunk of my car and the trunk fell on my hand. But that \r\nstopped the riveting. \r\n \r\nDe Mare: Ok. \r\n \r\nDavidson:  And stopped that whole thing. \r\n \r\nDe Mare: What was it like working at the- at Lockheed? What \r\nwas that like for you? \r\n \r\nDavidson: It was hot. It was awful hard. It hurt muscles. \r\nIt was muscle work and um in those days, I had them. \r\n \r\nDe Mare: Yea... You’re funny. \r\n----------------Page (12) Break----------------\r\n 14 \r\n09:58:04--------------------------------------------------- \r\n \r\nDe Mare: Did, Now did— \r\n \r\nDavidson: Now days you can wave with those muscles.  \r\n \r\nLAUGHS \r\n \r\nDe Mare: Now when you were working at, it was in Marietta, \r\nGeorgia? \r\n \r\nDavidson: Marietta, Georgia. \r\n \r\nDe Mare:  What was- were you working with was it just women \r\nyou were working with or women and men? \r\n \r\nDavidson: Women and men. \r\n \r\nDe Mare: Women and men, ok. And did you have a good \r\nrelationship with the men you worked with. Can you talk a \r\nlittle about that because that was unusual at the time. To \r\nwork like that. \r\n  \r\n----------------Page (13) Break----------------\r\n 15 \r\nDavidson: Yea it was. No it was everybody was equal. We \r\nwere all working for one thing. \r\n \r\nDe Mare: Yea... \r\n \r\nDavidson: And we knew that planes were coming in trying to \r\novertake the country. And that’s what we were fighting for. \r\n \r\n10:41:01------------------------------------------------- \r\n \r\nMimi: What did you do for fun when you weren’t working and \r\nyour husband was overseas?  How did you entertain yourself? \r\n \r\nDavidson: We didn’t. We got up, came home and washed the \r\nuniform. Uh, we had jumpsuits...uh, we wore jumpsuits. And \r\nuh, I was small you know, I never got fat.  No for fun we \r\ndidn’t really look for fun. In Arizona we would get in a \r\nJeep and take off across the desert and look at \r\njackrabbits. Big fun. We didn’t try to hurt them we just \r\naccepted those long ears you know they were fascinating and \r\nriding in a Jeep over those sand dunes. No I can’t think of \r\nfun, actually we weren’t look fun.  We were looking to keep \r\nthose planes off our borders. \r\n \r\n----------------Page (14) Break----------------\r\n 16 \r\nMimi: What was it like wearing pants? \r\n \r\nDavidson: Fun. \r\n \r\nMimi: Yea. \r\n \r\nDavidson: We felt like we were equal you know.  We were \r\ntaking the place of a man and yea it felt natural. \r\n \r\nDe Mare:  Well thank you so much for opening- talking to \r\nus. I really appreciate it. \r\n \r\nDavidson: Ok. It was hard at all \r\n \r\nDe Mare:  See I told. I told you it wasn’t going to be \r\nhard. Yea. \r\n \r\nMimi: We’re not making you take a test. \r\n \r\nDe Mare: No... I love- \r\n \r\nDavidson:  No... I bet ya I could pass it though. \r\n \r\n12:07:00--------------------------------------------------- \r\n----------------Page (15) Break----------------\r\n 17 \r\n \r\nDe Mare: I bet you could too.  I love the fact that you \r\nwent from- that you didn’t know what you were going up for \r\nwhen you became an aircraft mechanic. I love that you were \r\ntwenty years old, had never been a mechanic and all of a \r\nsudden you are up there keeping these planes up in the air \r\nI’m that’s extraordinaire.  \r\n \r\nDavidson: They tested, they tested coordination, IQ, metal, \r\nphysical, background. \r\n \r\nDe Mare:  How did your husband feel about the fact that you \r\nwere doing that work. \r\n \r\nDavidson:  He was all for it. He knew I could do it. And I \r\nknew how, I knew I cold do it...yea. \r\n \r\nDe Mare: What did you work...when you did work on the farm as \r\na kid, what were you responsible for? \r\n \r\nDavidson: Actually nothing. Nothing, except...uh well we \r\nlived next to the penitentiary and daddy would go over with \r\nhis big old truck in the morning and they would and some of \r\nthe men were allowed go out for the day and they loved \r\n----------------Page (16) Break----------------\r\n 18 \r\ncoming to the farm. And daddy had a market truck and uh, \r\ninmates did the work for us and they were thrilled to be a \r\npart of a home.  \r\n \r\nDe Mare: I bet. \r\n \r\nDavidson: Yea, and he would take them back at night. \r\n \r\nDe Mare: I’ll bet. \r\n \r\nDavidson: But daddy always insisted that they wash, comb \r\ntheir hair and they brush their clothes off. Uh yea, but \r\nthey had a big long table out under and apple tree where \r\nthey thought they were at home- felt at home. \r\n \r\nDe Mare: Did you ever go back to Michigan? \r\n \r\nDavidson: Oh yea, we go back all the time. It’s where my \r\nfamily is. Yea... \r\n \r\nDe Mare: Where in Michigan? What part of Michigan? \r\n \r\n----------------Page (17) Break----------------\r\n 19 \r\nDavidson: All over it. Yea... I have a sister in Romulus. I \r\nwas born in Northville- lower Michigan. I have family up \r\nnorth. And around Traverse City. \r\n \r\nDe Mare: I love Michigan. I spent a lot time in Michigan a \r\nfew years back. \r\n \r\nDavidson: It’s got a lot to say for it. And the people are \r\nkind of a special breed, I think. Up there it seems like.  \r\nBut I I mainly- I was an outdoor child and uh, developed a \r\nlot skin cancer because of it. \r\n \r\nDe Mare:  We didn’t know. \r\n \r\nDavidson: No. No one knew. \r\n \r\n12:34:10------------------------------------------------- \r\n \r\nDe Mare: Wow, no one knew...Well thank you so much. That’s \r\nit. You’re done. You did a great job. \r\n \r\nDavidson: Oh yea... \r\n \r\n----------------Page (18) Break----------------\r\n 20 \r\nDe Mare: Are there any stories that she’s not telling us \r\nthat we need to hear? \r\n \r\nFamily Member:  Well when they were kids they went cherry \r\npicking and that was their summer fun. \r\n \r\nDavidson: Yea... \r\n \r\nFamily Member: They went cherry picking in Traverse City \r\nand they camped for the whole summer because it was the \r\nDepression.  \r\n \r\nDavidson: It was during the Depression. \r\n \r\nFamily Member: Yea... \r\n \r\nDavidson:  And daddy didn’t let us go hungry.  He said, \r\n‘let’s go camping.’ So we’d go up to Traverse City and camp \r\nout in the cherry orchards and pick cherries, make enough \r\nmoney to do- for what we needed.  \r\n \r\nFamily Member: When she was in Yuma she lived on screened \r\nin front porch. \r\n \r\n----------------Page (19) Break----------------\r\n 21 \r\nDavidson: Yea... \r\n \r\nFamily Member: And she didn’t have any way to keep her food \r\ncool so they- she didn’t know how to drive but she drove an \r\nold rattle track truck. \r\n \r\nDe Mare:  Oh you have to tell us that story. You have to \r\ntell us that. \r\n \r\nDavidson: I had no idea how a car worked except we pushed a \r\nbutton on the dashboard to start it and I knew where the \r\nbreak was and that’s it. And so we would drive to the \r\nicehouse and put a quarter in, it was the honor system, \r\nyou’d put a quarter in.  You go it and get a big chunk of \r\nice, 25 pounds, take it home and put it in the cooler. And \r\nthat was our refrigerator.  \r\n \r\nDe Mare:  I think it’s hysterical that you didn’t know how \r\nto drive and you and you were an airplane mechanic. \r\n \r\nDavidson: I did not know how to drive. I had no idea how to \r\ndrive a car. \r\n \r\nFamily Member: She’d hit the curb. \r\n----------------Page (20) Break----------------\r\n 22 \r\n \r\nDavidson: Yea.  I hit the curb a few times and jumped over \r\na few lawns and went through some hedges but we got our \r\nice. \r\n \r\n16:22:08------------------------------------------------ \r\n \r\nDavidson:  I mean you made due in those days. Yea, if there \r\nwas something you wanted to do you were going to find a way \r\nto do it. And I found a way to get ice.  Push on that \r\nbutton and put on the break when I needed. \r\n \r\nDe Mare: That’s wonderful. \r\n \r\nFamily Member: Bob Hope. \r\n \r\nDavidson: Oh yea, Bob Hope had programs in the hangers out \r\nthere...of course we’d makeshift. Make him a stage make \r\ncurtains for the crew and everything. That was a big deal. \r\n \r\nDe Mare: You would do that? \r\n \r\nDavidson: No, we helped. We put up the ladders and the \r\nsheets for the stage crew. \r\n----------------Page (21) Break----------------\r\n 23 \r\n \r\nDe Mare: You know, it’s funny being from a different \r\ngeneration and a different world, now.  I just think it’s \r\nso extraordinaire how unified people really felt about what \r\nwas going on.  \r\n \r\nDavidson:  We were one person. It just seemed like \r\neverybody was on one job.  That’s that’s the feeling you \r\ngot. \r\n \r\nDe Mare: Do you remember when that feeling went away? \r\n \r\nDavidson:  No I don’t think it ever did.  I think we still \r\ndo that. Ya know. I really do. \r\n \r\nDe Mare: Good good good. \r\n \r\nDavidson: Of course there are off shoots. But there are \r\nmore people now than there was then.  But no, I think we \r\nstill want the same things. \r\n \r\nDe Mare:  Well thank you. \r\n \r\n17:53:09------------------------------------------------ \r\n----------------Page (22) Break----------------\r\n 24 \r\n \r\nFamily Member:  Tell them about the steering wheels on the \r\nplanes when they would come in crippled and injured. \r\n \r\nDavidson: Yea...the planes would come in some would have \r\nflesh on them- skin, hair that we would have to steam clean \r\noff. And uh, that’s part of the mechanic work and uh, \r\ninsides of planes would be uh, show damage where people had \r\ngotten shot.  And uh, we’d clean it- steam clean it. And on \r\nthe steering wheel of- there isn’t a steering wheel on a \r\nplane but it’s up here.  It’s got a button in the middle, \r\nput it that way. And uh, the mechanics would flip that \r\nbutton off to clean under it. There was a little hollow \r\nplace where we’d leave a note- the pilot would leave a \r\nnote. ‘Call mom. Tell her I’m ok.’  Or uh, ‘hope you have a \r\ngood day.’ Just anything. We’d write a note back to him and \r\nput it under that cap, under that little cylinder that \r\nlittle round cap.  And I guess that’s the first thing they \r\ndid when they got in the plane. Lift that and see what the \r\nmechanic had to say.  Some were a little bit leery of \r\nfemale mechanics but they learned, yea. Because we knew \r\nwhat was involved. \r\n \r\n----------------Page (23) Break----------------\r\n 25 \r\nDe Mare:  Do you think that doing that kind of work, that \r\nkind of work that had been done by men before.  Um, do you \r\nthink that changed how you raised your own children?  Do \r\nyou think that changed how you- \r\n \r\nDavidson: No. \r\n \r\nDe Mare: No? \r\n \r\nDavison: No because I would have raised them...they’re both- \r\nI’ve got two and I raised them both that way. To- if you \r\nwant something done, find out a way to do it. Yea, don’t \r\nwait for it to be handed to you. And uh, I think that’s \r\nwhat it takes. \r\n \r\nDe Mare:  That’s very good advice. \r\n \r\nDavidson: Find out your way. \r\n \r\nDe Mare:  That’s very good advice. \r\n \r\nDavidson: And both of my kids- well you can see what one of \r\nthem is like.  The other is the same way. \r\n \r\n----------------Page (24) Break----------------\r\n 26 \r\nDe Mare:  Seems like you did pretty well. \r\n \r\nDavidson:  Yea, I did. If I had known they were going to be \r\nthat good, I might have had a house full of them. \r\n \r\nDe Mare:  That’s wonderful. \r\n \r\nDavidson:  It’s a fact! \r\n \r\nDe Mare:  Thank you so much.  Thank you so much. \r\n \r\nDavidson:  So I can get out of here? \r\n \r\nDe Mare: You can get out of here! \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n----------------Page (25) Break----------------\r\n"}