{"id":"idilia-johnston","identifier":"ROSIE_INTERVIEW_004","hash":"rosie","url":"http://127.0.0.1:8080/interviews/idilia-johnston","label":"Idilia Johnston","description":"Idilia rebelled against her strict father by getting a defense job for the Ohio Crankshaft Company. ","image":"http://127.0.0.1:8080/images/ROSIE_INTERVIEW_004-interview-thumbnail.jpg","type":"video","content":"Idilia rebelled against her strict father by getting a defense job for the Ohio Crankshaft Company.   \r\n \r\n \r\n \r\nIdilia Johnston \r\n \r\nThe Real Rosie The Riveter Project \r\n \r\nInterview 4 \r\n \r\n \r\n \r\n \r\n \r\n \r\nInterview Conducted by \r\n \r\nAnne de Mare & Kirsten Kelly \r\n \r\nApril 14, 2010 \r\n \r\nLutherville, Maryland \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\nFor The \r\n \r\nTamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n----------------Page (0) Break----------------\r\n \r\nInterview: Idilia Johnston \r\n \r\nInterviewers: Anne de Mare & Kirsten Kelly \r\n \r\nDate:  April 14, 2010 \r\n \r\nPlace:  Lutherville, Maryland \r\n \r\n \r\n \r\nDe Mare:  Alright, so just to start, can you introduce \r\nyourself, and tell me your name, and tell me when you were \r\nborn? \r\n \r\nJohnston:  My name is Idilia Johnston and I was born in \r\n1924.   \r\n \r\nDe Mare:  And where were you born? \r\n \r\nJohnston:  Cleveland, Ohio.   \r\n \r\nDe Mare:  And can you talk to me a little bit about your \r\nchildhood?  What your, what your life was like? \r\n \r\nJohnston:  Well, my family was very controlling.  My mother \r\nand father were very controlling. They were from Scotland, \r\nand, um, they really dominated us.  And we did what we were \r\ntold.  And then when I wanted to go to work, my dad said, \r\n----------------Page (1) Break----------------\r\n“You’re going to stay home and help Mama.”  And I said, “I \r\ndon’t want to stay home and help Mama.”  And I went down to \r\nCleveland and I got a job in a bank.  And... in the \r\nbookkeeping department.  And I came home and told them.  \r\nAnd I was seventeen at the time, so just before my \r\neighteenth birthday, my father went down and- to the \r\npersonnel department- and told them that I was needed at \r\nhome, and I could no longer work for the bank.  And because \r\nI was not eighteen, I had to go home.  And I had to do the \r\nlaundry, all that stuff.  I did not like it. \r\nA few months later, I think it was August of that \r\nyear, I went downtown and got a job with Allied Loyal.  And \r\nI learned IBM, the beginning of IBM, which was wonderful.  \r\nWith the great big machines and all that stuff.  And I \r\nthought that was terrific.  But my father was still trying \r\nto get me to go home.  And he went to personnel and they \r\ncalled me in and I was eighteen and I said, “I don’t want \r\nto go home.”  But my father said, “You are going home.”  \r\nAnd home I went.   \r\nSo I thought, how can I do this?  So one day I was \r\ndowntown, all dressed up in my best clothes, and I went \r\ninto a storefront that was hiring for defense plant work.  \r\nAnd I said I wanted a job in a factory.  And they said, \r\n“Well, you don’t fit in a factory.”  And I said, “Why not?  \r\n----------------Page (2) Break----------------\r\nThat’s where the best money is.  I wanna work in a \r\nfactory.”   And they said, “Well, we’ll get you to a \r\ndefense pl...”  And I told them why, and they said, “We’ll \r\nget you to a defense plant but you won’t work in a factory, \r\nin the factory.”   \r\nSo I worked in the office and the assistant \r\ncomptroller had just been drafted.  So I worked for the \r\ncomptroller; I became the assistant contract... uh, \r\ncomptroller. And it was a wonderful job.  I had one machine \r\nthat was numbers and percentiles and figures like that, and \r\nthen I had- Brad Freedent Calculator came out at the same \r\ntime- and I had a brand new Freedent Calculator to work- \r\nget my percentiles.  And I made bar graphs, circle graphs, \r\ngraphs, line graphs- all kinds of graphs for the weekly \r\nmeetings, the bi-weekly meetings and the monthly meetings \r\nfor the board of Ohio Crankshaft.  And that’s what my job \r\nwas.   \r\n \r\n00:03:29:03------------------------------------------------ \r\n \r\nJohnston:  I had a drafting table outside the office- \r\ncubicle is what the comptroller had- and I had a drafting \r\ntable outside the office where I did all my work.  And I \r\nhad another desk to do my mathematics and, uh, to get the, \r\n----------------Page (3) Break----------------\r\num, graphs printed for the board to use I had to go to the \r\nblueprint department because it was before Xerox or \r\nanything like that.  The blueprint department had to do it.  \r\nAnd they did it on great, big, huge pieces of paper.  And \r\nthen they would cut them in sections that I needed, and \r\nthen I had to collate everything by hand and get them to \r\nthe board meetings on time.  And that was my job. \r\nBut I think, um, one of the things that it did for me \r\nwas, I was kind of working independently and the \r\ncomptroller did not hover over me, make sure I was doing \r\neverything right.  And being independent and knowing that I \r\ncould think for myself, I didn’t need my mom and dad to \r\ntell me what to do, I became very self sufficient, and I \r\ncame out of my shell.  Before that I had been meek, mild, \r\nif somebody said “Boo”, I jumped, you know.  So I became a \r\nperson unto my myself, and I loved it.   \r\nAnd at that time, my mom and dad were sc... they weren’t \r\nscared of me, but they were afraid of what type of person I \r\nwas becoming.  Because I never did talk back, but they \r\ncould see I was be... becoming more and more independent.  \r\nAnd my father... the first day I was going to the job, we had \r\nto carpool.  They... uh, Ohio Crankshaft... Crankshaft \r\nCorporation set you up with a carpool.  So the first \r\nmorning they came to the house my father went out, and \r\n----------------Page (4) Break----------------\r\nthere’s men almost my father’s age in the car, four of ‘em, \r\nand I’m gonna sit in the backseat between these guys.  And \r\nmy father had a long talk with them before I came out, and \r\nI never had a bit of trouble from those gentlemen. (laughs)  \r\nNot a bit. And every morning they were there, picking me up \r\nat, oh, I think it was seven o’clock in the morning to go \r\nto work. \r\n \r\n00:06:06:09------------------------------------------------ \r\n \r\nDe Mare:  Well, I think it’s really interesting that you \r\ndescribe yourself as being so meek when you were very \r\ndetermined to take, to get a job. \r\n \r\nJohnston:  Mm-hm. \r\n \r\nDe Mare:  You were, it sounds like you were extremely \r\ndetermined to get out from that house.  \r\n \r\nJohnston:  Um--- \r\n \r\nDe Mare:  And the housework. \r\n \r\n----------------Page (5) Break----------------\r\nJohnston:  Uh, at that time I had to be in bed at 8:30 at \r\nnight.  Lights out.  Now, I’m seventeen, eighteen, \r\nnineteen, twenty, and if I had a date and I did not clear \r\nit with my mom and dad, and they did not know of the man or \r\nyoung boy, when I was all dressed coming down the stairs to \r\nmeet him at the door, my father would look at him if he \r\ndidn’t like him, uh, “Get out of here, never date my \r\ndaughter again.”  Even though they had given me permission, \r\nI’d have to go back upstairs to my room, pretend nothing \r\nhappened, and the next morning when I came downstairs to \r\nbreakfast, I would act like nothing happened.  And I don’t \r\nknow if that riled my father or not but I just would, well, \r\nthat’s the way Daddy is and that’s it.  So it was tough to \r\nhave a date if Daddy didn’t know- my- my mother and father \r\nwould want to know the parents of the person that I was \r\ndating; that’s how bad it was.   \r\nSo when I got out of the house I became a different \r\nperson and as I said, a person unto my own self.  I... I \r\nthink I became the person I am today.  (Laughs)  And, uh, \r\nbut I was determined that, uh, I just was not gonna have \r\nthat heavy thumb on me, and having to stay home.  And I was \r\nnot allowed to take a lunch with me from the house.  The \r\nfood we had in the house had to stay in the house.  I got, \r\nI started at thirty-seven fifty a week, had to give my \r\n----------------Page (6) Break----------------\r\nparents twenty dollars, and the rest I got to keep for \r\nmyself.  That was lunch money, and whatever else was going \r\non.  I had to do that. \r\n \r\nDe Mare:  Did you buy your own clothes on your own? \r\n \r\nJohnston:  Oh, yes. \r\n \r\nDe Mare:  Can you talk about that? \r\n \r\nJohnston:  Well, one thing my mom and dad had a fit about \r\nwas I always loved shoes, and I had... I bought spectator \r\npumps, I bought saddle shoes, I bought this, I bought that; \r\nI had every kind of new, kind of shoe that was coming out.  \r\nAnd of course the three-inch heel was out then, not the \r\nstilettos, but the three-inch heel.  And I had suede shoes, \r\nand I had an emerald green suit that I bought for myself.  \r\nIt was a two-piece swoon suit and I got emerald green \r\nthree-inch heel suede shoes.  And my mom and dad just \r\nlooked at me.  (Laughs)  So I, I really did buy clothes, \r\nbecause I didn’t have to have what Mom and Dad picked out \r\nfor me.   \r\n \r\n00:09:20:02------------------------------------------------ \r\n----------------Page (7) Break----------------\r\n \r\nDe Mare:  So it really was your independence. \r\n \r\nJohnston:  Yes, it was. \r\n \r\nDe Mare:  Even though you were still living at home, it \r\nreally was. \r\n \r\nJohnston:  Yes.  Yep. \r\n \r\nKelly:  Can you wait...  just for one sec- \r\n \r\nDe Mare:  Yep. \r\n \r\nKelly:  I just wanna ask, was it, was it a religious \r\nhousehold?  Was that part of the...? \r\n \r\nJohnston:  Uh, we children had to go to Sunday School, \r\nPresbyterian Sunday School, but Mom and Dad never did.  Mom \r\nwould play the piano for Sunday School once in a while, \r\nbut, uh, there was not a religious household.  In fact they \r\nused to call me the Holy Roller because I was so active in \r\nchurch.  For, ever since I was a little girl I was doing-  \r\n----------------Page (8) Break----------------\r\noutside the household, so you... that tells you what the \r\nhousehold was like.   \r\n \r\nDe Mare:  Why did you choose... why did... why did that sign \r\nout...  for looking for defense work... why... why did you \r\ngravitate towards that?  Did you feel like your father \r\ncouldn’t say no to that? \r\n \r\nJohnston:  Well, see... \r\n \r\nDe Mare:  Or, or was that... \r\n \r\nJohnston:  Once you were hired by a defense plant, you \r\ncould not go any place.  You stayed at the defense plant.  \r\nAnd you could not be fired either.  You were at the defense \r\nplant and you were there to work.  And I... that’s what I \r\nknew, and that’s why I wanted to go to a defense plant.  To \r\nget Daddy off my back.  But he still kept at me anyway.  \r\nAnd as I said, I had to uh, uh, be in bed at eight-thirty, \r\nlights out, and all this and, heck, you know, twenty years \r\nof age you don’t want to do that. \r\n \r\nDe Mare:  No. \r\n \r\n----------------Page (9) Break----------------\r\nJohnston:  No. \r\n \r\nDe Mare:  No.  When... when you... when you got the job, you \r\nsaid you got the job because the assistant comptroller had \r\nbeen drafted.  But you also said that they told you they \r\nweren’t going to put you in the factory. \r\n \r\nJohnston:  They... \r\n \r\nDe Mare:  Can you... can you tell... talk to me a little bit \r\nabout what the... what was going on with the women in the \r\nfactory work at that time and what was the... \r\n \r\n00:11:08:23------------------------------------------------ \r\n \r\nJohnston:  It was as, um, Violet said, it was the attitude \r\ntowards the women working in the factory; you were a lower \r\nclass.  And I had been out with... to lunch with my friends \r\nand... in downtown Cleveland... and I stopped in there, and I \r\nwas in my high heels and my new good clothes, and uh, they \r\nsaid “You’re not for the factory.”  And I said, “Why?  I \r\nwanna go where the money is.”  And they made more money \r\nthan I did.  So, I started at thirty-seven fifty.  I left \r\n----------------Page (10) Break----------------\r\nthere, I was making fifty-two dollars a week.  But I, what \r\nelse do you want to ask me about the factory? \r\n \r\nDe Mare:  Well, I am... I’m curious as to... the name... the name \r\nof the company was Ohio Crankshaft? \r\n \r\nJohnston:  Mm-hm. \r\n \r\nDe Mare:  What did they make for the war? \r\n \r\nJohnston:  Crankshafts for the automobiles, the ships, \r\nairplanes.  Everything that has a motor has to have a \r\ncrankshaft.  So they made crankshafts.  All kinds.  And \r\nwalking through the factory, from my office to go through \r\nthe factory to blueprinting to get these things printed all \r\ntime, I was always walking through the factory.  I was not \r\nallowed to stop and talk to any of my friends that I might \r\nknow.  Um, once I did and the foreman came up and I really \r\ngot bawled out.  And he said, “You do that again,” because \r\nI was taking them off the line... production... I was slowing \r\ndown production.  So he said, “The next time you do it, \r\nyou’re out. You won’t be allowed in.”   \r\nAlso, I had to make sure that I didn’t wear anything \r\nfrilly or anything like that, walking through the factory.  \r\n----------------Page (11) Break----------------\r\nYou...   I wore... I was very conservative anyway in my \r\ndressing, at that time.  So, uh, you could not wear \r\nanything that was frilly or fluffy or anything like that \r\nwalking through the factory. \r\n \r\nDe Mare:  Because? \r\n \r\nJohnston:  I guess danger.  Anything could fly out and get \r\ncaught on your clothes, caught on something.  And \r\nespecially if you stopped to talk to somebody.  But I \r\ndidn’t do that.  I only did that once and... (laughs)... \r\nslowing down production.  \r\n \r\n00:13:36:06------------------------------------------------  \r\n \r\nDe Mare:  Um, what was the... what was your... what was the \r\nkind of... what was the ratio of men/women to work, women \r\nworking at that time in the factory?  Both where you were \r\nin the office and down on the line?  Can you talk about how \r\nthat population shifted? \r\n \r\nJohnston:  It was definitely men that were, um, what should \r\nI say?  I’m trying to think of the correct word.  They were \r\nin charge of us in the office.  They were the leaders.  \r\n----------------Page (12) Break----------------\r\nLike the comptroller was a man, somebody else was a man, \r\nand then the women were hired under that.  Uh, in the \r\nfactory, most of the men were my father’s age, maybe a \r\nlittle bit younger, but always with children and, uh, \r\nthings of that sort.  And I don’t know, I’m sure there was \r\nmen on the line, but all the men that I saw walking through \r\nthe factory, they were foremen and supervisors and things \r\nof that sort.   \r\n \r\nDe Mare:  And who was on the line?  Was it women on the \r\nline? \r\n \r\nJohnston:  Women and men. \r\n \r\nDe Mare:  Women and men? \r\n \r\nJohnston:  Yeah. \r\n \r\nDe Mare:  And what was the... when I asked Violet earlier \r\nabout the pay scale, did you make as much money as the men, \r\ndid you... \r\n \r\nJohnston:  No. \r\n \r\n----------------Page (13) Break----------------\r\nDe Mare:  I heard your voice over there.  Can you talk \r\nabout that?  Can you talk about what that was like?   \r\n \r\nJohnston:  Well, uh, at that time we were very, very \r\npleased to be getting what we got.  I mean, if it was ten \r\ndollars, it was a lot more than we had before we walked in \r\nthe door.  Um, but it was... we did not think that, “Oh well, \r\nwe’re not getting the same as the men,” or anything of that \r\nnature.  I think that attitude came out a lot later.  And \r\nyou mentioned unions before?  There was never any talk \r\nabout union around where I was.  No, I never heard anything \r\nabout unions.   \r\n \r\nDe Mare:  Nothing.  You didn’t... \r\n \r\nJohnston:  No. \r\n \r\nDe Mare:  Any, anywhere in the factory?  There wasn’t even... \r\n \r\nJohnston:  No, no. \r\n \r\nDe Mare:  Ok. \r\n \r\n00:15:33:25------------------------------------------------ \r\n----------------Page (14) Break----------------\r\n \r\nJohnston:  Uh, everything was for the war effort.  And, um, \r\nas far as food at home and things of that sort, everything \r\nwas according to, uh, the stamps that we got.  And if we \r\ndid not have stamps for sugar, you didn’t use sugar.  Um, \r\nand, um, during the war when we could only buy a certain \r\nnumber of shoes a year, that was all you got.  And, um, Mom \r\nand Dad had five children so we got a lot more than a lot \r\nof the others.   \r\nBut going to be hungry?  There was many times I can \r\nremember going to bed hungry.  And we got food stamps, and, \r\nuh, the food we got was... sometimes we would get a great, \r\nbig bag of food, of potatoes.  A big, you know, burlap bag \r\nof potatoes.  And that would be what we ate all week and \r\nMom learned to cook it in a lot of different ways.  But, \r\nuh, it wasn’t until later in the war that you could go to \r\nthe store, the supermarket and things like that and get \r\nwhat you wanted.   \r\n \r\nDe Mare:  What did your father do?  What was his job? \r\n \r\nJohnston:  He was a carpenter.  And so, he did not have a \r\nbig paying job.  If he didn’t work he didn’t get paid.  So \r\nwhen he took off of work to come and try to get me to go \r\n----------------Page (15) Break----------------\r\nhome, that day he was not getting paid.  So that’s how \r\ndetermined he was that I was gonna go home. \r\n \r\nDe Mare:  You said there were five of you in the family.  \r\nWere... brothers, sisters?  How did... \r\n \r\nJohnston:  I had one brother and three sisters.  There was \r\nfour girls and a boy.  My brother was the oldest. \r\n \r\nDe Mare:  And was he in the service? \r\n \r\nJohnston:  Yes, he was.  He was in what they call the Army \r\nAir Corp.  Wasn’t the Air Force, it was the Army Air Corp.  \r\nAnd he was stationed in Italy.   \r\n \r\nDe Mare:  What was it like for you as a young woman with \r\nyour brother away? \r\n \r\nJohnston:  Not very different.  ‘Cause he was a curmudgeon.  \r\nAnd nothing was ever right, and, uh, he and I didn’t get \r\nalong too well together.  Although I can remember a couple \r\nof times when he didn’t have a date, we would go roller \r\nskating or dancing or something of that sort.  But I think \r\nhe was desperate.  (Laughs) \r\n----------------Page (16) Break----------------\r\n00:18:05:13------------------------------------------------ \r\n \r\nDe Mare:  We haven’t heard from a lot of women whose family \r\nsituations were what you’re describing, in terms of the \r\nrepression. \r\n \r\nJohnston:  Mmm. \r\n \r\nDe Mare:  You know, so it’s very interesting to hear from \r\nyour perspective on what the work meant to you, what it \r\nmeant to leave the house... \r\n \r\nJohnston:  Mm-hm. \r\n \r\nDe Mare:  And have your own life.  And I can hear in your \r\nvoice how important it was to you.  Um, and I want you to \r\ntalk as much about that as you want to, ‘cause I think \r\nthat’s really interesting for people to understand.  \r\n \r\nJohnston:  Yeah. \r\n \r\nDe Mare:  You know, especially now.  Um, so, can you talk a \r\nlittle bit... you were... you were... you were working, you were \r\nearning good money- thirty-six dollars a week, thirty-seven \r\n----------------Page (17) Break----------------\r\ndollars a week- you gave your parents the money, so you \r\nwere still living at home.  Can you talk about what it was \r\nlike... who you... who you worked with in the... in the... in the \r\nfactory and what it was like to kind of make you way out in \r\nto this greater world, and as much as you want to about \r\nthat time in your life. \r\n \r\nJohnston:  Um, I think, um, meeting different people, and \r\nfrom all sections, and, uh, I had two very good friends \r\nthat... their husbands were in the service and they were \r\nrooming together.  And they had a room in an old Victorian \r\nin Cleveland and uh, then other friends came along, and, \r\nuh, to see their independence and to see my other friends, \r\nuh, they were far... further along in being independent than \r\nI was.  I was still shy at that time.   \r\nAnd, uh, it really taught me a lot.  And it taught me \r\na lot to be, uh, self-assured that I could... I could do \r\nthings.  You know, Mom and Dad were always saying, “Well. \r\nyou’re this, you’re that, you can’t do that, you can’t do \r\nthat.”  Well, I found out I could do it.  And I wanted to \r\ndo it.  And it made me more eager for more.  And, um, I \r\nthink that’s why I did leave Ohio Crankshaft.  But how did \r\nI get out?  Well, this, um... I had to go to personnel and \r\nhis name was Mr. Fish, and he kept saying, “No, you have to \r\n----------------Page (18) Break----------------\r\nunderstand this is the way it is when you go in to the \r\nfactory, da da da da da.  After the war you can do what you \r\nwant, but you have to stay here.”  And I said, “I want to \r\ngo in to the Waves.”  He kept telling me why I could not do \r\nsuch a thing and why he could not let me go.  And I wasn’t \r\nbuying it.  And he got a phone call.  And while he was \r\ntalking on the phone I was looking at the pictures on his \r\ndesk, and there was one of a sailor that I knew. \r\nAnd when he came back I said, “Are you Ned Fish’s \r\nfather?”  He says, “Yes.”  He says, “How do you know Ned?”  \r\nI said, “I... I was dating him.”  And he said, “No, you \r\nweren’t.  That... you’re just saying that.”  And I said, \r\n“When he was home the last time, your daughter just had a \r\nbrand new baby,.  It was less than a week old.  Ned and I \r\nwent to visit her and her husband, and, uh, the baby’s name \r\nis such-and-such,” and I said, “We spent a couple of hours \r\nand then we went roller skating.”  And he said, “You do \r\nknow Ned.”  And I said, “Yes.”  He says, “You can go in the \r\nWaves.”  And that’s how I got out of the factory. \r\n \r\n00:21:46:29------------------------------------------------ \r\n \r\nDe Mare:  Can you tell for the camera, ‘cause a lot of \r\npeople won’t know what the Waves are, what they are? \r\n----------------Page (19) Break----------------\r\n \r\nJohnston:  Well, it’s a women’s organization of... I sh... \r\nassociation of the Navy.  And they were called Waves \r\nbecause of waves in the Navy.  And, uh, the army had the \r\nWa... Wax.  Uh, Wasps were the Coast Guard, and what did they \r\ncall the Marines?  Marines.  I think so.  And the Waves \r\nwere the Navy.  And I joined the Navy because I liked their \r\nuniform.  (Laughs)  That’s why I joined.  And I had my boot \r\ntraining, my Navy training at Hunter College in The Bronx, \r\nwhich is now Lehman College.  He was the governor of the \r\nstate at one time, and that’s where I had my boot camp \r\ntraining.  For six weeks. \r\nAnd then they wanted to send me back to Cleveland to \r\nwork in the Bu-Per’s office.  That’s the, uh, the Bureau of \r\nPersonnel, where you made out checks and the bookkeeping \r\ndepartment.  And I could live at home.  And I said, “No.  I \r\ndon’t want to go home.”  So they sent me to a psychiatrist \r\nat the Navy there, they had a psychiatrist.  And she \r\ninterviewed me for a couple of hours, and they sent me to \r\nCalifornia.  To Oakland, California.  (Laughs) \r\n \r\n00:23:24:26------------------------------------------------ \r\n \r\nDe Mare:  And what did you do in Oakland, California? \r\n----------------Page (20) Break----------------\r\n \r\nJohnston:  I was working for Overseas Follow-up.  And that \r\nmeant that if, uh, a ship or anybody in the Navy ordered \r\nanything from, say, the Islands, and the shipment was sent \r\nout and they didn’t receive it when we received a notice \r\nthat they didn’t receive it.  Well, I would follow-up and \r\nsee where that was.  I would follow... trace it.  And I would \r\nfind it, and if it had not been broken, I would reship it.  \r\nBut if it was broken they kept it, and I had to reorder it \r\nand make sure it got where it was supposed to go.  That was \r\nmy job. \r\n \r\nDe Mare:  How did your father feel about you joining the \r\nWaves? \r\n \r\nJohnston:  I went down in, uh, it was March, to join the \r\nWaves, and they told me that I had to gain twenty-two \r\npounds- I only weighed a hundred pounds- and they said you \r\nhave to gain twenty-two pounds and we’ll take you.  So all \r\nthis time I’m trying to gain weight between March and \r\nNovember.  I gained sixteen and they said they would take \r\nme.  So I came back- I wasn’t twenty-one yet- my mom and \r\ndad had to sign papers, which Mom and Dad would not do.  So \r\nfinally it came to the last day that they maybe would take \r\n----------------Page (21) Break----------------\r\nme and I said, “Daddy,”- he came home from work- I said, \r\n“Daddy, I’m cooking dinner tonight, you and Mama are going \r\ndown to have these papers notarized, I’m going into the \r\nWaves.”  And he looked at me and says, “You are?”  And I \r\nsaid, “Yes, this is the last day that you can sign.”  So \r\nMother said, “Oh, we’ll sign it because you’ll never pass \r\nthe physical, you’ll be back home, you’re so skinny.”  And \r\nI never came back home.  (Laughs)  I went into the Navy, \r\nand they were surprised I passed the physical. \r\n \r\nDe Mare:  Awesome.  Yeah. \r\n \r\nKelly:  What did... what did you do in the Navy?  What were \r\nyou doing day to day? \r\n \r\nJohnston:  Well, the... the Overseas Follow-up, we had a lot \r\nof shipments to track and, uh, one thing about that: we had \r\nthis big, brown box and in that was sheets of paper- like \r\ntowels rolling- and that was called ‘Twix’, and we could \r\nwrite with a certain pencil, like a Stylus, on that paper, \r\nand that would even go to Washington.  That was at the \r\nbeginning of the computers.  And it was this great, big, \r\nbrown box and it was called ‘Twix’ and you... we could write \r\nour messages on there and it would go. \r\n----------------Page (22) Break----------------\r\n \r\n00:26:30:24------------------------------------------------ \r\n \r\nDe Mare:  You talked about it being the beginning of the \r\ncomputers. \r\n \r\nJohnston:  Yes. \r\n \r\nDe Mare:  Yeah- can you talk a little bit more about what \r\nthat was all about?  I mean, and describe a little bit of \r\nwhat you were doing? \r\n \r\nJohnston:  Well, I... before I went to the factory, I worked \r\nfor Allied Oil, and that’s where I learned IBM.  And we had \r\nthe key-puncher with the cards- you know what the cards \r\nare- well, we... we’d get a stack of cards- they were blank, \r\nyou know, no holes in them- and we would have to use the, \r\nuh, keys.  And they only had a few set of keys, not a whole \r\nkeyboard.  You only had a few set of keys.  And you would \r\npunch these holes- key-puncher.  Then you had another \r\nmachine that verified it.  You had to go through and verify \r\nwhat you did.  Now if you came to a part that you hadn’t \r\npunched correctly, well, the verifier would not go through.  \r\nSo you knew you made a mistake.  Well, you didn’t make too \r\n----------------Page (23) Break----------------\r\nmany of those because you got what-for.  And from there you \r\nwent to the sorter, which was bigger than that unit right \r\nthere, that big brown unit.  (Phone rings) \r\n \r\n00:27:51:08------------------------------------------------ \r\n \r\nKelly:  Rolling. \r\n \r\nDe Mare:  Rolling.  Um, now what’s interesting to me about \r\nwhat you’re saying about the... the... that part of that kind \r\nof technology at that time was... how did you look at the \r\nfuture?  Did it seem really modernistic?  Like what did... \r\nwhat did you... what did you think about all of it as this \r\nyoung girl from this Scottish home? \r\n \r\nJohnston:  Um, I didn’t think much about it that it was \r\ndifferent.  I was very interested in it- that- I was amazed \r\nthat I got that job.  And I was so glad because it wasn’t \r\nlike being in the bank and just using the bookkeeping \r\nmachine or the adding machine, which was passé, you know? \r\n \r\nDe Mare:  How did you learn to do that and how did you \r\nlearn then to do the job you did at the factory, which was \r\n----------------Page (24) Break----------------\r\na lot of blueprinting and...?  I mean, did you have training \r\nfor this or did you just kind of jump into it? \r\n \r\nJohnston:  They had someone just show me what I was \r\nsupposed to do; my... what my responsibilities were.  And it \r\nwas my idea how to fix the graphs.  Uh, up til then they \r\nhad a lot of writing and I said to the comptroll... \r\ncomptroller, I said, “Well, if these men are looking at all \r\nthis writing,”  I said, “Wouldn’t it be better to give them \r\na picture?  They could look at and get the message right \r\naway.”  And that’s how the graphs came about. \r\n \r\nDe Mare:  It was you. \r\n \r\nJohnston:  It was me. \r\n \r\nDe Mare:  So, you obviously enjoyed your work. \r\n \r\nJohnston:  Oh, yes.   \r\n \r\nDe Mare:  Can you talk about that a little bit?  Like what \r\ndid you enjoy about it? \r\n \r\n----------------Page (25) Break----------------\r\nJohnston:  I think the thing that I was, uh, the thing was \r\nthat I was doing something, um, that, uh, I never thought I \r\nwould be able to do.  It was... it was interesting, it was \r\nexciting.  And of course you have to remember the cause; \r\nthe reason we were there was exciting.  But uh, it wasn’t \r\nas exciting as being in the bank. \r\n \r\nDe Mare:  No? \r\n \r\nJohnston:  No. No.  Uh, I, ooh, I said that wrong.  The \r\nbank wasn’t as exciting as being the, uh, in the jobs.  Of \r\nlearning these things. \r\n \r\nDe Mare:  How much did you... how much did you earn when you... \r\nso you... you... you... when you were working at the factory you \r\nwere earning thirty-seven dollars a week, I think you said.  \r\nWhen you went and you joined the Waves, what was your pay \r\nat that point?  And what was... \r\n \r\nJohnston:  I think it... think it was sixty-seven dollars a \r\nmonth.  But we were fed, we were housed, we were clothed.  \r\nSo that thirty-seven... I mean, that sixty-seven dollars a \r\nmonth was... \r\n \r\n----------------Page (26) Break----------------\r\n00:30:36:18------------------------------------------------ \r\n \r\nDe Mare:  And was that the first time you ever lived away \r\nfrom your home? \r\n \r\nJohnston:  Oh, yes. \r\n \r\nDe Mare:  And can you talk about what your actual life was \r\nlike?  Where you slept?  Who you hung out with? \r\n \r\nJohnston:  Uh, at boot camp we lived in apartment buildings \r\nsurrounding the campus of, uh, Hunter College.  And, uh, \r\nthere was, uh, eight girls to an apartment so... and one \r\nbathroom.  So the living room was bunks and things of that \r\nsort.  And the first time... the first night we arrived, um, \r\nthey took us all together, you know, the apartment building \r\nwhere we were, and, uh, they said, “Well, we need a \r\nvolunteer.”  And I raised my hand.  And everybody said, \r\n“You don’t raise your hand.”  And I said, “Well, I wanted \r\nto see what they want.”   \r\nAnd the officer said, “Well, Spence,” –that was my \r\nmaiden name- “Spence, uh, you just volunteered to be the \r\nmailperson.”  Well, they said ‘mailman’ then.  “Mailman for \r\nthe building and you will have a mailroom and that’s your \r\n----------------Page (27) Break----------------\r\nresponsibility.”  So, that’s what I did.  Now, all these \r\ngirls had to clean every Friday night the whole apartment- \r\neverything- for inspection Saturday morning.  They had to \r\ndo bathrooms and everything.  I had to make sure that my \r\nmailroom was in order and dusted.  And it was so much \r\neasier.  I got the big laugh on them.  (Laughs) Yeah. I... I \r\nthought that was so (unique?)- idea that I volunteered.  \r\nAnd they’re all telling me, “Don’t be so dumb when you’re \r\ntold (unintelligible)...” \r\n \r\n00:32:23:25------------------------------------------------ \r\n \r\nJohnston:  I’ll tell you one incident when I was in the \r\nWaves, and this was when I first went in and today it’s \r\ncommon, but in my day it was... (sigh)  There was two girls- \r\nnow, we used to always be allowed to go up on the roof of \r\nthe building and, uh, stay outside if we wanted to.  So, \r\nthese two girls in our apartment, uh, their parents came, \r\nwhich we were told, “Your parents can’t come.”  And I said, \r\n“Why are their parents here?”  “Oh, they were caught up on \r\nthe roof.”  I said, “We’re all allowed to go up on the \r\nroof.”  “But they were caught on the roof.”  And I said, \r\n“Well, what’s different about us being up there and them?”  \r\n“Don’t you understand what they were doing?”  I said, “No.  \r\n----------------Page (28) Break----------------\r\nWhat were... did they do wrong?”  Well, they had to draw a \r\npicture for me.  I did not understand.  (Laughs)  That’s \r\nhow naive I was.  But, I did not understand why they had to \r\ngo home. \r\n \r\nDe Mare:  And they sent them home? \r\n \r\nJohnston:  Oh, yeah.  Parents had to come get them. \r\n \r\nDe Mare:  Wow. \r\n \r\nKelly:  That’s amazing. \r\n \r\nDe Mare:  Wow. \r\n \r\nKelly:  What was... what was the, uh, sort of dating and \r\nromantic life like for all of the girls living in the \r\napartment at this time? \r\n \r\nJohnston:  Well, we were all in the Navy; for six weeks you \r\ndidn’t date.  You did what the Navy said.  And, uh, we did \r\nhave, um, Armistice Day we marched in the parade on Fifth \r\nAvenue.  Um, we did have one other weekend where Longchamps \r\nwas the restaurant and the lower section, the basement of \r\n----------------Page (29) Break----------------\r\nthe Empire State Building.  And to go into the Longchamps \r\nrestaurant you had to go down this big, winding staircase \r\nto get down into Longchamps.  And that to us was the best \r\nthing in the world.  Walking down... off of Fifth Avenue, \r\nwalking into rest... down the big, winding staircase.  And we \r\nwere not allowed to have a drink.  And everybody... the \r\nwaiters knew by the uniform we had on that we were, uh, \r\nboots, and we were not, uh, allowed to have a drink, so \r\nthey wouldn’t serve you a drink if you wanted it.  Even if \r\nyou were age... of age, you could not have it.   \r\n \r\nDe Mare:  And that was while you were in boot camp in New \r\nYork? \r\n \r\nJohnston:  In boot camp. \r\n \r\nDe Mare:  Wow.  And then once you went out to California, \r\nwhat was life like out there? \r\n \r\n00:35:10:13------------------------------------------------ \r\n \r\nJohnston:  Oh, that was free and easy.  Uh, I lived in, uh, \r\nOakland, and, uh, it was right in the middle of town, and \r\nthey built barracks for the Waves.  And there was, uh, two \r\n----------------Page (30) Break----------------\r\nsets of barracks.  And uh, the bus picked you up in the \r\nmorning to go to work and brought you back at four o’clock.  \r\nYou were free to do whatever you wanted, go any place you \r\nwanted, from three until two in the morning.  You had to be \r\nin by two.  And there was two girls to a cubicle, and you \r\nhad your closet and your bed.  Then there was a laundry \r\nroom, and of course the, uh, bathrooms with the showers and \r\neverything. \r\n \r\nDe Mare:  And what was that like for you to have that much \r\nfreedom? \r\n \r\nJohnston:  I loved it.  But, uh, we were... I had friends \r\nthat were of all different ages.  Some were married, some \r\nwere just older and not married and, uh, I think I was \r\nabout the youngest one.  And, uh, we would go to San \r\nFrancisco, and I... My mom always had a nice tablecloth on \r\nthe table and we had candles at dinnertime.  That was at \r\nhome.  So I said, “I want to go to a restaurant that has \r\ntablecloths and candles.”  Well, nobody had that during the \r\nwar.  They didn’t have the linen, they didn’t have any of \r\nthose nice things.  Maybe the Fairmont Hotel had it and \r\nsomething of that nature.  But, uh, the regular restaurants \r\n----------------Page (31) Break----------------\r\njust had bare tables.  And they didn’t even have placemats \r\nin those days, so... Yeah, it... it was good. \r\nI... I loved learning about San Francisco and Oakland \r\nand...  We had every Saturday and Sunday off.  It was like \r\nbeing in a girl’s club.  It was neat.  We didn’t have to do \r\nany KP.  Um, once every six weeks you had to have telephone \r\nduty and that was because of people calling up for other \r\ngirls.  It wasn’t that you had to be there for any \r\nemergency or anything of that sort.  It was very good. \r\n \r\nDe Mare:  How did it feel... Can you talk a little bit about \r\nhow it felt both when you were working at Ohio Crankshaft \r\nand then later in the Waves?  Can you talk about... about the \r\nwar and about being involved in the... in that... in... just... \r\nabout how you saw yourself in that situation?  I mean, you \r\ntalked a little bit about how, you know,  the work was \r\nimportant, you had to remember the cause, what you were \r\nthere for. \r\n \r\nJohnston:  Mm-hm. \r\n \r\nDe Mare:  Can you elaborate on that a little bit? \r\n \r\n----------------Page (32) Break----------------\r\nJohnston:  Well, I think, uh, what made us so eager to be \r\ndoing a good job, or just to be doing something that was \r\nnecessary, was the fact that so many of our boys were being \r\nlost.  Now my hometown, my graduating class, there was a \r\nwhole group of boys from my class that went to Guadalcanal \r\nthat never came back.  It was a sad... um, just like \r\nsomething hanging over the town.  And it was a small town.  \r\nUh, I lived outside of Cleveland- Maple Heights, Ohio.  And \r\nit was a small town.  And that was just like something \r\nhanging over us that really kept us remembering.  And, uh, \r\nif a sailor or, uh, a serviceperson came home and their \r\nmother had ran out of stamps or something like that, we \r\njust gave our stamps to that person so they could have a \r\nparty.  Yeah.  And of course we didn’t have packaged cake \r\nmixes or anything then.  You made your own.  So you needed \r\nthe sugar and all the other things to go with it. \r\nBut, uh, no, it was always there and you knew why you \r\nwere doing things.  But you were, um... I have a motto that I \r\nhave lived by for many, many years, I would say more than \r\nfifty, and it’s, “Bloom where you’re planted.”  And that’s \r\nexactly what we all did; we bloomed where we were planted.  \r\nWe did what we had to do but we had a good time doing it.  \r\nAnd everyone was in the same boat.  There wasn’t anybody \r\nbetter off than we were.  And when... if there was, uh, \r\n----------------Page (33) Break----------------\r\nsomeone got a notice of a death in the service it affected \r\nall of us.  It was just something that was always there, \r\nbut we enjoyed ourselves, too; it wasn’t all frivolous.  \r\nYeah. \r\n \r\n00:40:04:03------------------------------------------------ \r\n \r\nDe Mare:  Um, was the... was the work force, was it... was it \r\nmostly people of, from the same kind of background, was it \r\nsegregated, were there people of color?  Can you talk a \r\nlittle bit about... about...? \r\n \r\nJohnston:  Well, uh, color.  I grew up in, uh, Cleveland, \r\nOhio, where there was always colored people.  So I never \r\nknew about the segregation that they had down here.  So it \r\ndidn’t mean that much to me if a... you were white or black; \r\nyou were a person.  There was never any of this \r\nsegregation, so it didn’t mean anything to me if they were \r\nblack or white.  Um, I know some people in Cleveland were \r\nvery bigoted, as my mother and father were.  But it didn’t \r\nmean anything to me because I went to school with these \r\npeople; they were my friends.  One of my best friends was \r\nPauline Holdman, and she was black.  And, uh... \r\n \r\n----------------Page (34) Break----------------\r\nDe Mare:  Was the workforce at Ohio Crankshaft, was it \r\nsegregated? \r\n \r\nJohnston:  No. \r\n \r\nDe Mare:  No. \r\n \r\nJohnston:  No. \r\n \r\nDe Mare:  No. \r\n \r\nJohnston:  No.  No.  No.  It, uh, they were all there, \r\nblack and white, and, uh, I did not have any black friends \r\nthere.  Uh, being a daytime worker, you know, nine to five \r\nor eight to five, um, it, um, I may not have seen too many, \r\nmaybe... because you made more money working at night. \r\n \r\nDe Mare:  Oh, really? \r\n \r\nJohnston:  Oh, yes. \r\n \r\nDe Mare:  Nightshift paid better? \r\n \r\nJohnston:  Oh, yes.   \r\n----------------Page (35) Break----------------\r\n \r\nDe Mare:  By a lot, I gather. \r\n \r\nJohnston:  Yes.  Yes. (Laughs) \r\n \r\nDe Mare:  Yeah. \r\n \r\nJohnston:  Yeah. \r\n \r\n00:41:44:17------------------------------------------------ \r\n \r\nDe Mare:  Can you talk a little bit more... you touched on \r\nit, and I’d love it if you could talk a little more about... \r\nyou said that, you know, the... the way people looked at \r\nfactory workers was as a kind of a lower class citizen. \r\n \r\nJohnston:  Mm. \r\n \r\nDe Mare:  Can you talk a little bit about that?  Can you \r\ntalk a little more about that? \r\n \r\nJohnston:  Well, I... I was angry with the men in the \r\nstorefront hiring, the hiring men, I was angry.  I said, \r\n“What’s wrong with me?”  And I had given them my background \r\n----------------Page (36) Break----------------\r\nand everything like that and they said, “You’re just not \r\nthe type of person,” which again I did not understand.  It \r\nwas my father that told me.  He says, “You’re upper class.”  \r\nI said, “No, I’m not.  I’m just a person.”  He said, “No.  \r\nCompared to others, you’re upper class.”  And we, uh, \r\nCleveland was a bohemian, Polish, Slovenian town.  It still \r\nis, I think.  And, uh, those people came over here from the \r\nold country to work in factories, so they were used to... \r\nthat was their type of life.  And I was annoyed that I was \r\nnot hired to work in the factory because I wanted money.  \r\nAnd at that time I was not thinking of going into the \r\nWaves.  I was thinking that I wanted to move out.  And \r\nthat’s how I got into the defense front store. \r\n \r\nDe Mare:  Um, how was it... what do you think it was like \r\nfor... ‘cause obviously women didn’t work in the positions \r\nthat you were working in the office before the war.  You \r\nsaid that you took over for someone who was drafted.  Can \r\nyou talk a little bit about how the men handled having \r\nwomen working there with them? \r\n \r\nJohnston:  Well, Mr. Symot- was the name of my comptroller- \r\nhe was, uh, very happy, he was very nice, and he was never \r\ndisagreeable.  Um, the other men that were, uh, say \r\n----------------Page (37) Break----------------\r\nsupervisors or foremen or whatever you wanted to call them \r\nin their positions; um, I think they were just glad to have \r\nwomen to do the work.  They didn’t care if it was a man or \r\na woman.  Just someone to get the work done.  And I think \r\nthat’s it. \r\n \r\nDe Mare:  Yeah.  So you didn’t feel a lot of... you didn’t \r\nfeel, um, you always felt like you were welcome to do the \r\nwork.  You always... \r\n \r\nJohnston:  Oh, yes. \r\n \r\nDe Mare:  Yeah. \r\n \r\nJohnston:  Yes, yeah. \r\n \r\nDe Mare:  That is... that’s what I was going for.  Yeah. \r\n \r\nJohnston:  I don’t know about in the factory, though. What \r\nit was like in the factory, you know.  But, uh, in my \r\nposition and where I worked, and I know walking through the \r\nfactory I didn’t have any problems. \r\n \r\n00:44:30:17------------------------------------------------ \r\n----------------Page (38) Break----------------\r\n \r\nDe Mare:  Can you talk a little bit... this is kind of a \r\nbroader question... but can you talk a little bit about, you \r\nknow, growing up the in... in the conservative kind of family \r\nthat you did.  It was... it seems like your father kind of \r\nruled the roost. \r\n \r\nJohnston:  Oh, yeah. \r\n \r\nDe Mare:  Um, can you talk about how things have changed in \r\nyour perspective now, at this point in your life, looking \r\nat the world and seeing how things have changed for women.  \r\nCan you talk a little bit about what you think that time \r\nhad to do with that? \r\n \r\nJohnston:  I don’t know if the way we were treated and the, \r\nuh, the work we did during the war had anything to do with \r\nit, but I do know that my friends and myself, we became \r\nmore independent.  We were not told; you asked us to do \r\nthings.   \r\nUh, I remember once my husband told me to do \r\nsomething, and I said, “Uh, what?”  He said, “I want you to \r\ndo such and such.  Get it done.” And I said, “Wait a \r\nminute.  If you ask me to do it, I’ll do it.  But if you’re \r\n----------------Page (39) Break----------------\r\ntelling me, I won’t do it.”  And he had to stop and think \r\nbecause we became independent.  That’s... and we knew... we had \r\nsome self worth.  We were proud of ourselves.  We were \r\nproud of what we’d done.  And we... we knew that self worth \r\nand we weren’t going to give it up.  I wasn’t anyway.  \r\n(Laughs)   \r\nAnd I was married and, uh, we had a baby and \r\neverything and he finally... he just demanded that I do \r\nsomething and I said, “Wait a minute.”  And it was just his \r\ntone of voice and the way he said it.  And that was the \r\nlast time he ever spoke like that to me.  We didn’t have a \r\nfight about it either, it was just, “Hey.”  So that’s what... \r\nthat’s the way it was. \r\n \r\nDe Mare:  Yeah. \r\n \r\nJohnston:  Yeah \r\n \r\nKelly:  You said earlier that you... you had a really happy \r\nmarriage. \r\n \r\nJohnston:  Oh, yes. \r\n \r\n----------------Page (40) Break----------------\r\nKelly:  And, um, can you talk about... a little bit about \r\nthat from... you were... you started talking about independence \r\nand, you know, this... this defining moment in... early on in \r\nyour marriage.  And... and how do you think the Ro... the Rosie \r\nexperience continued to... to just inform your marriage and \r\nyour... your life?  \r\n \r\nJohnston:  Well, that was... as I said, we became \r\nindependent.  We felt the self-worth that we were worth and \r\nwe were... we liked it.  You know, when you’re always told \r\nwhat to do and how to do it and when to do it, and all of a \r\nsudden you’re doing it on your own and you can do it, you \r\nfeel so much better.  So, I always carried that with me \r\nand, um, even when, um, my husband said that to me, it \r\nwasn’t... I didn’t flare and I didn’t argue, it was just, \r\n“Hey, wait a minute.”  And it was just conversation. \r\n \r\n00:47:53:05------------------------------------------------ \r\n \r\nSo... and then, um, my husband was always one that, um, \r\nhe wanted me to do something better for myself.  Always.  \r\nHe was the one that told me, uh, I was always home with the \r\nbaby or the children, and, well, it was George... was the \r\nbaby, and he said, “You know, you have to get out and join \r\n----------------Page (41) Break----------------\r\nsome organization or something.  What do you want to do \r\nwith your time? You need to get out.”  And I said, “Well, \r\nuh, the women’s group at church has an evening circle.  I’d \r\nlike to go to that.”  So, when we had evening circle \r\nmeetings, he would make sure he was there and, uh, took \r\ncare of the baby or the children as it went on.  And, um, \r\nhe made sure that I got out.   \r\nWhen I was going to have my second baby, I said, “Oh, \r\nI’d love to have a sewing machine so that I could make a \r\nlayette, instead of going to Lowbells, the baby store, and \r\nbuying everything.”  I wanted to make it and he said, \r\n“Well, they have night school classes.  Why don’t you go \r\nand make the baby’s layette there?”  Well, he made time for \r\nme to go to that, and I made the baby’s layette.  \r\nUnfortunately, I... it was going to be a girl, you know that, \r\nand I put pink ribbons on everything and I had a baby with \r\nthe reddest hair you ever saw, and it was a boy.  (Laughs)  \r\nBut he wore the pink- when he was a baby, he didn’t know \r\nthe difference. (Laughs)  So... \r\n \r\nKelly:  That’s great. \r\n \r\nJohnston:  Yeah, I bought the flannel and made the... all \r\nthose things. \r\n----------------Page (42) Break----------------\r\n \r\n00:49:39:18------------------------------------------------ \r\n \r\nKelly:  Was there a ttt... was there a big reaction when... \r\nwhen the war ended and the... the men came back- was there, \r\nuh, a big reaction or what was the feeling of the women who \r\nwere not allow... not supposed to work anymore and kind of go \r\nback into the home... \r\n \r\nJohnston:  There were with some women because, uh, like \r\neverybody there’s good and bad and some women really \r\nresented being told, uh, “Well, so and so is coming back to \r\nwork.  You won’t be working here anymore.”  And they didn’t \r\nwant to quit.  But they soon would get a job some place \r\nelse.  But if they really liked their job, they really \r\nresented it.  We did not have... I did not know any women in \r\nan authority position.  They were all men in authority.  So \r\nI think we just reverted back to being told what to do, you \r\nknow, and we did it.  I don’t know anybody... well, I wasn’t \r\nthere then either because I was in the Waves and I got out \r\nof the Waves because I got married.  That’s why I got out.  \r\nAnd my husband was being discharged so I got discharged.  \r\nSo... \r\n \r\n----------------Page (43) Break----------------\r\nDe Mare:  And did you work after that? \r\n \r\nJohnston:  Not at first.  Um, at first I stayed home and \r\nthen, um, my husband was not getting his raises, or a \r\nraise.  He worked for Burrows Adding Machine Company, and, \r\num, it was either we charge the food and pay for the coal \r\nfor the furnace or charge the coal and pay for the food.  \r\nSo I said to him that I had to go to work and, uh, he said, \r\n“No, you’re not going to work.  Not my wife.”  And finally \r\nI brought it out to him with facts and figures and he cried \r\nbecause he was not doing enough to keep his family \r\ntogether.  And I said, “Don’t take it that way.  Just be \r\nglad that I can.”   \r\nSo one day I went down to the hospital, which was \r\npractically in walking distance, and I said, uh, “I would \r\nlike a job,” and I became the night bookkeeper.  He would \r\ncome home at five, I would go to work at three.  The \r\nneighbor girl would mind the baby for two hours and I would \r\nhave the dinner ready.  All he had to do is reheat it in \r\nthe oven- no microwave.  (Laughs)  And, uh, I became the \r\nnight bookkeeper for the hospital and that was pay for the \r\ncoal or the food- whichever we decided needed it.  And \r\nthat’s why I went to work.   \r\nBut then, uh, after the... let’s see...  Glen was seven. \r\n----------------Page (44) Break----------------\r\nThat’s Glen that you met.  He was seven and, uh, Gordon was \r\ntwelve, and George was seventeen.  And when they were that \r\nage my husband opened a business and I had to go and work \r\nfor him.  And I suggested that I go out and get a job to \r\nbring home salary til we saw how the business made out.  \r\nNo, I had to work for him.  And so I went to work for him \r\nand, uh, that became a full-time job.  And it was \r\narchitectural hardware for architects and building homes or \r\ninstitutions or buildings; whatever.  But to pay the rent \r\nin the store, you did locksmithing.  So we had men that did \r\nlocksmithing and, uh, my husband would do the bench work. \r\n \r\n00:53:43:15------------------------------------------------ \r\n \r\nAnd one day going home- this is after several months- \r\nhe was real worried and I said, ”What’s... what’s bothering \r\nyou tonight?  Something’s wrong.”  And we had a twenty-\r\nminute ride home from the store to the house so we could \r\ntalk over... over things so we never talked about the \r\nproblems of the store at home.  So, I said, “What is the \r\nproblem?”  And he says, “We’re just not doing any bench \r\nwork.”  I said, “Yes, we are.”  He said, “Who’s doing it?”  \r\nI said, “Me.”  And he said, “What?”  I said, “Yeah.”  Well, \r\nhe got petrified.  First of all, I didn’t have a license; I \r\n----------------Page (45) Break----------------\r\nwas doing it.  Secondly, how could I know what to do?  So I \r\nsaid, “Well, stay in the shop a couple of days and see what \r\nhappens.”   \r\nSo I was doing this.  Somebody would come in with a \r\nlock and wanted it changed.  I’d say, “Alright.  You know, \r\nwe have such a nice little town right here, village,” and I \r\nsaid, “Why don’t you walk around, this’ll take about twenty \r\nminutes.  So, it’ll be ready when you come back.”  And I’d \r\nget them out of the store and I’d take out a new one and \r\nlook at it, an old one and figure it out, and, uh, then \r\nthey’d come back and: “Here.”   \r\nSo I gradually... I worked on cars and all sorts of \r\nstuff.  But, uh, my husband was so petrified.  He said, \r\n“The store isn’t paying for itself.”  I’d say, “Yes, it \r\nis.”  So I’d show him the books and he’d say, “Well, I see \r\nit but I don’t believe it.”  (Laughs) \r\n \r\nDe Mare:  That’s really funny. \r\n \r\nJohnston:  Yeah, it is.  He was... and he was real worried; \r\nthis was bothering him for some time.  But he’d come in off \r\nthe road and there would be no bench work to be done for \r\nthe next day or anything like that.  I was doing it.   \r\n \r\n----------------Page (46) Break----------------\r\n00:55:46:13------------------------------------------------ \r\n \r\nDe Mare:  You said a couple of times that there were no \r\nwomen in leadership positions and superior... in supervising \r\npositions.  Um, could you just talk a little bit about that \r\nand about how that made you feel? \r\n \r\nJohnston:  We didn’t know any different because it was \r\nalways a man’s world.  We did not know any different and we \r\ndidn’t think anything about it.  It was just the natural \r\nway of everything. \r\n \r\nDe Mare:  When do you think that started to really change? \r\n \r\nJohnston:  I think maybe after World War II because, uh, I \r\nknow there were never any women officers in the Navy until \r\nWorld War II and now you see, you got, um, commanders and \r\nadmirals that are women.  And I think it all started with \r\nWorld War II.  But I don’t say that’s the real reason.  It \r\nwas just a way of... everything gravitated to that end.  And \r\nwe found ourselves. We really did.  We found ourselves. And \r\nwe knew that we could do things.  And we were of worth.  We \r\nwere important.  When that... the glue that won World War II.  \r\nSo, that is it.  \r\n----------------Page (47) Break----------------\r\n \r\nDe Mare:  When you look back... if you can look back at \r\nyourself when you were, you know, nineteen, twenty, twenty-\r\none years old at that time, is there anything that you \r\nwould do differently or want to say to that young woman \r\nnow? \r\n \r\nJohnston:  No, I don’t think I would do anything \r\ndifferently because I think everything evolved as it went \r\nalong.  I didn’t plan anything. Whatever... I’ve had a \r\nterrific life; I’ve enjoyed it, eh, through, uh, working in \r\nthe work world, in church work.  I just wrote a letter to \r\nmy pastor and I outlined seventy-three years of volunteer \r\nwork within the church and he was shocked.  I was \r\neverything but the preacher in seventy-three years, and \r\nit’s always been leadership.  I was a leadership with the \r\nPresbyterian Women, I was leadership in the P.T.A., I was \r\nleadership in the Den Mothers; I did all that stuff.  And \r\nwherever it’s been I’ve always had a leadership position.  \r\nAnd it’s not that I looked for it.   \r\nRight now down at the senior center I’m an officer, \r\ndown there, and they’re giving me a new job.  And, uh, \r\nwhere I’ll be in charge, uh, not in charge, but, um, I’ll \r\nbe the liaison for all the people that have to ride the \r\n----------------Page (48) Break----------------\r\ncounty ride bus like me, with my walker and things of that \r\nsort.  People that ride the county ride bus are a certain \r\ngroup and now I’m gonna be the liaison for that, between \r\nthe directors and me and the group. \r\n \r\n00:58:57:10------------------------------------------------ \r\n \r\nDe Mare:  Why do you think you are always the leader? \r\n \r\nJohnston:  I don’t know because I never asked for it- it \r\njust comes my way.  And I love it.  (Laughs)  When, uh, \r\nlast year they asked me to go on the board- an officer- and \r\nI said, “Oh, no, I can’t do that.”  And they... they talked \r\nto me a few times so finally I said alright.  And I made up \r\nflyers and put them all over the senior center, um, ‘Idilia \r\nis your Ideal Candidate’.  And all kinds of stuff.  And I... \r\nhere I am. \r\n \r\nDe Mare:  That’s awesome. \r\n \r\nKelly:  Great. \r\n----------------Page (49) Break----------------\r\n"}