{"id":"nell-young","identifier":"ROSIE_INTERVIEW_028","hash":"rosie","url":"http://127.0.0.1:8080/interviews/nell-young","label":"Nell  Young","description":"During World War II, Nell Young worked in the Wayne Wright Shipyard in Panama City, Florida.","image":"http://127.0.0.1:8080/images/ROSIE_INTERVIEW_028-interview-thumbnail.jpg","type":"video","content":"During World War II, Nell Young worked in the Wayne Wright Shipyard in Panama City, Florida.  1 \r\nNell Young \r\n \r\nThe Real Rosie the Riveter Project \r\nInterview 28 \r\n \r\n \r\n \r\nInterview Conducted by  \r\nElizabeth Hemmerdinger \r\nJune 25, 2010 \r\nNashville, Tennessee  \r\n \r\n \r\n \r\nFor The \r\nFor the Tamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n----------------Page (0) Break----------------\r\n 2 \r\nInterview: Nell Young \r\nInterviewers: Elizabeth Hemmerdinger  \r\nDate: June 25, 2010 \r\nPlace: Nashville, Tennessee \r\n \r\nYoung: Nell, N-E-L-L, Young. \r\n \r\nHemmerdinger: Nell Young. \r\n \r\nYoung: Except I’m not so young anymore. \r\n \r\nHemmerdinger: Where are you from? \r\n \r\nYoung: Uh, originally from northwest Florida but I’ve been \r\nliving in Clarksville, GA for the last 6 years because \r\nthat’s where my only son, my only child is who married her \r\ndaughter. \r\n \r\nHemmerdinger: It’s good to be near your children, right?  \r\nAnd where did you do the Rosie the Riveter work? \r\n \r\nYoung: um, Wayne Wright Shipyard in Panama City, Florida. \r\nDown in what we called the bottoms, the (inaudible.) I \r\nnever knew then, you may have heard it but anyway the ship \r\n----------------Page (1) Break----------------\r\n 3 \r\nwhen they build those holds and then there are layers of \r\nmetal, like this and there is a big hole cut in them and \r\nthen they put strips of metal from one side to the other \r\nall through the several layers and we had to weld from down \r\nhand, vertical, horizontal, overhead, you hand to pass all \r\nthose test in order to weld on those ships. Because it was \r\nvery very necessary that it be done right and uh I got a \r\nlot of pleasure out of because I knew I was helping the war \r\neffort but I did not know how much but I read recently and \r\nI had been told two or three years ago there were 6 million \r\nwomen that hung up their aprons and went out and drove big \r\ntrucks, ran railroad, they plowed, they did anything that a \r\nman could do and the oldest child would take care of all \r\nthe other little children at home while the mother went out \r\nand worked. And you know, we didn’t we didn’t resent it \r\nwhen the men came back, they wanted their jobs back. Women \r\ngladly gave them back to ‘em and went back to the house to \r\nwork.  But now, Hitler made the statement that if those “GD \r\nWomen had stayed out of it, we would have won the war.” And \r\nsome of the Veterans that live in Clarksville who are \r\nmembers, they are Rivets, made the remark that um that was \r\ntrue and said that Hitler just gave all the credit to the \r\nwomen of this country of us winning the war. And the men \r\nsaid, that’s true. He said, because when they sink one of \r\n----------------Page (2) Break----------------\r\n 4 \r\nour ships, women over here were ready to send another one \r\nto replace it. They said it was the same with the \r\nairplanes.  One was shot down, we’d send another.  It was \r\njust constantly. That’s how I was told we won the war. And \r\nI did not lose sleep over us destroying what we did. You \r\nknow? But it was hard. We had to economize on everything. \r\nAnd we ate only what we grew. We- you couldn’t go to the \r\nstore and buy you know a lot of food. You could get coffee \r\nand sugar and rice but you just did have it unless you grew \r\nit.  And we grew ours.  We had a big garden and we had uh \r\nfruit trees that my mother planted there when we first \r\nmoved to this so log house. And uh it was it was tough \r\nbecause something like cooking oil, we didn’t know what \r\nthat was. Now lard came from pork hog, um we knew that was \r\nbecause you know we helped to feed the hogs and we helped \r\nfeed the cattle. And when they were butchered, we would \r\ncook ‘em and get the fat and saved that up and that’s what \r\nwe use. \r\n \r\n4:38:05--------------------------------------------------- \r\n \r\nYoung:  We had to pick up all kinds of scraps, cans, even \r\nlittle pieces of wire and rubber like tires or tubes, \r\nwhatever. We would pick that up and it would be carried to \r\n----------------Page (3) Break----------------\r\n 5 \r\na certain place and you know that without elastic around \r\nyour panties, what are you going to do? And uh so they came \r\nup with this to put a button here and buttonhole so that \r\nwas that piece of rubber went to the Air Forces, all of \r\nthem. So you pinned- buttoned that up and off you went, you \r\ndidn’t think anything about it.  One day walking down the \r\nstreet, right ahead of him was a couple of girls and one of \r\nthe button popped and her panties just hit the sidewalk and \r\nshe just caught her foot in it and kicked it up, caught it \r\nand put it in her pocket book and just kept going.  And I \r\nwent home and told my mother about it and she said, “We’ve \r\ngot to do something about that.” And I said, “What can we \r\ndo? We don’t have any rubber, we don’t have any elastic or \r\nanything to put elastic in.” And those buttons are going to \r\ncome off.  And she said, ”We’ll think of a way.  We’ll find \r\naway.” So she took a strip about so long and then she \r\nfolded it and made like a stiff big string and ran that \r\nthrough and tied the ends of it after she got it through \r\nthere and you could tie that in a knot and they wouldn’t \r\ncome down. Unless you wanted them to come down. \r\n \r\n06:24:19--------------------------------------------------- \r\n \r\n----------------Page (4) Break----------------\r\n 6 \r\nHemmerdinger:  Could you tell us what it was like to weld?  \r\nI know you went- had to learn how to go this way and that \r\nway and up. But what did you wear? What did it feel like? \r\n \r\nYoung: I wore dropdown um coveralls.  You girls don’t know \r\nwhat that is, do you? – Those coveralls were cut down to \r\nhere but they were well seemed and they had a belt from \r\nhere and from here and when you to go to the bathroom you \r\njust untied them right quick and like down you went. Now on \r\ntop of that, I wore raw leather overalls that came up to \r\nhere with straps up to here and I had a leather jacket that \r\nwas raw leather. Now you all know what raw leather is? It’s \r\nnot this tan to it or anything. And uh I had on top of that \r\njacket I had all leather gloves that came up my elbow, ok? \r\nAnd then I had thick socks.  I had steel toed shoes and \r\nthen you had a bandanna, we called it. You put your hair up \r\nand you tied it up because if a spark- if a spark hit it \r\nyou caught your hair on fire and uh on top of that, we had \r\nwhat you called a hard hat. You know if had some build-\r\nbuilt in there, wouldn’t touch right on your head but those \r\nsparks didn’t hit your head.  Then on top of that we had \r\nour welding helmet. Okay now we’re ready to go to work.  We \r\ntook the hel- that welding going thing, you’ll have to \r\nexcuse me, it’s been about 50 years ago so. And we got down \r\n----------------Page (5) Break----------------\r\n 7 \r\nhere and crawl through those holes, pull on our big cable \r\nto where we’re going to weld. And they had some fans that \r\nwere throwing some of the smoke out but didn’t get it all. \r\nAnd the temperature ran from 110° to 120°. And but, we \r\ndidn’t notice it. We just kept working and one uh at one \r\ninstance, they asked us to run a race with a shipyard in \r\nBrunswick so we had everything ready and we started the \r\nsame time they did. And we worked 24/7. We worked hard, \r\ntwelve hours was nothing then, but we worked day and night \r\nand uh of course we won. \r\n \r\n09:33:07-------------------------------------------------- \r\n \r\nYoung: So we really rubbed it in on ‘em.  But they were \r\ngood. They turned out a lot good ships.  And uh a lot of \r\nthe men, I’ve heard make remarks about the war about the \r\nwomen that won the war and they said it wasn’t the men but \r\nthey contributed.  Lots of them gave their lives, but we \r\nwere the backup so to speak and we and we did everything. \r\nWe worked all day and sat their and quilted half the night \r\nso there would be enough cover for the kids back home. And \r\nuh our log house was not very well insulated.   \r\n \r\nHemmerdinger: A log house?  \r\n----------------Page (6) Break----------------\r\n 8 \r\n \r\nYoung: I mean, real logs. And my mother, she really \r\nbelieved in everything being clean so every Saturday was \r\nwashday. You took everything out of the house. And you had \r\nboil the clothes in this pot and you’d take ‘em out and put \r\nthem on this block and take a wood- and you’d beat ‘em, \r\nbreaking buttons and all, it didn’t matter, she was getting \r\nthem clean, getting all the dirty out.  And then that hot \r\nwater, we took that in small pans inside and we’d pitch it \r\non the walls of that log house.  It was clogged with clay \r\nmud. The reason for that, there were bedbugs and I never \r\nsaw one but my mom said they were there and if they weren’t \r\nthere, she didn’t want them to be.  So we had to throw all \r\nthat boiling water on them every Saturday. So we stayed \r\nbusy. We didn’t have anytime to play or grow up. \r\n \r\n11:24:11------------------------------------------------ \r\n \r\nHemmerdinger: How many in your family? \r\n \r\nYoung:  There were eight.  I was the fifth. \r\n \r\nHemmerdinger: Eight children? \r\n \r\n----------------Page (7) Break----------------\r\n 9 \r\nYoung: Mmuh, yup. \r\n \r\nHemmerdinger: And how big was the log cabin? Did you all \r\nsleep in one room, two rooms, three rooms? \r\n \r\nYoung: We had four rooms in it, big front porch that run \r\nacross it and the hall was at least this wide and there \r\nwere no doors at either end, you know.  On one side of the \r\nhall was a kitchen and a dining room and on the other side \r\nit had two double beds in each room.  And if the Preacher \r\ncame or if anybody came we’d drag out a chair and welcome \r\nthem and invite them to wait and eat lunch, just like we \r\nwere uptown. \r\n \r\nHemmerdinger: Two double beds, in two rooms makes not a lot \r\nof room for all eight children. Where did all those \r\nchildren sleep?  \r\n \r\nYoung: The little ones, and I remember myself sleeping on \r\npads as they called it. It was quilts and you know when \r\nyou’re small like that a lot of kids enjoyed it and when \r\nour relatives would come and they would have three or four \r\nkids maybe our age, we just played games. Sneaker around \r\nand get under the quilts and just where our mothers stand. \r\n----------------Page (8) Break----------------\r\n 10 \r\n \r\nHemmerdinger: So you went from that log cabin to work in a \r\ndefense plant? \r\n \r\nYoung: Mm uh, and we worked- we paid off what we owed on it \r\nand Mother got a smaller house, which was built out of \r\nwood- I mean, planks and stuff like that.  And the first \r\nthing I did, the first paycheck I sent home for her to get \r\nthe house wired up because there was no electricity in it \r\nand she had never lived in a house that had electricity. \r\nAnd then uh she didn’t really have a kitchen it was just \r\npart the dining room. So I- every month, every time I got \r\npaid every week, not month, I would write her a letter, put \r\ntwenty dollars in there, write her a letter. Put a twenty \r\nin there between each sheet. I told her, “Now start \r\nthinking about building on the end of those rooms, building \r\na kitchen.”  And she did and it must have been 6X6. Big \r\nenough for the stove and barely get around. But yea, we had \r\nsome hard times but God saw us through all of it. No matter \r\nwhat, whether it was raining or what, when Sunday came we \r\nknew we were going to church. We knew we better not \r\ncomplain with a bellyache or anything. We just didn’t do \r\nit. Well, one thing we wanted to go to church. We didn’t \r\n----------------Page (9) Break----------------\r\n 11 \r\nsee anybody else or any other kids during the summer except \r\nat church because everybody worked. \r\n \r\nThe End. \r\n \r\n----------------Page (10) Break----------------\r\n"}