{"id":"powells","identifier":"ROSIE_INTERVIEW_018","hash":"rosie","url":"http://127.0.0.1:8080/interviews/powells","label":"The  Powells","description":"Kathleen and Ken Powell talk about the enormous contributions made by women during the war. ","image":"http://127.0.0.1:8080/images/ROSIE_INTERVIEW_018-interview-thumbnail.jpg","type":"video","content":"Kathleen and Ken Powell talk about the enormous contributions made by women during the war.   1 \r\n \r\n \r\nKathleen and Ken Powell \r\n \r\nThe Real Rosie the Riveter Project \r\nInterview 18 \r\n \r\n \r\n \r\nInterview Conducted by  \r\nAnne de Mare  \r\nJune 26, 2010 \r\nNashville, Tennessee  \r\n \r\n \r\n \r\nFor The \r\nFor the Tamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n----------------Page (0) Break----------------\r\n 2 \r\nInterview: Kathleen and Ken Powell \r\nInterviewers: Anne de Mare  \r\nDate: June 26, 2010 \r\nPlace: Nashville, Tennessee \r\n \r\nKathleen:  My name is Kathleen.  I was Kathleen Owen and \r\nI’m now Kathleen Powell. I grew up in a little small town \r\nof Williamston, South Carolina and doing and I graduated \r\nform high school in 1938.  I did not go to college and that \r\nfall I was helping in the town clerk and treasurer with \r\nsome of his records just to be helpful to him because he \r\nwas a friend. He knocked on my door one evening and said, \r\n“You seem so interested in what the work that you were \r\ndoing helping me with the records. Would you be willing to \r\ncome and help me and I will pay you from my pocket.”  I two \r\nfamily farms plus my job with the town and I’m so snowed \r\nunder with work. So I told him I’d be glad to. So I started \r\nto work under him and he assigned me jobs.  A little later \r\non there was a uh some of form of government that if you \r\nwere employed by somebody than the government would \r\nsupplement that income. And so I was able to work longer \r\nhours because of this of this fund. It was WPA but it was \r\nfor young people so I was being paid a little more money, \r\nwhich I was very grateful for. Now in December Pearl Harbor \r\n----------------Page (1) Break----------------\r\n 3 \r\ncame a long and it wasn’t very long before he had to \r\nregister and being a single man it wasn’t very long before \r\nwas drafted and sent away. And I was doing his job and mine \r\nboth and they the little town had four Councilmen or \r\nAlderman and mayor and they kept saying that we got to get \r\nhelp from Mrs. Owen.  She can’t keep doing both jobs. So \r\nthey said well why we don’t we let her, she’s going to have \r\nto show the man- new person his duties because the Town \r\nClerk had gone to service so they said why don’t we just go \r\nahead and let her be Town Clerk.  And they said but it’s a \r\nwoman’s- man’s work. And they said, “but she’s been doing \r\nthe job so finely” that they voted for me to be Town Clerk \r\nand Treasurer and I was paid $75 to work full-time six days \r\na week- I worked on Saturdays sometimes also.  Now as a \r\nresult of that I was be responsible for a lot of things \r\nthat older people would have done like run an election or \r\nmeet with the town attorney but this this was my job.  A \r\nlittle bit later on I decided that I really would like to \r\ndo something more for the War Effort.  World War II was \r\nwhere everybody wanted to do as much as they possibly \r\ncould. And so I got on bus one morning and road 17 miles to \r\nthe Airbase there where they were training B25 pilots and \r\nwhen they find out that I had worked with money they \r\nimmediately wanted to hire me to do that something that was \r\n----------------Page (2) Break----------------\r\n 4 \r\ninvolving money.  So anything on the Airbase that had to do \r\nwith money like dry cleaning, jute boxes anything that had \r\nto deal with money. The money came to my offices. The \r\nreports, I made the reports; sent the money to the bank \r\ncollected- collected money for them for their cash.  And I \r\nalso, I worked there I worked there ‘til V ‘til V ‘til V \r\n‘til V-J Day. And then I left thinking that I was employed \r\nand that I had a full-time job because I was taking care of \r\nmy mother. So I went to work for a church.  \r\n \r\n04:48:11------------------------------------------------- \r\n \r\nDe Mare: Wow. So were you the first woman who ever held \r\nthat Town Office? \r\n \r\nKathleen:  Yes.  And one of the state papers and I don’t \r\nknow which put an article in the paper that I was the \r\nyoungest female town clerk. \r\n \r\nDe Mare: That’s amazing. Now do you think- How do you think \r\nthat has changed how we look at those positions now?  \r\n \r\nKathleen: Well now since I’ve stayed in touch with that \r\ntown and every town clerk since then as been female. \r\n----------------Page (3) Break----------------\r\n 5 \r\n \r\nDe Mare:  You must have done a very good job to pave the \r\nway.  Now and when did you meet this gentleman here? \r\n \r\nKathleen: Ok when I the airbase when I left he airbase \r\nbecause I thought the bases would be closing. It didn’t \r\noccur to me that we had not finished the war. But so I went \r\nahead starting to find a job and I was real active working \r\nin my church as a volunteer and uh went to work went to \r\nwork as the minister’s secretary. Now when I graduated from \r\nhigh school I did not have any typing. And I would go on \r\nmy, the high school started giving typing and so when I was \r\nworking as a town clerk, on my lunch hour I would go over \r\nto the school and take typing.  So I began so I began \r\ntyping so I learned to type and I became secretary to this \r\nminister.  The- at that time at that time the war it was \r\n’45- at that time soldiers were coming home.  And he came \r\nhe came every Sunday to the services in full uniform as a \r\nsecond Lieutenant and um they became interested and several \r\npeople became interested in him because he came so regular \r\nto the services.  And I gave him a- asked him if would help \r\nme work with a teen group and that’s where we met and \r\nbecame acquainted and married. And then he stayed- we \r\nstayed there so he could go to college. \r\n----------------Page (4) Break----------------\r\n 6 \r\n07:15:00--------------------------------------------- \r\n \r\nDe Mare: And Ken, would you introduce yourself to us and \r\ntell us a little bit about your history? \r\n \r\nKen:  I’m Kenneth Powell and uh I was born in Marion, \r\nIndiana and then we moved to Texas.  Dad was working until \r\nthe Depression came along and he we had a lot of problems \r\nand the Depression made us move to Florida and I uh at uh \r\nwell because of the Depression I didn’t get but two yea-\r\nweeks of high school.  I didn’t finish high school. Then I \r\nhad to go to work and then the Depression made us move to \r\nConnecticut and there I was working at PetroWorks with the \r\naircraft doing some artwork for the PetroWorks for the \r\naircraft. Then Pearl Harbor came along and uh I jumped up \r\nwhen I heard about it.  My mother said, “Sit down, son.” \r\nShe knew what I had in mind. But the next day I joined the \r\nMarines and I passed but a brother of mine failed that \r\ntest. Later on my older brother joined the Marines with me \r\nbut later on but then they put me through another test and \r\nI failed that.  While I was trying to get in the Marines- \r\ntrying to get in the Air Force I was drafted in the Medics. \r\nAnd uh then because I- in order get in the Cadets after I \r\nwas in the Medics, I had to pass three tests but not having \r\n----------------Page (5) Break----------------\r\n 7 \r\nhigh school, I had to take three tests before I could pass \r\nit.  But I got in the Cadets. And then, in the Cadets I \r\nwent through 9-monthes of training and then I picked up a \r\nB-17 in as a Co-pilot on a B-17.  We left- picked it up in \r\nSavannah, Georgia. Then we went to- flew over seas and a \r\nPrestwick, Scotland on D-Day, we were in- I was on my way \r\nto my base at Dunthrop when I hear about the D-day going \r\non.  At the time I didn’t know it but my brother was on \r\nOmaha Beach but I didn’t know that until 50 years after the \r\nwar.  My other brother was in the Pacific with the Marines \r\nand uh... So when I got to my base it was but a few weeks \r\nafter that I was shot down on my third mission. And uh, \r\nspent 10 months as POW.  And when the war came along- when \r\nthe war was over, I came back to the States and uh spent, I \r\nstayed in the service two years just to fly around more.  \r\nDifferent bases.  And I end up at the last base in \r\nGreenville, South Carolina where I met her. And uh, that’s \r\nhow I met her. \r\n \r\n10:05:20-------------------------------------------------- \r\nDe Mare: And and when you met, you were still in the \r\nMilitary at that time? \r\n \r\n----------------Page (6) Break----------------\r\n 8 \r\nKen: Yes, I- I 1947 I got I got out of the service and got \r\nmarried and started college at the same time. \r\n \r\nDe Mare: So you started college after after you got out of \r\nthe service. Now, Kathleen, can you talk a little bit about \r\nhow you said you wanted to help out as much as you could \r\nduring the war and that’s why you left your Town Clerk work \r\nand went on to do the other work.  You worked at which \r\naircraft company? \r\n \r\nKathleen: It was it was the Greenville Air Force base where \r\nB-25 pilots were being trained. \r\n \r\nDe Mare: Ok so did you actually work for the military? \r\n \r\nKathleen: Yes. \r\n \r\nDe Mare: Ok. \r\n \r\nKathleen: I was responsible for anything on the base that \r\ndealt with money such as a dry cleaning- or in other words \r\npeople- a company would go on the base would go on the base \r\nand pick up dry cleaning or shining shoes or the jukeboxes \r\nwas in every PX so that in anytime- so that the money in \r\n----------------Page (7) Break----------------\r\n 9 \r\nthe jukeboxes at the end of the day would come to me. The \r\nmoney from the PX would come to me. The money- and I would \r\nI would make reports and deposits and then they’d be taken \r\nto the bank at the end of the day or sometimes at the \r\nbeginning of the next day. \r\n \r\nDe Mare: So what was it like to work on the base and watch \r\nthese young soldiers come in and out? \r\n \r\nKathleen: Well it was rather disappointing in the fact that \r\nin the longer that you stayed there you realized they were \r\ntraining them as fast as they could so that they these B-\r\n25, he flew B-17s but there was a B-25 bomber.  And they \r\nwere trying to get them, and this was when Germany had \r\ncontrol of the air and they were trying to get the \r\nMilitary, the young men trained at B-17s and as fighters \r\nand as bomber pilots as they could. So you would, you got \r\nto know some of them and then two or three days later in \r\nsome cases we would say, “Do you remember such-and-such? \r\nWell he was shot down yesterday.” So we so we were aware, \r\nwe were aware of the seriousness of it.  Now the humorous \r\npart of it was that I had a safe in my office that I dealt \r\nwith giving ‘em for change or bringing ‘em in and so I had \r\nmoney all the time. I had- I was I was bonded for $40,000 \r\n----------------Page (8) Break----------------\r\n 10 \r\nand even though I had just been out of high school just two \r\nyears, I was still running money.  ON the bottom shelf, \r\nhere’s some humor to add to it, on the bottom shelf of my \r\nself my safe there were boxes of nylon hoes that had been \r\nleft from the beginning of the war when they were no longer \r\nbeing used for woman, they still had some on airbases. And \r\nI had a shelf in which there were nine boxes of nylon hoes. \r\nAnd now if if a man, a general or someone real important \r\nwould come on the base, the Base Commander would call me \r\nand say, “Mrs. Owen, I’m sending my driver. Send me a box \r\nof sized nylon hoes.”  Now some lady very thrilled to death \r\nbefore she went to bed that night was given a box of nylon \r\nhoes, which was very, very important at the time because \r\nthey were being used for parachutes and women knew- ladies \r\ndidn’t have them anymore. So it sort of got to be a joke \r\nduring the war that I took care of nylon- that I took care \r\nof nylon hoes. \r\n \r\n14:13:12------------------------------------------------ \r\n \r\nDe Mare: That’s a great story. That’s really great story.  \r\nWhat other things were like the hoes at that point?  What \r\nelse couldn’t you get? \r\n \r\n----------------Page (9) Break----------------\r\n 11 \r\nKathleen: Oh a lot of things. Now the grocery store, where \r\nI- in my little town, at the back of the store he had \r\nstacks and when he would get a shipment of Kleenex, which \r\nwas being used by the Military but when grocery stores \r\nwould get in something, he would go and put on in each of \r\nthe sacks of the regular customers.  And then when two or \r\nthree items would be in the sacks, he would deliver them to \r\nus and we’d pay for them or we’d go an pick them up. We did \r\nwithout a lot of things but it never occurred to me to be \r\nto be envious of not having. My mother, my mother saved \r\ngrease from the frying pans and took them to the center \r\ntown, took the bottles to the center of town and it was \r\nused for something that was important. And uh, and some the \r\nthings that we did without that because the War Effort was \r\nsomething that was very important at the time.  You did \r\nonly the things that you could to be helpful. \r\n \r\n15:34:12------------------------------------------------- \r\n \r\nDe Mare: Now Ken, when you- when you were in the Military \r\nwere you aware how much the women were doing on the Home \r\nFront? \r\n \r\n----------------Page (10) Break----------------\r\n 12 \r\nKen: Oh, yes. I was I was aware of what they were doing. \r\nThey had that stuff in the Newsreels and Movies and stuff \r\nlike that and we we saw them building the airplanes with \r\nrivets and stuff like that.  \r\n \r\nDe Mare: Do you remember how you felt about it as young man \r\nbecause you weren’t used to seeing women do that kind of \r\nwork. \r\n \r\nKen: No, I’m proud of it.  It’s just something that had- \r\neveryone was doing something, the whole country.  It’s not \r\nlike today the whole country was in the service.  It was a \r\ntotal war. \r\n \r\nDe Mare: ...Total War... I like the way that sounds. Do you \r\nhave something that you’d like to show us? Did you bring \r\nsomething to show us? \r\n \r\nKen: No, this is something of hers. Uh, I didn’t what...you \r\nwant to see this thing? \r\n \r\nDe Mare: I don’t know, what is it? \r\n \r\n----------------Page (11) Break----------------\r\n 13 \r\nKen: This this I designed a logo for the Atlanta chapter of \r\nthe Rosie and this is logo I designed for the Atlanta \r\nchapter.  And uh, at first when they told me to do it, I \r\nmade a sketch on a napkin of what my idea was and they \r\napproved it but at first I was going to put a B-17 up here \r\nand a ship down here where the Rosies were working on ships \r\nand things.  And they said, “Well, bring it up to date so \r\nthe young people today involved in it too.” So I made \r\nAtlanta here and a Rosie down here because kids like you \r\nwould be Rosebuds.  Ant that’s the reason it’s like this. \r\nThis is the Atlanta Chapter of the- of the Rosies. \r\n \r\n17:25:00---------------------------------------------- \r\n \r\nDe Mare: Interesting.  That’s lovely. That’s lovely.  Do \r\nyou have something you’d like to show us Kathleen? \r\n \r\nKathleen:  You were talking- this is just some of my \r\nmemorabilia.  You were talking about a total war.  This \r\nhappens to be a picture of a young model just staring out \r\nand they used her for one of the photographers.  This is \r\nMarilyn Monroe when she first started out and uh used her \r\nfor one of the Roise- for one of the Rosie commercials. \r\nBecause they were trying- they were trying to get women to \r\n----------------Page (12) Break----------------\r\n 14 \r\nbe to be willing to come.  And they did many, many things \r\nfor example here are the rivets that they used and her are \r\ntwo of the ladies doing- I didn’t bring these with to be \r\nused but these happen to be, these happen to be some of \r\nthings that some that they used for it- now, of course this \r\nis the famous Norman Rockwell that was on the Saturday \r\nEvening Post and I’m sure you know that a year ago this was \r\nauctioned for $4 million. And Mrs. Walton, that’s husband \r\nowns Wal-Mart paid for this and it’s now in her home and \r\nwill eventually go into- go into a museum. This is some of \r\nthe things- this is where they were making blimps.  And of \r\ncourse is this one of the posters- uh, we can help- asking \r\npeople to really- because this was new.  Women didn’t do \r\nthings like that.  Women did wear pants.  I didn’t wear \r\nslacks. Women didn’t wear pants so it took, it took \r\ntraining to get people educated to get people to be willing \r\nto do all these things that they were asked to do- and did \r\nwillingly. And did willingly. \r\n \r\n19:23:19----------------------------------------------- \r\n \r\nKathleen: Well, here again you just didn’t wear slacks.  \r\nWomen didn’t wear pants and women did do jobs like- \r\n \r\n----------------Page (13) Break----------------\r\n 15 \r\nKen: And the result you wear slacks. \r\n \r\nKathleen: You you to to work in the airplane- the airplane \r\nand the airplane factories, and the factories building \r\nships were I guess the most important.  And the more men- \r\nwomen that they could get to do those jobs faster and you \r\nheard in the program this morning, they told how many \r\nthousands of airplanes and how many thousands ships were \r\nmade by Rosies and that because of that- the men were \r\nfighting but not doing those jobs so the women were \r\nemployed to those jobs and did them willingly. Uh, I \r\nbrought, I brought a story this morning from one of the \r\nladies in my Rosie Chapter.  She said that she wore pants \r\nand she was working with her riveter gun and that her pants \r\ngot caught in the machine. And her pants were flapping \r\nround and round.  They stopped the machine and took her \r\npants away from the machine and she went back to work. Um \r\nyou, she said that most- this lady said that most- that \r\nvery few men objected working with them because they were \r\naware that the job needed to be done and that it was going \r\nto take the women to do it. So that the men, at the very \r\nfirst were- I’m sure raised eyebrows but it wasn’t very \r\nlong before they were willing to have them work with them. \r\n \r\n----------------Page (14) Break----------------\r\n 16 \r\n21:17:09-------------------------------------------------- \r\n \r\nDe Mare: Was it unusual for men and women to work together \r\nlike that at that time? \r\n \r\nKathleen: Yes it was. \r\n \r\nDe Mare:  And did you- \r\n \r\nKathleen: It was very unusual for men and women to do those \r\njobs- any of those jobs together. \r\n \r\nDe Mare: And did you have interesting experiences with that \r\nwhen you went to work on the Air Force base? \r\n \r\nKathleen: No because we were just trying to get the job \r\ndone and they needed somebody, they needed somebody that \r\ncould deal with money and that I had had the experience \r\ndealing with money and knowing how to deal with the bank \r\nand knowing how to make deposits, all the things that were \r\nneeded and so I had no difficulty. You just didn’t find- I \r\ndon’t think I ever encountered anybody who said, “Why are \r\nyou doing this job?”  I don’t ever remember anybody \r\nencountering me to do that.  In fact, in fact toward the \r\n----------------Page (15) Break----------------\r\n 17 \r\nend of the war when I was still working for the town, I was \r\nstill working for the town and one man came in to pay his \r\ntaxes and said, “Mrs. Owen, now why don’t you run for Mayor \r\nthe next time.”  And I thought that’s the last thing in the \r\nworld that I want to do would be run for Mayor. And I- it \r\nwas I was responsible for elections and the county would \r\nbring a little metal box and the county and the county’s \r\nelection places still bring boxes of materials to the \r\nprecinct to vote and they brought the box of my materials. \r\nAnd they gave them to me with instructions, these are the \r\nballots and this is what you do and this is where you make \r\nyour report.  So they gave me the ballots and they handed \r\nme the ballots and they said, Now this- these are \r\nRepublican ballots and these are Democratic ballots.  You \r\nput the Republican ballots in the drawer desk and put the \r\nDemocratic ballots on top of the desk and if anyone came in \r\nwho wanted to vote on the Democratic ticket they had to \r\nask- I mean on the Republican ticket. And I would have to \r\ngo in the drawer and take it out and give it to them. So \r\nyou wouldn’t find that today. You would not find that \r\ntoday. \r\n \r\nDe Mare: That’s very funny. \r\n \r\n----------------Page (16) Break----------------\r\n 18 \r\nKathleen:  But uh very few, very few people as his word was \r\ntotal war. Very few people would do something against, \r\nagainst what everybody else was trying to do. And we’d go \r\nto the movies and see the and see the- we didn’t have \r\ntelevision.  And the only way we saw the news was on the \r\nNewsreel that came on before the movie and so if they would \r\nshow something that was going on in the war during Germany \r\nwhere Germany was the enemy or Japan was the enemy \r\neverybody in the movie theater would clap and cheer because \r\nthat’s where we got our news other than the newspaper. \r\n \r\n24:34:09------------------------------------------------ \r\n \r\nDe Mare: Do you remember what it felt like when the boys \r\nstarted coming home after the war?  Can you talk about that \r\nbeing a young woman, watching them? \r\n \r\nKathleen: Glad to see them (laughs). Glad to see them.  I \r\nwas young.  I was young and see, I was sort of at a \r\ndisadvantage about men coming home because I already had \r\none at home working with him everyday. \r\n \r\nKen: Best years of our lives. \r\n \r\n----------------Page (17) Break----------------\r\n 19 \r\nKathleen: And so but very- it was people who had- I \r\ncorresponded with five different guys not because they were \r\nfriends but because they liked to get mail and I enjoyed \r\nwriting to them.  So it wasn’t it wasn’t a boy-girl date.  \r\nYou just wanted to do something for the War Effort, to be \r\nable to share a news of home.  This is what happened today \r\nat your at your town.  So that- and so when they came home.  \r\nWhen they came home most of them- a lot of them had had \r\nnews from some member of their family or some friends. \r\n \r\nDe Mare: Before you took the job at the County Clerk, \r\nbefore you started working at the Air Force base, could you \r\never have imagined that you’d be working on things that \r\nwere that important as a child? \r\n \r\nKathleen: (Shakes Head) \r\n \r\nDe Mare: Can you talk a little bit about that? About how it \r\nlifted you up or about how- \r\n \r\nKathleen: I was I was, well I was just very pleased to have \r\na job. You know, as he talked, his father lost his \r\nbusiness; they lost their home, they he lost everything. \r\nAnd one day he had a business and the next day he was \r\n----------------Page (18) Break----------------\r\n 20 \r\nselling donuts on the street.  So it was just that scary in \r\nthat you didn’t- that you were in a depression.  You didn’t \r\nhave money and you didn’t- you you did what you could with \r\nwhat you had. You know my mother made biscuits everything \r\nmorning.  I don’t remember having a slice of loafed bread \r\nuntil I was a teenager because you did what you did with \r\nwhat you had.  And people- and so as I had- I had no idea \r\nthat an opportunity would open to me. Never, never thought \r\nan opportunity would open to me in the fact that I would \r\nbe, I would be in a place where a government would be able \r\nto supplement the little town income so that I would have \r\n$75 a month to pay rent like $12 and lights and water was \r\n$12- two or three dollars and a phone when we got one was \r\n$2 or $3 so it never occurred to me that money, that money \r\nwould be, would be as plentiful and would be as- and I \r\ncould work and earn more money to have more things.  I had \r\na horrible looking old sofa and I kept thinking, I wish I \r\ncould afford a sofa. So one day I went to the store and he \r\nsaid; “Now I can sell you this sofa.” And it was within my \r\nmeans to pay for it, but he said, “The pillows are going to \r\nbe flat because there going to be no springs in them see.” \r\nAnd they said, “there are going to be no springs in them \r\nbut when the war is over you bring these pillows back to me \r\nand we’ll put springs in the pillows.” \r\n----------------Page (19) Break----------------\r\n 21 \r\n28:11:22--------------------------------------------------- \r\n \r\nDe Mare: So they sold you the sofa without the springs in \r\nthe pillows? \r\n \r\nKathleen: And so at the at the end of the war, I don’t \r\nremember taking them back because I had moved a couple of \r\ntimes with him going to college and those sofas didn’t \r\nbecome important then. \r\n \r\nKen: I’d like to make one statement about the- not just the \r\nRosies, but the contribution of all females to the purchase \r\nof freedom for this next generation. Uh, because of your \r\ncontribution, when my plan was shot down at 28,000 feet and \r\nI jumped out of that plan and because of what you all did, \r\nI was able to reach the ground a live coming down on \r\nwomen’s hoes.  Nylon hoes. \r\n \r\nKathleen:  At the end of the war, oh four five years ago a \r\nlady had kept her husband had been shot down in some sort \r\nof training and he asked to keep is parachute and they said \r\nhe could.  So when he came home from the war, she took that \r\nparachute and made a baby dress for their little girl and \r\nshe brought it to a meeting and held it up and said this \r\n----------------Page (20) Break----------------\r\n 22 \r\nthis was my husband’s parachute.  Now he’s a member of the \r\nCaterpillar Club and I don’t know if you know about the \r\nCaterpillar Club. \r\n \r\nDe Mare:  No, please tell us. \r\n \r\nKathleen:  The Caterpillar Club was if you had ever come \r\ndown in a parachute to save your life.  Now this is not \r\nlike skydiving today everywhere.  But if you went down in a \r\nparachute like he did to save his life.  After the war was \r\nover they organized what was called the Caterpillar Club \r\nand in his memorabilia he has it because he has a little \r\ntiny caterpillar that he can wear as a result of being- \r\nbecause he used a parachute to save his life. \r\n \r\nKen: Nylon hoes. \r\n \r\nKathleen: That called- so he’s a member of the Caterpillar \r\nClub. \r\n \r\nDe Mare: Do you remember what it was felt like to jump out \r\nof that plane? \r\n \r\nKen: Oh sure. \r\n----------------Page (21) Break----------------\r\n 23 \r\n \r\nDe Mare: You know what we have a minute.  We don’t have \r\nsomeone for another minute. Can you just tell us what it \r\nfelt like to jump out of that plane? \r\n \r\nKen: I can tell ya- I guess this is. I can tell you this \r\nexperience. They gave us, we were issued a D-Bar, a \r\nchocolate bar, like the size of a cape of soap, but it was \r\na hard chocolate. At 28,000 feet it’s 40 below zero even in \r\nthe summer time.  We put that chocolate bar over our \r\ninstrument panel and after we’d drop our bombs and head \r\nback to the base in England. We- Now, my pilot and I, I was \r\na co-pilot. I would sit there and chew on the D-bar because \r\nthe plane was on automatic pilot and there weren’t any \r\nfighters around and we enjoyed that.  Well when we were \r\nshot down on the next day, the next mission was the next \r\nday and it was the same target, an eight and half mile \r\ntrip. Uh the minute our plane was shot down, flack knocked \r\nout both engines on the right and it damaged the bombays.  \r\nThe demolish bombs had already been dropped. The incendiary \r\nbombs were tangled up in the bombays and they wouldn’t \r\nrelease so they were all tangled up in the bombays.  And \r\nfighters were shooting and knocked out the other two \r\nengines on the left. Now believe it or not none of the crew \r\n----------------Page (22) Break----------------\r\n 24 \r\nwere killed. We were shot- but I started to go back to the \r\nback of the plane to make sure everybody could get out but \r\nI couldn’t get back because of the incendiary bombs.  But \r\nthe pilot said, “get out pal so I can get out.”  So I \r\nrolled up- put the chest shoot, rolled out the hatchet and \r\nwhat do you think my first thought was? \r\n \r\nDe Mare: Chocolate bar. \r\n \r\nKen: Oh shucks, I’m not going to eat that chocolate bar. \r\nThat was my experience coming down in a plane. \r\n \r\nKathleen:  Tell them about counting and turning dark. \r\n \r\nKen: Well, you want to hear more of it. You got time? \r\n \r\nDe Mare:  I think we’ve got a little time. Ok yea, we’ll \r\nfinish the story. \r\n \r\nKen: Alright, alright I became a Christian when I was ten \r\nyears old and coming down I was falling through clouds at \r\n125 miles and hour. The fast as you could fall...holding you \r\nback. I was going to count to 100 because of the height \r\n24,000 feet when I left the plane, but 78-78 in my count \r\n----------------Page (23) Break----------------\r\n 25 \r\neverything started turning dark. I figured maybe I was \r\ncloser to the ground, maybe a mountain around something I \r\ndidn’t know about.  So I pulled the ripcord and I came \r\nthrough the over-cash, which is about 3,000 feet up and it \r\nwas raining on the ground and the it as real cloudy and I \r\ncould hear the bombs still going off all over the city.  \r\nAnd the whole city was on fire- Munich. I uh was praying \r\nbut I wasn’t praying about my life because I knew it was in \r\nGod’s hands and I expected the worst ‘cause we had been \r\ninstructed- briefed if we, if you got shot down Germans \r\nwere killing ‘em with pitchforks and hanging them on trees \r\nand telephone poles.  Killed ‘em everywhere.  I expected \r\nthat. But I was praying because when I was 12 years old, I \r\nbroke my hip and I knew what pain was like and I didn’t \r\nknow how I was going to take the landing.  So I was praying \r\nabout my landing.  Well I had the softest landing in the \r\nhistory of parachutes.  I came right through a big tree.  \r\nThe umbrella just went right over that tree and I just went \r\nthrough all the twigs and branches right by the trunk of \r\nthe tree spring up and down like that about three feet of \r\nthe ground but the tree was surrounded by 14 Germans with \r\nguns pointing at me.  But George Washington went through \r\nseveral wars and his clothes were ridden with bullet holes \r\nand his hat knocked off and had two horses shot out from \r\n----------------Page (24) Break----------------\r\n 26 \r\nunder him and he didn’t get a scratch. And I had the same \r\nexperience in World War II. \r\n \r\nDe Mare: Thank you for sharing that story. Thank you both \r\nfor spending time with us.  Um, we really appreciate it and \r\nthank you for everything that you did. \r\n \r\nTHE END. \r\n----------------Page (25) Break----------------\r\n"}