{"id":"violet-johnson","identifier":"ROSIE_INTERVIEW_003","hash":"rosie","url":"http://127.0.0.1:8080/interviews/violet-johnson","label":"Violet Johnson","description":"Violet Johnson moved from the farm to Baltimore to work as a drill press operator for the Martin Aircraft Company.","image":"http://127.0.0.1:8080/images/ROSIE_INTERVIEW_003-interview-thumbnail.jpg","type":"video","content":"Violet Johnson moved from the farm to Baltimore to work as a drill press operator for the Martin Aircraft Company.  \r\n \r\n \r\n \r\n \r\n \r\n \r\n Violet Johnson \r\n \r\nThe Real Rosie The Riveter Project \r\n \r\nInterview 3 \r\n \r\n \r\n \r\n \r\n \r\n \r\nInterview Conducted by \r\n \r\nAnne de Mare & Kirsten Kelly \r\n \r\nApril 14, 2010 \r\n \r\nLutherville, Maryland \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\nFor The \r\n \r\nTamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n \r\n \r\n----------------Page (0) Break----------------\r\n \r\n \r\nInterview: Violet Johnson \r\n \r\nInterviewers: Anne de Mare & Kirsten Kelly \r\n \r\nDate:  April 14, 2010 \r\n \r\nPlace:  Lutherville, Maryland \r\n \r\n \r\n \r\nDe Mare: Can you tell me your name and tell me when you \r\nwere born? \r\n \r\nJohnson: I, I’m Violet Johnson, was born in, uh, 1924.  \r\nAnd... \r\n \r\nDe Mare: And where were you born? \r\n \r\nJohnson: I was born in Pennsylvania in a small town called \r\nKlingerstown and, uh, I was born on a farm. \r\n \r\nDe Mare: Can you, can you talk a little bit about your \r\nchildhood?   \r\n \r\nJohnson: Um, well, um, my, um, most of the time I lived \r\nwith my grandparents and, uh, they were wonderful to me, \r\nand then when I, uh, my grandparents had to sell their farm \r\nand I went to live with my, my parents.  And, uh, I was \r\n----------------Page (1) Break----------------\r\neighteen and, when I came to Maryland.  I graduated from \r\nhigh school in 1942 and there was no work up there.  There \r\nwas, I, since living on a farm I would work on a farm, \r\nmaybe for someone else some days, maybe you’d get a dollar \r\na day for (pick), for picking potatoes, or something like \r\nthat.  I didn’t want to live like that so I decided I would \r\nlike to come to Maryland.  My cousin and his wife had come \r\ndown here because of the war, he worked at the shipyards, \r\nand he said, “Why don’t you come down and live with us?” \r\nand that’s what I decided to do.   \r\nSo I came right after graduation.  First my mother \r\nsaid I had to stay home and help pick the strawberries, so, \r\nwhich I hated, I hated that job.  But I had to pick \r\nstrawberries and so I stayed for that and then in August of \r\nNine- no, July of 1942 I came down to Maryland. And by \r\nAugust I had a job at Martins.  And uh, first of all, I had \r\nto go to school to learn to run different machinery and I \r\nhad to learn to do a, do a drill press.  I had to run a \r\ndrill press.  And I remember very distinctly, I took a rag \r\nto hold on to what I was working, holding on the drill, \r\nholding on to, boy, that was a no-no, immediately they told \r\nme, ‘cause that, that drill press would pull that rag right \r\ninto the, uh, you know, and I could cut my hand. So I \r\n----------------Page (2) Break----------------\r\nlearned a lesson right then and there before I even went to \r\nwork. \r\nAnd when I went to work- first of all, I worked in \r\nsmall parts assembly and in there I did, uh, they, uh, \r\ntubing.  I had to put fitting on tubing and it was called \r\n“Working in the Breezes” and that’s what they called the, \r\nuh, it was a electrical conduit where electric wires would \r\ngo through, and we had to clean the ends and put a fitting \r\non that. And I worked- first of all, I worked from eleven \r\nto seven at night, and uh, I remember this one lady and I, \r\nwe would softly sing “Oh, How Lovely is the Evening”, in a \r\nround, and we got a big kick out of that. \r\n \r\n00:02:45:16------------------------------------------------ \r\n \r\nBut I worked there a good while and then I was sent to \r\nPlant Two at Martins, and um, I worked there as a riveter \r\nand that was my big experience because I worked in, I did \r\nhorizontal beams.  They were large, um, large beams and we \r\nhad to drill holes in them and put rivets through them.  \r\nAnd you had to put, uh, the rivets were kept in a freezer, \r\nand I think they were easier to buck that way because of \r\nthe, you know, ‘cause you used a big rivet gun and the uh, \r\nthe air, you, it was driven by compressed air.  The rivet \r\n----------------Page (3) Break----------------\r\ngun was driven by compressed air.  I was the bucker, I mean \r\nI was the shooter and one of the fellas was the bucker.  \r\nHe, he bucked, uh, the other end.  And, um, I worked in \r\nthat for a long, long time. \r\nAnd then, uh, just before the war ended I was sent to \r\nPlant One again and I worked on the skins of the airplane \r\nand you had to be really careful because if you would, uh, \r\nif you would drill a hole, you had to watch so you didn’t \r\ndrill into the skin of the airplane.  And, uh, one day I \r\nwas drilling, and, uh, someone above me, working above me, \r\ndropped a, a C-clamp, on my hand, you know I had the drill \r\nin my hand, that really hurt.  It, because of the hardness, \r\nyou know. \r\nBut, um, the, everybody was, I mean I met a lot of \r\nnice people.  Most of the people were from out of state \r\nand, um, we, some of us became, uh, permanent friends, you \r\nknow.  And, uh, but uh, a couple times I was sent to the \r\ntool crib, you had to go to the tool crib.  First of all, \r\nbefore I got a job I had to buy a toolbox with a bunch of \r\ntools in it and then, um, but then there were tools that \r\nyou didn’t have in your toolbox so you had to go to the \r\ntool crib to get them.  And you had to get a, a slip from \r\nyour supervisor, and, uh, some of the times the men would \r\ntease you a little bit and once they sent me for compressed \r\n----------------Page (4) Break----------------\r\nair or something like that, which is unavailable, you know, \r\nbut then when you’d get to the tool crib they’d laugh at \r\nyou.  But other than that, the men were very nice to you, \r\nyou know, treated you well but we thought that was real \r\ncute. So. \r\n \r\n00:05:06:04------------------------------------------------ \r\n \r\nDe Mare:  What was the financial arrangement, I mean did \r\nyou have to kind of invest in order, before you could.... \r\n \r\nJohnson:  Yeah, there weren’t too many tools then, I \r\nremember an Allen wrench with different uh, uh, size Allen, \r\nyou know, wrenches, and then a small hammer.  Just a few \r\nthings that we had to have.  It wasn’t very... but that was \r\nwith your own money. You had to buy that yourself. \r\n \r\nDe Mare: Do you remember how much money you were paid? \r\n \r\nJohnson:  I don’t remember, but I remember at one time, \r\nwhich I don’t think was very long after I started work, I, \r\nI, I think like thirty-six dollars a week.  Because I \r\nremember, it seems that way, but, uh, you know, it’s so \r\nlong ago, but I remember one of the uh, first things I \r\n----------------Page (5) Break----------------\r\nbought was a wristwatch for myself because I didn’t have a \r\nwristwatch.  And I remember another time that my mother, \r\nshe cooked a lot, and I said to her “When I get, uh, you \r\nknow, uh, the chance I will by you a, a mixer master” and I \r\nbought her a mixer, and she was so happy to have that \r\nbecause, uh, we, we didn’t have things like that, you know.  \r\nIn fact, when I grew up, I was, uh, I guess, uh, just \r\nbefore I came to Maryland was when we first got electricity \r\nbecause we lived on a farm, you know.  So it was, it was... \r\nso that money, that was a lot of money for me, you know, to \r\nget that.  And I worked third shift and then I went second \r\nshift for ten months, I think, just a, and then I went on \r\nfirst shift, which was seven to...  \r\n \r\nDe Mare:  Can you explain that, can you explain what those, \r\nwhat you mean by first shift, second shift...  \r\n \r\nJohnson:  I can. \r\n \r\nDe Mare:  So the factories worked, they worked... \r\n \r\nJohnson: Yeah, around the clock.  They worked around the \r\nclock.  And uh, uh, (nigh) night shift was eleven to seven, \r\nthat was my first job, and then the other is three to, \r\n----------------Page (6) Break----------------\r\nthree to eleven, and seven to three.  The day work was \r\nseven a.m. to three, three p.m. and then the three, three \r\no’clock would come in ‘til uh, eleven and then eleven would \r\nbe until seven in the morning.  \r\n \r\n00:07:01:01------------------------------------------------  \r\n \r\nDe Mare: What was it like as like a farm girl to come to \r\nthis place that was just turning out airplanes? \r\n \r\nJohnson:  It was unbelievable, boy.  I remember the first \r\nday I came to Maryland, I looked out and it was really \r\nfoggy and hazy and I thought, oh, I don’t know if I’ll like \r\nit here, but I really enjoyed it, and, uh, it was just hard \r\nto believe that, you know, I came from a farm and I just \r\nloved, uh, being here and the experience I had.  It was an \r\nexperience I’ll never forget.  It’s something, you know, \r\nthe war was on, and I met so many people, I met a lot of \r\nservicemen and, and you know, wrote to them and, and... I \r\nremember one of the girls one time said to me, I said to \r\nher, “What, you know, if you write to the boys in the \r\nservice, what would you send them?”  She said, “Foot \r\npowder, because they have a problem, you know, with their \r\nboots and everything” and I said, “Oh, that’s so \r\n----------------Page (7) Break----------------\r\nembarrassing”.  I thought that was embarrassing to think \r\nthat, that you bought foot powder and send it to the boys \r\nin the service, but, you know, but... \r\nUh, and I, uh, I, I’m still, um, where I live there’s \r\na, a couple that also came down from Pennsylvania to work \r\nand I see them when I go to dinner a lot of nights and he, \r\num, he worked in um, one of the departments and every, um, \r\nwe didn’t have a telephone at the time.  I didn’t have a \r\ntelephone at the time, and uh, I would go to his \r\ndepartment. His sister would send me notes ‘cause she \r\ngraduated with me, his sister would send me notes and, uh, \r\nuh, and I, another day I’d write to her and then I’d take a \r\nnote over to him so I teased him now he was my special mail \r\nman. \r\nBut, uh, oh, uh, oh, and another thing, when we had a \r\nregular lunch break, at uh, and um, our lunch (hour), our \r\nlunch break would be a half hour, I think, and you’d have, \r\nand I always talked so much and the girls would tell me, \r\n“Quit, quit talking and, and, and eat your dinner because \r\nwe’ve got to go back to work”.  So I, I remember working \r\nat, from eleven o’clock at night, uh, uh, when’s it, one \r\nSaturday night, I guess it was... \r\n \r\nKelly:  Sorry.  Sorry, could you move your hands? \r\n----------------Page (8) Break----------------\r\n \r\nJohnson: Oh, my hands. \r\n \r\nKelly: I just want to, no, it’s fine, it’s just blocking \r\nyour voice.  So I was like, I wanna hear everything you’re \r\nsaying, so... \r\n \r\n00:09:19:00------------------------------------------------ \r\n \r\nJohnson: I remember working one Saturday night, from eleven \r\no’clock til seven o’clock in the morning, and then that \r\nmorning, my, uh, my cousin came over from Washington, she \r\nworked over there, and, for a civil service, and I \r\n(picked), uh, I met her at the, uh, bus station, and we \r\nwent to a amusement park that day.  And then that night I \r\nwent back to work, she went home and I went back to work \r\nwithout any sleep at all.  And when it was time to go to \r\nlunch, I told the girls, “I can’t stand it”.  And I laid my \r\nhead on my workbench and went to sleep.  And a lady who was \r\nso nice, she brought me a couple candy bars, and she said \r\nbecause I hadn’t had any lunch, she wanted to... But oh, the \r\npeople were so nice, a lot of the people, a lot of the \r\nwomen were older that I were, was because, but then a lot, \r\n----------------Page (9) Break----------------\r\nthere were a lot of people just graduated from high school \r\nwho came to work.  But... \r\n \r\n00:10:14:00------------------------------------------------ \r\n \r\nDe Mare: What was it, to, to go back to what you were \r\nsaying earlier about, you know, it was so different for \r\nwomen back then, you didn’t have the freedom, it sounds \r\nlike you had a lot of freedom when you started working, can \r\nyou talk a little bit about that? \r\n \r\nJohnson:  What do you mean by, um, by... \r\n \r\nDe Mare: Well, I mean, you know, at the time we, you were \r\nsaying that women didn’t have the freedom of movement until \r\nthis time. \r\n \r\nJohnson: Yeah. \r\n \r\nDe Mare: You know, and then here you were an eighteen year \r\nold girl, kind of going to the amusement parks on your own, \r\nearning your own money... \r\n \r\nJohnson: Uh huh... \r\n----------------Page (10) Break----------------\r\n \r\nDe Mare: Can you talk a little bit about, about what that \r\nwas like for you at the time and how you saw your future, \r\nyou know? \r\n \r\nJohnson:  Yeah, well it was really, because I had never had \r\nany money before, you know, because, I remember when we \r\nlived on the farm when my grand(mother), my grandfather \r\ndied, um, my uh, my aunt and uncle moved on to the farm \r\nand, uh, on a Saturday night they gave their, my cousins, a \r\ndollar and they gave me a quarter.  I’ll never forget that.  \r\nAnd, uh, for a quarter I could’ve bought a, like a, a \r\nsundae, you know, a hot fudge sundae?  And, uh, that’s all, \r\nyou know, I had.  And so when I came to Maryland, any money \r\nwas wonderful because, you know, it was hard.  You just \r\ndidn’t have any money, as a child, you know.  I even wore \r\nboys tennis shoes, I remember, on the farm, and uh, so it \r\nwas really, it was really hard to make a living and uh... So \r\nwhen I came to Maryland, I think I, uh, uh, well I used to \r\nmeet girls downtown and we’d bowl and we’d all go home at, \r\nlate at night and never be afraid, but I, I don’t do that \r\nanymore. I mean I, I wouldn’t go downtown now for anything, \r\n(y’know), even if I were younger, I wouldn’t go downtown at \r\nnight. (Y’know). \r\n----------------Page (11) Break----------------\r\n \r\n00:11:58:02------------------------------------------------ \r\n \r\nKelly:  Do you remember what, um, when you started getting \r\nthat, that paycheck, do you remember, was it, what, how did \r\nyou feel about having this? \r\n \r\nJohnson:  I went home one time, and, uh, I went to church \r\nand I had bought a new coat and it had, I remember having a \r\nfur coat, I mean a coat with fur and it was like, they \r\ncalled it tuxedo style, I think, the fur came... and one of \r\nthe boys I went to high school with said, “Country girl \r\ngoes to city and makes good”.  I thought that was really \r\ncute.  It went to... It was wonderful, you know, and I guess \r\nwe didn’t think anything of it, working, because, you know, \r\nno matter what they told you to do, you worked it, you \r\nknow, and so, it was very interesting to me.   \r\n \r\nDe Mare:  Can you go back a little bit just to explain on \r\ncamera, you were talking about, you know, you were, you \r\nwere the riveter and there was a bucker.  Can you explain \r\nwhat you actually, physically did ‘cause a lot of people \r\ndon’t know...  \r\n \r\n----------------Page (12) Break----------------\r\nJohnson: What it is. \r\n \r\nDe Mare: ...what it is, so can you talk us through what that \r\nreally means?  \r\n \r\nJohnson:  Ok.  First of all, we had a large piece of metal \r\non a, on a, what was called a jake, which was a, a, I guess \r\na wooden form that held this piece of metal.  And then, but \r\nI do not remember why we had to rivet it.  I don’t know, we \r\nmust’ve riveted a piece to it, but I don’t remember that \r\npart, and that... So the rivets were kept in the freezer and \r\na rivet is something almost like a nail but it’s uh, it has \r\na, a rounded head, a rounded head.  And then you had a \r\nrivet gun and the gun had a, a, a pin, I guess, a pin that \r\nyou would stick into the gun, it was driven by, um, com, \r\ncompressed air, forced air, which came out of the flooring.  \r\nAnd that, that, round, that pin would be round and fit \r\nright over the head of your rivet.  Then on the other side, \r\nthis person would stand facing me and he would have a \r\nlarge, heavy, metal bar that would hold it against, as the \r\nrivet came through and flatten, he would hold it against \r\nthere, and that would flatten the rivet out.  So that was, \r\nyou know, to fill that hole up.  Evidently we, which I \r\ncan’t remember, we must have had to rivet something onto \r\n----------------Page (13) Break----------------\r\nanother piece of metal, you know, and that’s why it was \r\nwhat we had to do.  So.  And that was... \r\n \r\n00:14:24:14------------------------------------------------ \r\n \r\nDe Mare: Was it, was it, I mean, you grew up on a farm so \r\nyou were used to doing physical work, obviously... \r\n \r\nJohnson: Right. \r\n \r\nDe Mare:  Um, but was it, was it unusual for, for women to \r\nbe doing that kind of work at that time?  I mean, I know \r\nthat they hadn’t been, but can you talk a little bit about \r\nwhat that was about?  You said you had to go to school to \r\nlearn, what that training process was like, how you were \r\n(trained), how you were brought through that. \r\n \r\nJohnson: I don’t know, it just came natural.  It just came \r\nnaturally to, to just be able to do it because we were, as \r\na child, from the time you were a child, you had to help \r\nload hay, you had to, to do things like that.  And uh, work \r\nin the fields, and I guess it just came that no matter what \r\nthey assigned you to, you were able to do it, you felt like \r\nyou, “Well, I can do that”, you know, and uh, you had to \r\n----------------Page (14) Break----------------\r\nlearn what, to do it the way they wanted you to do it, of \r\ncourse, but it was interesting to, to... \r\n \r\n00:15:15:10------------------------------------------------ \r\n \r\nKelly: I’m sorry. \r\n \r\nDe Mare: No, go ahead, go ahead. \r\n \r\nKelly:  Were the hours, I’m curious about the, you know, so \r\nyou had all this farm... \r\n \r\nJohnson: Uh huh. \r\n \r\nKelly: ...work behind you... \r\n \r\nJohnson:  Uh huh. \r\n \r\nKelly:  What was it like, when like the first day that you \r\nwent to the factory, and was it, did it seem like a long \r\nday, did it, what was that like for you? \r\n \r\nJohnson:  I don’t, I don’t remember, but uh, I remember, \r\nfirst of all, you know, we had to uh, we had to go get a \r\n----------------Page (15) Break----------------\r\nblood test, we had to have, you know, we had to have our \r\nbirth certificate, which, mine, mine had been lost during \r\na, because Harris, I lived, I had been born in \r\nPennsylvania, and Harrisburg had had a fire, and my, so \r\nthey had to, and I don’t know how they got (that), but my \r\nmother had to send for a new birth certificate for me.  And \r\nuh, uh, I don’t know how that all worked out but anyway, \r\num, I, I think that I probably felt like I had an easier \r\nday than picking potatoes for a whole day, for a dollar?  \r\nThat was hard work.  You know, because uh, so, I think \r\nthat, uh, it was easier to work in a factory and I didn’t \r\nthink a thing of it, you know, not that I was actually \r\nworking in a factory, because I also felt like we were \r\nhelping win the war and, uh, and the boys we knew that \r\ngraduated with, were, us, were fighting the war so we felt \r\nlike we were helping out. \r\n \r\nDe Mare:  Yeah.  Did you have any family overseas?  Did you \r\nhave any brothers or sisters... \r\n \r\nJohnson:  No, my brothers were younger than I, but, in, in \r\nfact, my one brother’s five years younger than I was, but, \r\nand my other brother’s twenty years younger than I am.  So, \r\nany, but I didn’t, but I had cousins overseas.  And then \r\n----------------Page (16) Break----------------\r\nwhen I met my husband, he had been in the Pacific.  And he \r\ntold me a lot about his life, and, overseas, which was not \r\neasy, you know, I mean, in the Pacific. \r\n \r\n00:17:03:01------------------------------------------------ \r\n \r\nDe Mare:  Can you talk a little bit, since we’re on the \r\nsubject, we’re gonna, we’re jumping around a lot, but \r\nthat’s ok, um, can you talk a little bit about what it was \r\nlike during the war to be home, to be on the home front, \r\nwhat it was like hearing news about the battles, can you \r\ntalk just about what the experience of being a young woman \r\nat that time was like? \r\n \r\nJohnson: Um, you know I guess I didn’t really take, take it \r\nto heart too much because I’d go to work and I’d come home \r\nand I, I guess I didn’t really, uh, I know that some of the \r\nboys that I graduated with, one of the boys got killed in \r\nthe war, and we felt, we felt real bad about that.  But I \r\nthink that most of the time we just, I mean, took for \r\ngranted, the war was on, and, and uh, and we worked and \r\nknowing that we, we had to do this to win the war. \r\n \r\n----------------Page (17) Break----------------\r\nDe Mare: So you definitely felt connected to the war effort \r\nwith the work you were, you really, I mean obviously you \r\nwere building the airplanes, it’s very easy to see what \r\nyou’re doing. \r\n \r\nJohnson:  Yeah. \r\n \r\nDe Mare:  Um, what, do you remember the kind of airplane \r\nthat you built? \r\n \r\nJohnson:  Uh, the B, B, what was it B 3, thir-- B, B... \r\n \r\n(Unseen): B 26. \r\n \r\nJohnson:  B 26.  Bomber, it was a bomber.  And uh, uh huh, \r\nand that’s the one we worked on.  So. \r\n \r\n00:18:15:10------------------------------------------------ \r\n \r\nDe Mare:  How would you, uh, how would you describe, you \r\nknow, how many women worked at the factory, how many men \r\nworked at the factory, like what was the, ‘cause you said \r\nthe man who was your bucker was a, he was a man. \r\n \r\n----------------Page (18) Break----------------\r\n \r\nJohnson:  He was a man, but then he got drafted.  I \r\nremember while I was working with him he got drafted.  But \r\nuh, I, then I guess, I don’t remember, uh, who else I \r\nworked with at the time until, you know, ‘cause, uh, and I \r\nguess I worked into another department because... It’s funny \r\nbut you just can’t re, you just can’t think of everything \r\nanymore. \r\n \r\nDe Mare: Oh no, of course not. \r\n \r\nJohnson: Yeah, it’s been a long time. \r\n \r\nDe Mare: But do you remember how many, so the men were \r\nbeing drafted away as you were working? \r\n \r\nJohnson: Uh huh. \r\n \r\nDe Mare: Um, was it mostly women by the time they ended the \r\nwar? \r\n \r\nJohnson:  A lot of them.  But I don’t know, mostly, because \r\nthere were a lot of fellas that were, they, they called it \r\n4F because they couldn’t, they had, uh, they had maybe bad \r\n----------------Page (19) Break----------------\r\neyesight or something, you know, that they felt that they \r\ndidn’t need to go in to the service and so there were, uh, \r\nthere was fellas that worked and uh, and maybe older men \r\nthat, because they put a, a time limit on the draft.  Uh, \r\npeople were drafted only up to a certain date or had so \r\nmany fam... if they had so many children, or farmers, you \r\nknow, weren’t drafted in that, in that time, you know.  A \r\nlot of farmers.  So, so they did what, so there were a lot, \r\nstill a lot, a lot of men worked but they were older men, \r\nlike... \r\n \r\nDe Mare:  Yeah.  And how were your relationships working \r\nwith the men as a woman? \r\n \r\nJohnson:  I think just fine.  I mean, we just got along \r\nwell with them, you know, and... \r\n \r\nDe Mare:  Do you remember, did you earn the same amount of \r\nmoney as the men?  Did you know about... \r\n \r\nJohnson:  No... \r\n \r\nDe Mare:  Ok... \r\n \r\n----------------Page (20) Break----------------\r\nJohnson: ...we knew that we didn’t earn the same amount of \r\nmoney... \r\n \r\nDe Mare:  Can you talk about that?  Can you go back and \r\ntell me, you know, tell me that you didn’t and talk about \r\nthat a little bit? \r\n \r\n00:19:54:22------------------------------------------------ \r\n \r\nJohnson: Yeah, we, we knew we didn’t earn the same amount \r\nof money.  It does make you feel bad to think you, you \r\nworked practically the same type of thing but you don’t get \r\nthe same amount of money. They were, uh, most of them were \r\nsupervisors, uh, that they, y’know, they, they supervised \r\nus and told us what to do, you know.  But I’m sure the \r\nfella that bucked the rivets made a lot more money because \r\nhe had a family and he couldn’t have supported that family \r\nif, with the money I, I made.  Thirty-six dollars a week, \r\nalthough that was a quite a bit of money in that, in, \r\nduring that time, compared to what people make nowadays, \r\nyou know.   \r\n \r\nDe Mare:  Um, was there a union?  Were you a part of the \r\nunion? \r\n----------------Page (21) Break----------------\r\n \r\nJohnson:  No.  There was, they were starting a union, and I \r\nremember one day that I was working and some man came, and \r\nhe was a union man and he bugging, you know he was bugging \r\nme to join the union and I, I didn’t know anything about \r\nunions and I said I’m not interested ‘cause I didn’t want \r\nto, you know, I didn’t want to join the union, and so I, I, \r\nI said I’m, I’m busy so he didn’t come back anymore, but, \r\nuh... And I remember when... do you want me to tell you about \r\nhow I remember when the war ended? \r\n \r\nDe Mare: Yeah, please. \r\n \r\nJohnson:  Well, I was on vacation when the war ended, and  \r\nbecause we did get vacation, and we, uh, the way I remember \r\nit, we worked six, when we did work, we worked six days a \r\nweek and then had a day off and then every so often you’d \r\nhave two days.  You’d have the long weekend, like Saturday, \r\nSunday and go back Monday and with working third shift you \r\nhad all, all day then like you, you’d go back for Monday, \r\nafter, but... I was on vacation when the war ended and I was \r\nup in Ocean City, New Jersey, when the war ended and I \r\nremember we were going to, to um, um, uh, to Atlantic City \r\non a trolley.  And these whistles blew and then we stopped \r\n----------------Page (22) Break----------------\r\nand they said, “The war was over.”  But then they said, \r\n“That was a false alarm.”  So the next day was the day that \r\nthe war ended.  And, uh, it was so exciting.  By then we \r\nwere going into Philadelphia to my girlfriend’s aunt and \r\nuncle, and we rode the trolley and there were just a, lots \r\nand lots of people.  We didn’t go into the city of \r\nPhiladelphia; we went to visit her, y’know, to visit her \r\naunt.  But, uh, I’d often wished I’d been here in \r\nBaltimore, where I knew, where my friends were, y’know, \r\nthat, because they say that was so exciting, the day the \r\nwar ended. \r\nWell, then I, I went back to work after my vacation \r\nwas over, I went back to work, and that’s when they sent me \r\ndown to Plant One, from Plant Two down to Plant One of \r\nMartins, and I worked there a little while, and then the, \r\num, they said to me, “Bring your toolbox and come with me.”  \r\nAnd that was the end of the... that was the end of my job.  I \r\nhad worked there three years and eighteen days.  I remember \r\nit so well. \r\n \r\nDe Mare:  And just like that (snaps) it was over. \r\n \r\nJohnson:  It was over. Uh huh. Just like that my job was \r\nover.   \r\n----------------Page (23) Break----------------\r\n \r\n00:23:01:11------------------------------------------------ \r\n \r\nDe Mare:  What did you after the war? \r\n \r\nJohnson:  Well, I didn’t want to tell my mother I had got \r\nlaid off and so I quick got a job in a department store so \r\nshe wouldn’t make me come back home.  And so, then I \r\ncalled, um, I called my mother up and I said I had lost my \r\njob but I already had gotten a job and so then I worked in \r\na department store for a while.   \r\n \r\nDe Mare:  Can you talk a little bit, can we go back and you \r\ntalk a little bit about your home life when you were \r\nworking at the factory? (Unintelligible) Um, what I’m, what \r\nI’m interested in, you, you, I’m, let’s go back to when you \r\nfirst, when you first came here.  You said your cousin knew \r\nthat there was work down here... \r\n \r\nJohnson:  Uh huh. \r\n \r\nDe Mare:  ...and so you came and did you move in with your \r\ncousin?  Did you...? \r\n \r\n----------------Page (24) Break----------------\r\nJohnson:  Yeah.  They worked, he worked at the shipyards \r\nand he had, he and his wife had a new baby, and I lived \r\nwith them.  Sometimes I would babysit for them and while on \r\nmy days, uh, off or while they, you know, went to the \r\ngrocery store or something.  And I stayed with them until \r\nDecember, and then he got drafted so that was only a couple \r\nmonths.  And by then I knew Baltimore pretty well, so I had \r\nto go look for, and that was hard, I, I, you know, I had to \r\ngo find a place to stay.  Uh, one time I stay(ed), I had an \r\napartment with another girl, and that didn’t work out real \r\nwell.  And then I got a, from then on I got a room, I would \r\nstay at people’s houses, but I was very lucky.  I stayed \r\nwith people who, who were like family to me.  And a, \r\nanother girl and I ate with them, and uh, it was, and uh...  \r\n \r\nDe Mare: Was that the way a lot of the young women lived? \r\n \r\nJohnson:  Yes. \r\n \r\nDe Mare:  Was in like rooming house situations like that? \r\n \r\nJohnson:  A lot of them did that.  You know... \r\n \r\nDe Mare:  Interesting. \r\n----------------Page (25) Break----------------\r\n \r\nJohnson: ...a lot of...  \r\n \r\nDe Mare: Do you remember how much you paid for rent? \r\n \r\nJohnson:  No, I don’t.  I think eight dollars a week or \r\nsomething like that.  It was, seems like that, but I don’t \r\nknow.   \r\n \r\n00:24:50:13------------------------------------------------ \r\n \r\nDe Mare:  And did you get your food with that as well? \r\n \r\nJohnson:  And then I got a food with that.  And then since \r\nwe had been, since my parents lived on a farm, I gave my \r\num, the, the one lady I lived with, um, I lived with she \r\nand her husband and her, their children and uh, meat was, \r\ny’know, it was hard to get because you had ration coupons, \r\nand uh, I would, my mother would send down her ration \r\ncoupons, so this lady could keep buying meat and sugar.  \r\nSugar was rationed, shoes were rationed because uh, you \r\nknow, I think you only had a couple pair of shoes a year.  \r\nWell, when we graduated from high school, tires, well, \r\ntires were rationed.  And we were supposed to come to \r\n----------------Page (26) Break----------------\r\nWashington on our uh, on our trip, and we couldn’t come \r\nbecause of, um, the ra- the, uh, tires were rationed and, \r\nuh, there was a shortage of gas.  They had to watch, \r\ny’know, about using the gas.  So we had to um, you know, we \r\ncouldn’t come to Washington like other classes did. \r\n \r\nDe Mare: (Unintelligible) \r\n \r\nJohnson:  So, but then when I moved to Baltimore I got to \r\ngo to Washington anyway, so I was pretty lucky.  I felt \r\nreal lucky that I was, uh, able to come to Maryland and uh... \r\nMy mother was very strict as we were growing up but then \r\nwhen we reached eighteen we, we were, my broth, my brother, \r\nyou know, he, he joined the navy when he was eighteen.  So \r\nwe were left, go then, you know, to do what we wanted to \r\ndo. \r\n \r\nDe Mare:  I think that’s amazing, I, I, it, it makes such \r\nsense but I never thought about the fact that the farm \r\nfamilies wouldn’t need their coupons as much... \r\n \r\nJohnson:  No, because... \r\n \r\nDe Mare: ...as the people in the city. \r\n----------------Page (27) Break----------------\r\n \r\nJohnson:  ...they raised their own pigs, and beef... \r\n \r\nDe Mare:  Yeah. \r\n \r\nJohnson:  ...and uh, so... \r\n \r\n00:26:34:24------------------------------------------------ \r\n \r\nDe Mare:  How do you think it changed you to, to work that \r\nway?  I mean it seems like you had a big change from being \r\non the farm to... \r\n \r\nJohnson:  I did. \r\n \r\nDe Mare: Can you talk about that a little bit?  Like- \r\n \r\nJohnson:  I, I, well, I, I think I was bashful.  And when \r\nI, I came to Maryland, I think I was, you know, I just, I \r\ndidn’t know a lot of things because we were, we were \r\nbrought up in a elementary, in a... My elementary school, \r\nthere were seventeen kids on my fir- on my first grade \r\npicture, I think, and that was eight grades.  Seventeen \r\nkids so there were like one or two kids in a class.  And, \r\n----------------Page (28) Break----------------\r\nuh, I remember crying when I was in first grade and then \r\nteacher sat me on his knee.  Now you know they wouldn’t \r\ndare to do that anymore... but uh, sat me on it, on his knee \r\nto make me, uh, you know, feel comfortable. \r\nBut, uh, uh, but, then when I was eight, in eighth \r\ngrade we had to take a, a high school entrance test and it \r\nwas timed.  It was like, kinda like a SAT right now, and to \r\nsee if we were eligible for high school.  So, I, and I \r\nthink I was kind of, you know, bashful, and I think when I \r\ncame to Maryland I, I became more uh, outgoing person, \r\noutgoing person.  Where I felt like I, I was brave.  I went \r\ndowntown, I had to, my, when I first came, my cousin’s wife \r\nwas pregnant, she couldn’t go with me to look for, to do \r\nanything, my cousin had to go to work, so I had to go find \r\nthe city life myself, and find a job and so forth. So.  \r\n \r\nDe Mare:  You were very brave. \r\n \r\nJohnson:  I was.  I felt like I was.   \r\n \r\nDe Mare:  Yeah. It’s amazing, actually.   \r\n \r\n00:28:20:10------------------------------------------------ \r\n \r\n----------------Page (29) Break----------------\r\nKelly:  Can you talk about after, so after the war... \r\n \r\nJohnson: After the war? \r\n \r\nKellY:  And you, you look at what you did after the war, \r\nand after your Rosie... \r\n \r\nJohnson:  Uh huh. \r\n \r\nKelly: ...experience. \r\n \r\nJohnson: Well. \r\n \r\nKelly:  How did that affect you?  And... \r\n \r\nJohnson:  Well, I, after that, I mean I went to work in a \r\ndepartment store, and then, uh, while I was working there I \r\nmet my husband.  And he had come back from the war and, uh, \r\nhe worked at Martins, and a girl I had, I had worked with \r\nat Martins, she and I used to meet downtown, and, and uh, \r\nso this one night, she uh, she, uh, we were going to meet \r\ndowntown, and when, when we met another fella was with her.  \r\nI said, “Well, I’ll go back home.”  He said, “No,” he said, \r\n“I’ll take you both to the movies.”  So, then he said, \r\n----------------Page (30) Break----------------\r\nasked me if I would meet uh, one of his, like roommates.  \r\nHe lived in a boarding house, a real boarding house and so \r\nthat happened to be, finally became my husband. \r\nBecause the man I met then, so um, uh, then, uh, he \r\ntook me back to Martins, because I had gotten a letter from \r\nMartins after the war asking me to come back.  But I was \r\nworking and I felt like I didn’t want to go back.  And so \r\nI, uh, uh, I, I didn’t go back then but then my uh, my \r\nhusband to be, I came one morning, and he said “I’ll see if \r\nyou can get a job back at Martins.”  And he came, he, he \r\nworked third shift, I think, or second shift and so he came \r\none morning and picked me up and asked, said, took me over \r\nto Martins but they didn’t want me then.  They didn’t \r\nrehire me. \r\nSo I, I kept working at department store until after, \r\nthen, after I had children, I went back to work and became \r\na teller at a bank, and that I really loved.  I loved that \r\njob.  I never had, my, my parents never had the money to \r\nsend me to college, or anything.  So, I felt like my life \r\nwas pretty well fulfilled anyway.   \r\n \r\n00:30:33:00------------------------------------------------ \r\n \r\n----------------Page (31) Break----------------\r\nDe Mare:  Can you talk about, you know, the things that you \r\nlearned doing the work in the factory, you know, learning \r\nhow to that kind of heavy-duty physical work and, and that \r\nprecision work you did.  Do you think that that helped you \r\nlater in your life? \r\n \r\nJohnson:  I, I don’t know if it did or not.  I, I don’t \r\nknow if it really helped me or not because I, I mean, I \r\nnever was good at fixing anything.  I, I, to this day, my \r\none daughter and I, we both say we don’t, you know, if \r\nsomething breaks down, we don’t know how to fix it, you \r\nknow, and, and, uh, but, but, I, I don’t know.  I only \r\nknew, I think, what they taught me to do.  I think that’s \r\none, you know, whatever they taught me do is what I \r\nlearned.   \r\n \r\nKelly:  In terms of, you, so you had, how many daughters \r\ndid you have? \r\n \r\nJohnson:  I had two daughters. \r\n \r\nKelly:  Two daughters.   \r\n \r\nJohnson:  Uh huh. \r\n----------------Page (32) Break----------------\r\n \r\nKelly:  What do you think the Rosie experience, what do you \r\nthink you were able to teach them? \r\n \r\nJohnson:  Oh, I don’t think, think they thought much of it.  \r\nBut when I told them you were going to interview today, \r\nthey got, they got real, they got real excited about it. \r\nAnd, and also we, we were interviewed one day for the \r\nhistorical, Maryland Historical Societer, Society, and uh, \r\nI got a, uh, uh, DVD on that. And, uh, my one daughter \r\nwatched it and the other daughter I haven’t had a chance to \r\nshow it to her yet.  But, uh, they, they were really \r\nexcited about that.  But when I told my grandson, when he \r\nwas little, about me working in the defense plant, and \r\nworking on airplanes, that’s when he said, “That’s when \r\nwomen weren’t important.”  And my daughter said, “Oh, \r\nGregory, don’t say that.”  So, we got a big kick out of \r\nthat. \r\n But, one day I was visit, one time I was visiting my \r\ndaughter in Atlanta and they had, they had friends come in, \r\nand the boy uh, the, the friends that had a son, he was a \r\nteenager, and when he found out I had been Rosie the \r\nRiveter, he kept asking me so many questions, he was so \r\n----------------Page (33) Break----------------\r\ninterested that I was Rosie the Riveter.  He’s the one that \r\nwas more interested than my grandchildren were.  So. \r\n \r\n00:32:44:00------------------------------------------------ \r\n \r\nDe Mare: When you think back to that time, to being a young \r\nwoman, and moving to Maryland, and, is there anything you \r\nwould’ve done differently? \r\n \r\nJohnson:  I don’t know.  I don’t know, I just, I felt like, \r\nuh, I guess maybe, I don’t know what I would’ve done \r\ndifferently.  I th(ink), I... \r\n \r\nDe Mare:  You don’t have to have done, wanted to do any, \r\nI’m just curious to think...  \r\n \r\nJohnson:  Yeah. \r\n \r\nDe Mare:  ...you know, sometimes with hindsight people look \r\nat their life and they wish... \r\n \r\nJohnson:  I guess everybody says that if I could’ve done, \r\nlived my life over, maybe I would’ve done something \r\ndifferently... \r\n----------------Page (34) Break----------------\r\n \r\nDe Mare: Yeah. \r\n \r\nJohnson:  ...you know. \r\n \r\nDe Mare:  Yeah. (Unintelligible) \r\n \r\nJohnson:  But I don’t know.  I don’t know what I would have \r\ndone.   \r\n \r\nDe Mare:  Um, when you think about what life is like for \r\nworking women now, um, it’s so different from, from that \r\ntime, um, when your own daughters were, were growing up and \r\ngoing out and making their way in the world, did you, just, \r\ncan, do you want to talk about how that made you feel?  \r\nComing from the farm and, and having that experience? \r\n \r\nJohnson:  Well, I know that, and I, I think that my working \r\nhours were eight hours, and my daughters now: their working \r\nhours are a lot longer than my (hours).  I, I feel sorry \r\nfor them because I feel like, you know, even though we \r\nfelt, now, uh, that, well, the farm life wasn’t easy, but \r\nas a child I probably, mine wasn’t as bad as if I’d’ve been \r\nan adult and, you know, real, because I came when I was \r\n----------------Page (35) Break----------------\r\neighteen, but, but after, after, if I’d’ve stayed on a \r\nfarm, that would’ve been really, really hard work, you \r\nknow.  And it’s, uh, not much, it’s not much money involved \r\nbut, uh, I feel like, uh, nowadays the, I think that people \r\nhave to work harder and longer hours than I did, you know, \r\nand yet, you know... \r\n \r\nDe Mare:  Interesting, interesting. \r\n \r\nJohnson: ...‘cause I know my, my daughters put longer hours \r\nin than I, I, my one daughter flies all the time, you know, \r\nto her jobs and I think that’s hard.   \r\n \r\nDe Mare:  Yeah. \r\n \r\nJohnson: Yeah. \r\n \r\nDe Mare: Yeah.  Um... \r\n \r\nJohnson: And my other daughter, you know, puts in a lot of \r\nhours, works off, on her days off a lot of time to catch up \r\nwith everything.   \r\n \r\nDe Mare:  Yeah. \r\n----------------Page (36) Break----------------\r\n \r\n00:34:52:20------------------------------------------------   \r\n \r\nDe Mare: I was wondering if you could talk about, you know, \r\nyou talked about the great camaraderie with the other women \r\nthat worked there.  I mean, can you talk a little bit about \r\nthe relationships you formed when you were there, um, and, \r\nand what the, what the other women were like, were they, \r\nyou know, because obviously they would’ve had different \r\nexperiences up until that point. \r\n \r\nJohnson:  Yeah. \r\n \r\nDe Mare:  So what that was like to meet all these different \r\npeople and encounter... can you talk a little about that? \r\n \r\nJohnson:  Well, I still, I still have one friend down \r\nLithicum (?)*, Lithicum (?)* Heights that uh, oh, and I \r\nhave one in Essex, uh, I mean, where, close to where you’re \r\ngoing to be staying tonight, that uh, they worked at \r\nMartins, too.  And uh, uh, uh, well, the one I worked with \r\nuh, the one I worked, uh, that lives here now in Lithicum \r\n(?)* Heights, she, uh, she worked right next door to me at, \r\nand she worked in uh, she said they riv- they sautered \r\n----------------Page (37) Break----------------\r\nlittle like radio boxes that’s what they did.  And I \r\nremember her saying, um, uh, uh, “We sautered little \r\nwires.”  Because she was from south, she was from North \r\nCarolina.  But I met so many nice people and I stayed in \r\ntouch with a lot of people, uh, afterward, but, um, of \r\ncourse I don’t, there was only a few people left that I \r\nreally was close, you know, that I, that I can remember \r\nnow, but... \r\n \r\n00:36:12:00------------------------------------------------ \r\n \r\nDe Mare:  Yeah.  One of the things that I think is \r\ninteresting, and I don’t know if you can speak to this \r\nspecifically, and, and I don’t want to lead you, but I want \r\nto ask you: some of the women that we’ve talked to have \r\ntalked about, they would never have met the variety of \r\npeople that they met... \r\n \r\nJohnson:  Oh, definitely... \r\n \r\nDe Mare:  So, can you talk a little bit about that? \r\n \r\nJohnson:  Oh, it’s unbelievable the amount of people, you \r\nknow that you met in that, that time because you were just \r\n----------------Page (38) Break----------------\r\nlike thrown into a bunch of people.  Some were a lot older \r\nthan you, they had, they were already had families, and \r\nthen there were the young girls like my age, that were, \r\ncame to work there.  So, uh, it was just, and I remember \r\nhaving a family that I was very, very close to, she already \r\nhad three boys, and she was, could’ve been a, but she was \r\nkind of like, uh, someone that I felt close to. \r\n \r\n(Unseen):  Watch your hands. \r\n \r\nKelly:  It’s okay... \r\n \r\nJohnson:  I work with, I talk with my hands. \r\n \r\nKelly:  It’s good.  It’s good.  No, we... \r\n \r\nDe Mare:  (overlapping) That’s good, no, no, we just, you \r\ndon’t wanna touch the microphone. \r\n \r\nKelly: We wanna hear you. \r\n \r\nJohnson:  I, I, you know, I really felt like, you know, \r\nthey were kind of guardian for me in a way, because, uh, \r\nthat’s how I felt about the older women.  The one night \r\n----------------Page (39) Break----------------\r\nthat I, that night I told you I took a nap and, and this, \r\nthis lady brought me a candy bar, she was a lot older than \r\nI was, I bet she was just a sweet lady and, uh, I guess she \r\nfelt that we being uh, young girls, looked at, you know, \r\nshould be looked after. \r\nOh, and another thing, I remember having an autograph \r\nbook at that time, and, uh, uh, a lady that was good bit \r\nolder than I was wrote this and I’ll never forget it.  She \r\nwrote, um, “When I was young, my how time, time flies.  \r\nWhen I was kissed, I would close my eyes.  But now that I’m \r\nold, older, and see what I can, see what, how men can be, I \r\nkeep my eyes wide open to see how they can be.”  Something \r\nlike that, we...  I’ll never forget that.  It was, it made \r\nan impression on me because she was... it was advice and she \r\nwas an older woman. \r\n \r\nDe Mare: Yeah. \r\n \r\nJohnson:  You know. \r\n \r\nDe Mare:  That’s awesome. \r\n \r\nJohnson:  Yeah. \r\n \r\n----------------Page (40) Break----------------\r\nDe Mare:  That’s awesome. \r\n \r\n00:38:20:10------------------------------------------------ \r\n \r\nDe Mare:  Were there um, was, was it mostly white women \r\nthat worked at the plant? \r\n \r\nJohnson:  Yes.  I, you know, I’d hardly any... remember any \r\nblack at all, at that time, and I was not familiar with \r\nblack people because in Pennsylvania on a farm, where I \r\nwent to church, school, and everything, there were no black \r\npeople.  But uh, then um, and when I first came to \r\nBaltimore there weren’t that many black people lived in \r\nBaltimore.  Very (few), they, just in the past years since \r\nthat, that, the population has gotten more black.  But I \r\ndon’t remember black people at Martins, you know. \r\n \r\nDe Mare: Yeah. \r\n \r\nKelly:  Do you think, um, can you remember, maybe not with \r\nyourself, but with maybe some of the other, um, people who \r\nworked there, was there any, um, any struggles in terms of, \r\ncould be, male/female, or could it be, you know, boss/ \r\nworkers?  Was there struggles? \r\n----------------Page (41) Break----------------\r\n \r\nJohnson:  I don’t think too much.  I don’t think too much.  \r\nI think that everything went pretty good.  I can... That’s \r\nthe way I, I felt anyway.  If there was, I didn’t know \r\nabout it. \r\n \r\n00:39:32:03------------------------------------------------ \r\n \r\nDe Mare:  Well, it’s interesting ‘cause you said that after \r\nthe war, Martin, they contacted you again about staying on \r\nthere.  I mean, that’s very unusual that they would \r\ncontinue to hire women. \r\n \r\nJohnson:  Yeah. \r\n \r\nDe Mare:  Uh, and I think maybe we can talk to that \r\ntomorrow when we talk to the women who did stay. \r\n \r\nJohnson:  Yeah. \r\n \r\nDe Mare:  But, but you, you, you, you were not interested \r\nright after the war... \r\n \r\n----------------Page (42) Break----------------\r\nJohnson:  No, that, I wasn’t interested anymore, because I, \r\nwell, I had gotten a job at this, uh, uh, in, uh, \r\ndepartment store and uh, I mean it was uh, it was a lot \r\nless money, a lot less money.  I think I got eighteen \r\ndollars a week.  I think that’s what it was, when I first \r\nwent there.  And I think when I left there in nineteen \r\nfour... uh... I left there nineteen fifty one... nineteen four... \r\nuh, fifty, I think, I was making twenty-eight dollars a \r\nweek.  And that’s all.   \r\n \r\nDe Mare:  So that’s significantly less than you were making \r\nduring the war.  \r\n \r\nJohnson:  Yeah. \r\n \r\nDe Mare:  That’s interesting.  And the men who were working \r\nat the plant during the war were making more money than you \r\nwere making. \r\n \r\nJohnson: Yeah. \r\n \r\nDe Mare:  But you were able, were you able, you were able \r\nto support yourself, renting a room, and all of that. \r\n \r\n----------------Page (43) Break----------------\r\nJohnson: Right. \r\n \r\nDe Mare:  Okay.  \r\n \r\nJohnson:  Yeah. \r\n \r\nDe Mare:  That’s very interesting. \r\n \r\nJohnson:  Yeah.  I, I just felt, I, I think I felt \r\nfortunate to be someone who was able to come and, and work \r\nand help, you know, and work for and... I, but I think a lot \r\nof girls would have looked down at factory work, you know, \r\nand I think to this day people look at it, you know... And I \r\nknow that they can’t understand how excited I am about \r\nbelonging to Rosie the Riveters.  I know that they don’t \r\nlook at it like I look at it because, you know, that’s uh, \r\nthey don’t know that, the experience I had, y’know. \r\n \r\n00:41:11:23------------------------------------------------ \r\n \r\nDe Mare:  Can you talk a little bit about, ‘cause you said \r\na couple times that you really wanted to get off the farm.  \r\nCan you talk about when you were a young girl and you saw \r\nyour mother and the other women who were in that life, what \r\n----------------Page (44) Break----------------\r\nlife that, what, how you looked at that life, and, and talk \r\na little about your desire to get away from it. \r\n \r\nJohnson:  Because I just felt there was just, it was, they \r\ndid, they just had a hard life.  They had the housework to \r\ndo, they had the farm work to do, it was long hours.  I had \r\nto milk cows, and uh... then... \r\nI remember the kids who didn’t live on a farm, there \r\nwere some kids who, maybe that... I remember one girl, her \r\ndad was a blacksmith or maybe, you know, an undertaker or \r\nsomething like that, they were, you know, and then, and \r\nthen... I remember we used to have picnics at the park.  It \r\nwould be an all day affair.  I’d have to go home and milk \r\nthe cows and then come back.  Well, after you milked the \r\ncows you had to take a bath, you didn’t have a bathroom, \r\nyou had to do it in a basin, you know, and, and that, and \r\nso, you had, you, and you, you were... You’d think, oh, the \r\nkids are having a good time while you’re home working on \r\nthe farm.  It, you know, farming is no fun. \r\n I used to tell my mother, “I’m never going to marry, \r\nI, I don’t want to live on a farm.”  She said, “Well, then \r\nyou have to stop liking the farming, the farm boys.”  And \r\nthat’s, so, that’s what I did.  I stopped liking the farm \r\nboys. \r\n----------------Page (45) Break----------------\r\n \r\n00:42:41:07------------------------------------------------  \r\n \r\nDe Mare:  That’s awesome.  Kirsten’s a farm girl. \r\n \r\nJohnson:  What’s that? \r\n \r\nDe Mare:  Kirsten’s from, Kirsten grew up on a farm. \r\n \r\nJohnson:  You grew up on a farm?  Where did you, you...? \r\n \r\nKelly:   In Michigan. \r\n \r\nJohnson:  Did you really? \r\n \r\nKelly:  Yeah. \r\n \r\nJohnson:  Ohhhh... \r\n \r\nKelly:  We had uh, cherries, apples and asparagus and \r\npeaches. \r\n \r\nJohnson:  Ohhhh!  Uh huh. So... \r\n \r\n----------------Page (46) Break----------------\r\nKelly:  A lot of picking and, you know... \r\n \r\nJohnson:  Did you like working... \r\n \r\n(Unseen):  Didn’t have cows. \r\n \r\nKelly:  I didn’t, that’s why my dad didn’t have cows.  \r\nHe’s, he’s  like... \r\n \r\nJohnson:  No milkers. \r\n \r\nKelly:  ...we didn’t wanna miss the fun.  \r\n \r\nJohnson:  Did you like work- living on a farm? \r\n \r\nKelly:  I did.  A lot. \r\n \r\nJohnson:  Well, we had lots of food, I mean, you never, you \r\nknow, you just... Uh, just on Sunday, a girl at church, after \r\nchurch we sat in the fellowship hall and she said, “You \r\nmean that you...?”  I said, “We hardly ever had to buy food \r\nat the store.  It was like sugar and flour and those type \r\nof things but other than that you ate what, what was raised \r\non the farm.  You ate the fruit.  You had apples galore, \r\n----------------Page (47) Break----------------\r\nand you had peaches, and all that kind of stuff.  You had \r\nyour own potatoes and your, all your other vegetables.  And \r\nyour meats.  And you didn’t have to buy much.  Which we, we \r\nwere well fed.  You know, but... \r\n \r\nKelly:  And you canned a lot.  I mean, you... \r\n \r\nJohnson:  Canned.  You canned... \r\n \r\nKelly:  Yeah. \r\n \r\nJohnson:  ...and you smoked the meat.  They smoked the meat, \r\na lot times, and... \r\n \r\nDe Mare:  How, do you remember how they did that?  Did you \r\nhave a smokehouse? \r\n \r\nJohnson:  They had a smokehouse, uh huh.  They had a \r\nsmokehouse and, and uh, you smoked all the meat in there.   \r\n \r\n00:44:09:14------------------------------------------------ \r\n \r\nDe Mare:  That’s amazing. \r\n \r\n----------------Page (48) Break----------------\r\nKelly:  You could, you had quite a journey.  I loved \r\nhearing your stories... \r\n \r\nJohnson:  Do ya?   \r\n \r\nKelly:  ...’cause of this, it was a farm thing... \r\n \r\n(Unseen):  That was before freezers. \r\n \r\nJohnson:  Yeah.   \r\n \r\nKelly:  You know, farm going to... \r\n \r\nDe Mare:  Yeah, yeah, that was going to... \r\n \r\nKelly:  ...the big city... \r\n \r\nJohnson:  Big city. \r\n \r\nKelly:  That’s what, that’s what happened to me.  And I was \r\nlike, “Whoah!” \r\n \r\nJohnson:  Like the boy saying the farm, “Poor farm girl \r\nwent to the city and made good.” \r\n----------------Page (49) Break----------------\r\n \r\nDe Mare:  Is there anything else that you want to talk \r\nabout from that time that we didn’t touch on? \r\n \r\nJohnson:  I don’t know what to tell.  I don’t know.   \r\n \r\nDe Mare:  Is there any other story that sticks out in your \r\nmind... or...? \r\n \r\nJohnson:  I remember about, a, a story about, ‘bout when, \r\nwhen my mother, when I was living down here, and my mother \r\nhad a, had problems, she went to the hospital, and I \r\nthought she had gall bladder problems and, uh, I, uh, and I \r\nwas twenty years old, you know, and I went home and I said, \r\n“Mom, what, what did they tell me, what did they tell you?”  \r\nShe said, “Well, I’ve been trying to tell you, I’m going to \r\nhave a baby.”  And I was twenty years old!  But I was, my \r\nmother was only nineteen when I was born, ‘cause people \r\nwere very young when they got married in those days, and \r\nso... Anyway.  So.  She was only nineteen when I was born so, \r\nuh, I mean, so she was only thirty-nine when my brother was \r\nborn, but I thought she was old, you know.   \r\n \r\n00:45:25:25------------------------------------------------ \r\n----------------Page (50) Break----------------\r\n \r\nDe Mare:  The only thing that I would ask, if you want to \r\ntalk to it, is you said that your, your husband was in the \r\nservice... \r\n \r\nJohnson:  Yes. \r\n \r\nDe Mare:  And that he was in the South Pacific.  And you \r\nmade, you made reference to the fact that it was tough for \r\nhim.  \r\n \r\nJohnson:  Uh huh. \r\n \r\nDe Mare:  It was a tough experience.  Could you talk a \r\nlittle bit about that? \r\n \r\nJohnson:  Well, he talked about when he would be in a fox \r\nhole, which I can’t picture what a fox hole is, but he \r\nsaid, you know, when, he said when he came home, he said he \r\njust cried and cried ‘cause his nerves were so bad from \r\nhaving been uh, in, you know, in, in such, in the fighting.   \r\nHow, and, uh, I just can’t picture it, you know, and uh, \r\nbut he... I, I really think it took a toll on the men, uh, \r\nbecause a lot of the men who were in the service, I, well, \r\n----------------Page (51) Break----------------\r\nhe died when he was seventy-one, and I feel like, would he \r\nhave lived longer if, um, you know, if he hadn’t been in, \r\nin that stressful time?  ‘Cause stress can take a lot out \r\nof you.   \r\n \r\nDe Mare:  Oh yeah.  \r\n \r\nJohnson:  So...  \r\n \r\nKelly:  Did the men, did the men talk about it much?  The \r\nexperience...? \r\n \r\nJohnson:  At first when we got married, he did, but my \r\ngirls, my girls say, “Why didn’t we ask Dad more \r\nquestions?”  But he didn’t talk about it to them.  I don’t \r\nthink he wanted to, you know, maybe he felt like they \r\nshouldn’t have to know what he went through.  Maybe that’s \r\nthe way it was.  I don’t know.  But they often say they \r\nwished they’d’ve asked him more questions.   \r\n \r\n00:46:52:00------------------------------------------------ \r\n \r\nDe Mare:  Yeah. \r\n \r\n----------------Page (52) Break----------------\r\nKelly:  Great. Well, thank you, yeah. \r\n \r\nDe Mare:  You’re done. \r\n \r\nKelly:  Yeah.   \r\n \r\nDe Mare:  You are done.  You were wonderful. \r\n \r\nKelly:  Thank you so much.   \r\n   \r\n \r\n \r\n----------------Page (53) Break----------------\r\n"}