{"id":"baltimore-rosies","identifier":"ROSIE_INTERVIEW_005","hash":"rosie","url":"http://127.0.0.1:8080/interviews/baltimore-rosies","label":"The Baltimore Rosies","description":"From the Glen L. Martin Maryland Aviation Museum in Baltimore, fourteen women discuss their experiences working at two major aircraft companies. ","image":"http://127.0.0.1:8080/images/ROSIE_INTERVIEW_005-interview-thumbnail.jpg","type":"video","content":"From the Glen L. Martin Maryland Aviation Museum in Baltimore, fourteen women discuss their experiences working at two major aircraft companies.   \r\n \r\n \r\nThe Baltimore Rosies: Disc One, Introductions \r\n \r\nThe Real Rosie The Riveter Project \r\n \r\nInterview 5 \r\n \r\n \r\n \r\n \r\n \r\n \r\nInterview Conducted by \r\n \r\nAnne de Mare & Kirsten Kelly \r\n \r\nApril 16, 2010 \r\n \r\nBaltimore, Maryland \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\nFor The \r\n \r\nTamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n----------------Page (0) Break----------------\r\nInterview: The Baltimore Rosies: Disc One, Introduction \r\n \r\nInterviewers: Anne de Mare & Kirsten Kelly \r\n \r\nDate:  April 16, 2010 \r\n \r\nPlace:  Baltimore, Maryland \r\n \r\n \r\n \r\nHenninger:  Hello, I’m Grace Penner Henninger, and I came \r\nto work at the Martins in nineteen, uh, forty-four, October \r\nthe seventeenth.  I trained to be a Rosie the Riveter in \r\none of these buildings here.  I don’t know which one, but \r\nat that time they weren’t connected together. So it was \r\nprobably the one in the middle; Number Two, I guess that \r\nwould be it.  And, um, I’d never had a gun in my hand, uh, \r\nthe... the... uh, driver of the rivet, and I never had... I knew... \r\ndidn’t know what bucking meant.  But I soon found out.   \r\nAnd so, uh, uh, uh, one of the guards were teasing me \r\nbecause I’m from North Carolina.  Well, the reason I came \r\nup was my aunt Nina, uh, Miller worked at Martins for a \r\ncouple years before I came up and, uh, she worked in B \r\nBuilding on the fff... uh, inspector as a, uh, floor of the \r\nPBM.  Well, it so happened after I’d finished my training, \r\nthe two weeks training, I was put in the department in B \r\nBuilding and it was called the B step of the PBM, and \r\nthat’s the part that sits down in the water, the tail end \r\nof the thing. (Laughs)  \r\n----------------Page (1) Break----------------\r\nAnd so, uh, there... I was in a group of about ten or \r\nfourteen men at that time, and I was the only lady working \r\nthere.  They respected my very much because I didn’t cuss, \r\nI didn’t like some of the other ladies, and they really \r\nrespected me and I appreciated that.  So I learned to do \r\nthe jobs of about six of the men that left to go to war.  \r\nAnd uh, uh, so it was, uh, I learned to do, uh, rivet, uh, \r\nfrozen rivets that went into the tail section and, uh, uh, \r\nit was just a wonderful experience. \r\n \r\n00:02:23:19------------------------------------------------ \r\n \r\nLedbetter:  I’m Nellie Ruth Ledbetter.  I worked at the \r\nMartin Company for twenty-seven years.  I loved every \r\nminute of it, I did just about everything that she \r\nmentioned.  The last job that I did was on a experimental \r\nspace station.  And, uh, you had to put a white shoe, uh, \r\ncap over your shoe and over your head; if you had dandruff \r\nin your hair, you wasn’t allowed in the room.  It was very \r\ninteresting and I, uh, enjoyed it. \r\n \r\n00:2:57:12------------------------------------------------- \r\n \r\n----------------Page (2) Break----------------\r\nNichols:  My name is Mary Dunnum Nichols.  I, uh, I worked \r\nat Martins from June of 1943 until the war was over.  Uh, \r\nand then I went to the University of Maryland.  So, and I \r\nwas a... I did drafting work.  I changed the drawings from \r\nwhich the blueprints were made for the B26. \r\n \r\n00:03:22:21------------------------------------------------ \r\n \r\nStemler:  My name is Rita Appell Stemler and I worked for \r\nthe, uh, engi... engineering personnel director.  I was a \r\nsecretary.  It was very interesting work because we were \r\ninvolved with lots of, um, of recruiting and, uh, um, we... \r\nwe had some incidents where, unfortunately, some of our \r\nengineers we had to escort out because they had made recent \r\ntrips to Germany.  (Laughs)  But, uh, it... it... it was \r\nrather... rather perturbing to see the men in the black suits \r\ncome and... and... and, eh, inform us of this, uh, incident.   \r\n \r\nDe Mare:  Wow. \r\n \r\n00:04:10:05------------------------------------------------ \r\n \r\nJohnston:  Uh, my name is Idilia Spence Johnston and I \r\nworked at Ohio Crankshaft in Cleveland, Ohio.  And I was \r\n----------------Page (3) Break----------------\r\nthe assistant comptroller making up the reports for the \r\nboard meetings every week, biweekly and Monthly.   \r\n \r\n00:04:27:26------------------------------------------------ \r\n \r\nSimon:  My name is Loretta Tuling Simon and I worked at \r\nMartins in 1942 and ‘43.  And, um, I first went in working \r\nat, um, with my boss in filing his file work.  And I got \r\nbored and asked to go into assembly and I went and had \r\ntraining on the job with assembly work, working on the tail \r\nend of the plane.  And it was very, very interesting.  I \r\nlearned a lot.  I would go back and do it again.   \r\n \r\n00:05:04:28------------------------------------------------ \r\n \r\nArnold:  My name is Elsie Godwin Arnold and I worked at \r\nGlenn L. Martin for two years.  \r\n \r\n00:05:12:13------------------------------------------------ \r\n \r\nPodolsky:  Uh, Alice, uh, Whitmer Podolsky and I worked at \r\nthe Glenn L. Martins from nineteen forty-one, I think, \r\nuntil forty-three. \r\n \r\n----------------Page (4) Break----------------\r\n00:05:25:01------------------------------------------------ \r\n \r\nBrawner:  Okay, my name is Rita Brawner and I worked, uh, \r\n1942 at the training school.  They had a training school \r\ndown here by Plant Two for young men in the service, and \r\nwhen they left they were issued, uh, uh, parachutes and \r\nboots.  And it was just a small detachment; there was about \r\nten barracks where they lived, and there were only about \r\nten girls that worked in permanent party.  And I typed up, \r\num, payroll roster and I also worked in the Quarter \r\nMaster’s office where I typed up requisitions for the diff... \r\ndifferent, uh, uh, outfits that the men were issued before \r\nthey left.   \r\nAnd when I left there, then I worked at Martins, uh, \r\nPersonnel, and I worked there for three years.  So... of \r\ncourse that was a lot hiring duties in personnel.  And it \r\nwas a lot different then; I mean, everything was \r\ncamouflaged here.  And at the beginning of the war, Essex \r\nwas a very small town.  That’s where I lived.  And then \r\nsuddenly there were more than sixty-two thousand people \r\nhere from all over the country to work at Martins.  They \r\ndidn’t have any place for them to live, and they put up \r\ntemporary houses and Victory Villa and Arrow Acres to... and \r\nthere were a lot of people that opened their homes at Essex \r\n----------------Page (5) Break----------------\r\nfor boarders to come in and work.  So, that’s about all I \r\ncan think of off the top of my head. \r\n \r\nDe Mare:  Wonderful. \r\n \r\n00:06:56:15------------------------------------------------ \r\n \r\nDe Shaw:  I’m Mary De Shaw, and I was, uh, the first group \r\nof women that worked... started at Martins.  I riveted.  I \r\nworked in C Building and final assembly on the planes... \r\nfleet ships that came back from the service.  Very \r\ninteresting work; I loved it. \r\n \r\n00:07:16:05------------------------------------------------ \r\n \r\n Johnson:  I’m Violet Federoff Johnson and I worked at \r\nMartins, uh, from 1942 to 1945.  Very interesting; I’m \r\nproud of the fact that I worked there.  Thanks. \r\n \r\n00:07:26:26------------------------------------------------ \r\n \r\nYingling:  My name is Rose Fodorsky Yingling I worked at \r\nGlenn L. Martins for five years. \r\n \r\n----------------Page (6) Break----------------\r\n00:07:33:12------------------------------------------------ \r\n   \r\nKing:  Hello, good morning.  I’m Susan Taylor King.  I \r\nattended the National Defense School in 1942 when I \r\nfinished high school, and I worked at Eastern Aircraft from \r\n1942 through 1943 before I returned to school. \r\n \r\n00:07:50:00------------------------------------------------ \r\n \r\nBrunner:  Therada Carter Brunner.  I worked at Glenn L. \r\nMartin’s Number Two Plant.  The second shift.  Get, uh, uh... \r\nmy first job.  And I did it at night, you know, catch the \r\nbus and come down.  And when I first seen the parking lot \r\nwith all the camouflage, I... “Oh, my.”  You know, it was so \r\ndifferent.  And that... I just worked for about a couple of \r\nyears.  That’s it. \r\n \r\n00:08:12:10------------------------------------------------ \r\n \r\nGreene:  Okay, I’m  Vera Green, no, Vera Golya Green and \r\nduring the war my nickname was ‘Red Screen’ because I did \r\nhave natural long red hair, so I... when I married, I became \r\nRed Screen.  But I worked at Eastern Aircraft and I worked \r\nfrom 1941 until the end of the war, forty-five. \r\n----------------Page (7) Break----------------\r\n \r\n00:08:32:22------------------------------------------------ \r\n \r\nBartholomey:  I’m Leona Schissler Bartholomey, and I worked \r\nat Martins for just seven months, but I changed over when \r\nmy husband was going overseas to be with him for a while.  \r\nSo they gave me a leave, and when I came back I went to \r\nwork for Eastern Aircraft.  And I worked to the end of the \r\nwar. \r\n \r\n----------------Page (8) Break----------------\r\n"}