{"id":"bonnie-gifford","identifier":"ROSIE_INTERVIEW_007","hash":"rosie","url":"http://127.0.0.1:8080/interviews/bonnie-gifford","label":"Bonnie Gifford","description":"Bonnie Gifford moved to the city of Muskegon when she heard they were hiring women during the war. ","image":"http://127.0.0.1:8080/images/ROSIE_INTERVIEW_007-interview-thumbnail.jpg","type":"video","content":"Bonnie Gifford moved to the city of Muskegon when she heard they were hiring women during the war.   \r\n \r\n \r\nBonnie Gifford \r\n \r\nThe Real Rosie The Riveter Project \r\n \r\nInterview 7 \r\n \r\n \r\n \r\n \r\n \r\n \r\nInterview Conducted by \r\n \r\nAnne de Mare & Kirsten Kelly \r\n \r\nMay 6, 2010 \r\n \r\nWest Muskegon, Michigan \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\nFor The \r\n \r\nTamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n----------------Page (0) Break----------------\r\nInterview: Bonnie Gifford \r\n \r\nInterviewers: Anne de Mare & Kirsten Kelly \r\n \r\nDate:  May 6, 2010 \r\n \r\nPlace:  West Muskegon, Michigan \r\n \r\n \r\n \r\nDe Mare:  So, can we start?  Can you just introduce \r\nyourself to me and tell me when and where you were born? \r\n \r\nGifford:  Mi... wh... I’m... y... my name?  Bonnie.  Yeah, and I \r\nwas born in Claybeck Township in... on a farm.  And went to a \r\ncountry school, and then went to high school at Montague \r\nHigh, rode a school bus every day, so graduated from \r\nMontague High, number six from the top.  I’m... Pete... I’m... \r\nI’m with Pete. \r\n \r\nDe Mare:  Yeah.  And how many, uh, children were in the \r\nfamily? \r\n \r\nGifford:  Four girls. \r\n \r\nDe Mare:  All girls? \r\n \r\nGifford:  Mm-hm.  My dad cried when the youngest girl was \r\nborn, because she wasn’t a boy.  And, uh, three of us girls \r\n----------------Page (1) Break----------------\r\nall worked at The Continental, were Rosie the Riveters.  \r\nMm-hm. \r\n \r\nDe Mare:  All three of you? \r\n \r\nGifford:  So, all three of us and we’re still living.  All \r\nthree girls are still living.  Sisters.     \r\n \r\nDe Mare:  Oh, wow.  And what did you, um, we go back.... \r\nbefore we get into the work at Continental, can you \r\nremember what life was like for the women around you when \r\nyou were a child?  What did your mother do and your aunts? \r\n \r\nGifford:  My mother always stayed home with us and worked.  \r\nYou know, and raised three kids, and in... b... b... b... but uh, \r\nin the community, my aunts?  Two of my dad’s sisters didn’t \r\nhave children.  So, they were just workin’ odd... odd... odd \r\njobs, can... uh, restaurants, and cooking for other people, \r\nand that... cleaning for other people, kind of that stuff. \r\n \r\nDe Mare:  Um, do you remember when you were young, um, did \r\nyou have any kind of role models?  Were there any women \r\nthat you kind of admired?  Um, you wanted to be like?  You \r\nimagined growing up like? \r\n----------------Page (2) Break----------------\r\n \r\nGifford:  There was one girl that used to come to the Stony \r\nLake Dances.  That... I was probably eight or nine, and she \r\nwas, like, seventeen, eighteen years old.  And I liked that \r\ngirl and her name was Tonnie.  And I said, “Oh, if only I \r\ncould be like her when she grows up.”  But I... She was dark... \r\ndark hair and everything, so.  And that... so... and I never \r\nget to look like her, just unless I dyed my hair. \r\n \r\n00:02:06:21------------------------------------------------ \r\n \r\nDe Mare:   Um, now you grew up on a farm, did you work on \r\nthe farm? \r\n \r\nGifford:  Mm-hm. \r\n \r\nDe Mare:  And what kind of... what kind of farming did you \r\ndo? \r\n \r\nGifford:  Um, my dad just had just general farming.  Cattle \r\nand, uh, he had a little apple orchard and stuff.  Yeah, us \r\nkids we had to pick strawberries, we had to thin peaches, \r\nwe had to pick cherries to the neighbors to earn money for \r\nschool clothes.  Pick ‘em, you know, in lugs and stuff and \r\n----------------Page (3) Break----------------\r\nthat was it.  Went to catechism in summers and school in \r\nthe winter.  And that was it. \r\n \r\nDe Mare:  Do you remember when you did that kind of work, \r\nhow much money you made when you worked, uh, as a kid on \r\nthe farm?  When you worked for other people? \r\n \r\nGifford:  For pickin’ cherries?  Yes.  We picked a lug of \r\ncherries, twenty-five pound lug for twelve and a half \r\ncents.  And one day I picked eight lugs and I made a \r\ndollar.  Pickin’ cherries.  Yeah, and then we thin peaches \r\nto some of the neighbors, and then we got like forty cents \r\nan hour; that was pretty good- forty cents an hour for \r\nthinnin’ peaches.  And that wasn’t hard work and I loved to \r\ndo it. \r\n \r\nDe Mare:  Mm-hm. \r\n \r\nGifford:  Yeah. \r\n \r\nDe Mare:  Why did you love to do it? \r\n \r\nGifford:  Why?  Because it was clean and you had to take a \r\nlimb down and you gotta... had to put ‘em like six inches \r\n----------------Page (4) Break----------------\r\napart on one side and then on the other side of the limb so \r\nthey wouldn’t touch each other.  And it just was nice.  And \r\nthere were a whole bunch of us in the orchard and we had a \r\ngood time.  But when you pick cherries you got dirty.  \r\nJuice down to your elbows, you know.  Sticky.  It was \r\nmessy.  I never liked to do it, but I liked to do it for \r\njust a little bit of money that we made. \r\n \r\nDe Mare:  Yeah. \r\n \r\nGifford:  Mm-hm. \r\n \r\n00:03:40:07------------------------------------------------ \r\n \r\nKelly:  Was it pretty isolated- you can still answer her, \r\nbut I’ll just say it... what was it... the farms were... you were \r\nkind of really out in the country so it was... what was the \r\ntimes when you got together with other people or was that \r\noften or... \r\n \r\nDe Mare:  Do you... do you remember kind of how it felt to be \r\nout in the... in the real rural areas?  In terms of... \r\n \r\n----------------Page (5) Break----------------\r\nGifford:  Yeah, we... well, it was general... they had \r\ndifferent things they did out there in the country.  And, \r\nuh, played card games and stuff like that and, uh...  Kids, \r\nwe got to play and played a lot of indoor ball.  For the \r\nneighborhood kids, they’d come over at nights and we’d play \r\nball and softball and it was just a way...  We had to go to \r\nchurch and we had to go to catechism and...  \r\nAnd every Saturday night my dad had to go to a dance.  \r\nHe was a beautiful waltzer, so we went to Stony Lake, we \r\nwent to Harp; we went to Hightower and Boomer Valley.  And \r\nhe called for the square dances.  And he got false teeth, \r\nand so we was up... and you know, our garage in Shelby, Kris, \r\nthat we had, you know, above there... there was a... uh, a \r\napartment building or big buildings and they had dances \r\nthere on Saturday night.   \r\nAnd so my dad... my dad was... my uncle ran it so my dad \r\nwas asked to call.  You know, and he was a good caller and \r\nhe had... they... he said, “I can’t call tonight ‘cause I just \r\ngot my false teeth.”  And they said, “Well, get up there; \r\nthey aren’t gonna fall out.”  So, he took his handkerchief, \r\nand held it above his mouth, so in case his teeth fell when \r\nhe called it, they would catch it.  But they didn’t fall, \r\nand he got along fine, so that was... that was kind of cute.  \r\nAnd then it’s so funny because later on in life they... they \r\n----------------Page (6) Break----------------\r\ntook that off- the garage- and my husband and another guy \r\nbought that for their... for their business.  So, where I \r\ndanced above, was our business was below.  So, another \r\nfunny incident. \r\n \r\nDe Mare:  Did you like to dance when you were younger? \r\n \r\nGifford:  Oh, I danced all the time.  I was dancin’ when I \r\nwas three to five years old.  My dad said he raised his \r\nfour daughters on a dance floor.  ‘Cause he always had to \r\ngo do that.  Family there... families went, you know, at that \r\ntime.  Now... now they don’t do that. \r\n \r\n00:05:48:07------------------------------------------------ \r\n \r\nDe Mare:  Now, did you... Did you have a live band or was it \r\nrecorded music? \r\n \r\nGifford:  Live band.  Mm-hm.  Real good bands at Stony \r\nLake, and good, good bands every place I went.  No recorded \r\nmusic.  Not in those days, no.  And then they had square \r\ndances every so long, so then you had to learn to learn all \r\nthose.  And I learned all those and had square dance \r\npartners and had lots of fun. \r\n----------------Page (7) Break----------------\r\n \r\nDe Mare:  Sounds like it. \r\n \r\nGifford:  Lots of fun. \r\n \r\nDe Mare:  Um, now, can you remember how you found... how you \r\nfound out about the... the wo... the... the work you did during \r\nthe war?  Like, how did you make your way from being a farm \r\ngirl out there to having this job? \r\n \r\nGifford:  Okay. \r\n \r\nDe Mare:  Yeah. \r\n \r\nGifford:  I worked at, um, after I graduated from high \r\nschool I worked summers down the Stony Lake Camp- girls \r\ncamp- and then I went to work at, um, Whitehall Forum where \r\nthey did newspapers and printing press, and that’s where I \r\nwas when my girlfriend, one of my girlfriends, came on a \r\nThursday night- she got layed off at the Whitehall Tannery, \r\nand she said, “Bonnie, tomorrow morning I’m pickin’ you up \r\nand we’re goin’ down to The Continental.  They’re hiring \r\noff the streets in Arkansas,” she said.  And so she says, \r\n----------------Page (8) Break----------------\r\n“I’m pickin you up and we’ll go down and put in our \r\napplication.”   \r\nSo, Friday morning she picked me up- I had an \r\napartment in Whitehall- she picked me up, then we went down \r\nto the employment office, put in our application.  They \r\nsaid, “You’re hired.”  Both of us.  And they said, “You go \r\nto the doctor- this doctor- and get a little exam.  And \r\nthen I want you to go to Grossman’s and pick out your, um, \r\num, uniforms.”  So we hurried and went to the doctor, and \r\nthen we hurried and went to Grossman’s.  But we couldn’t \r\nget ‘em that day, ‘cause he said, “If you can get ‘em, we \r\ncould start work Saturday morning.”   \r\nThen we went back to him, “We can’t get ‘em,” because \r\nyou had to... women had to wear ‘em, so we can’t get ‘em til \r\nSaturday.  So, they said, “Well, you get ‘em Saturday, and \r\nyou come Monday morning to work.”  So we went... both went \r\nthere and got ‘em and Monday morning we went to work and we \r\nboth got a job, on the same job, on the same line; in the \r\ntest house where they tested all the motors.  Lotta noise.  \r\nLotta noise.   \r\n \r\n00:07:54:14------------------------------------------------ \r\n \r\n----------------Page (9) Break----------------\r\nDe Mare:  Can you, um, can you tell me what you meant when \r\nyou said they were hiring off the street in Arkansas?  I \r\ndon’t understand what you meant by that.  When your friend \r\ncame and said they’re hiring off the street. \r\n \r\nGifford:  Pe... people from The Continental had gone down \r\nthere, and the people in Arkansas that didn’t have jobs, \r\nand I happen to get my first boss was from Arkansas.  \r\nCalled him ‘Slim’ and he talked southern.  That was my... \r\nthat was our boss and we called him ‘Slim’.  And a very \r\nnice guy.  Tall, you know, like the... the Arkansas people.  \r\nYeah. \r\n \r\nDe Mare:  And what... what was the name of the com... the full \r\nname of the company?  Can you tell me a little bit about \r\nexactly what you did? \r\n \r\nGifford:  What I did? \r\n \r\nDe Mare:  Yeah. \r\n \r\nGifford:  Okay, when I first started I... I was workin’ \r\nthere... after the... I was workin’ the four cylinder motors.  \r\nThey tested them.  And after they run some long, then they \r\n----------------Page (10) Break----------------\r\nput ‘em on our line- it’s was big, big line- and sideways.  \r\nA guy had to use the big, um, lift truck... lift thing that \r\nwas hooked up to the ceiling.  And he’d lay ‘em sideways on \r\nthese little buggies, and the buggies would slide. And the... \r\nWhen I first started I took the oil pans out and \r\nwashed ‘em.  And I had to use a electric thing to pull out \r\nevery plug, you know, that put... put ‘em on there.  And, um, \r\nthen after we got really busy, then I... I moved on by where \r\nmy girlfriend was- Abby, her name was.  And then we took \r\nthe... tightened up the bearings, with the wrench, uh, like... \r\nlike a ‘T’, and we had to tighten ‘em up and put the cotter \r\npins in after we got em tightened in the little holes \r\nthere.   \r\nAnd then put the pliers and bu... bend those ends back \r\nso that so they wouldn’t come out, you know, and then they \r\nwere pushed on down to the... they, uh, he examined them to \r\nsee if there was any, um, water in the little oil that was \r\nleft.  And then when he got done, then he passed them on \r\ndown and they put the pans back on, ‘cause the pan was \r\ntipped up on side the rollers so it went right with them.  \r\nAnd then a girl would be down there puttin’ the pans on, \r\nand then they went to the... to the paint line.  Sprayed... \r\nthey sprayed... they washed ‘em and spr... paint... dried ‘em and \r\npainted ‘em and then they went to shipping. \r\n----------------Page (11) Break----------------\r\n \r\n00:10:03:09------------------------------------------------ \r\n \r\nDe Mare:  Wow.  And what were the engines for?  What... \r\n \r\nGifford:  The four cylinder ones were used for, um, lift \r\ntrucks for all the army camps and war and stuff.  And we \r\nput a lot of ‘em through there, international harvests and \r\nall.  Then the six-cylinder line behind me, they used those \r\nfor jeeps.  And then the great, big ones that roared all \r\nthe time, night and day, you know, they used those for \r\ntanks.  For the war. \r\n \r\nDe Mare:  Wow. \r\n \r\nGifford:  So that was it.  That’s what... I did that for \r\n‘bout two and a half years. \r\n \r\nDe Mare:  Wow.   \r\n \r\nGifford:  Mm-hm. \r\n \r\nDe Mare:  And you said that all the... that two of your \r\nsisters also worked with you. \r\n----------------Page (12) Break----------------\r\n \r\nGifford:  Yep. \r\n \r\nDe Mare:  Did you get them those jobs... \r\n \r\nGifford:  Yep. \r\n \r\nDe Mare:  ...or how did that work? \r\n \r\nGifford:  Yes, I did.   \r\n \r\nDe Mare:  Can you tell me that story... \r\n \r\nGifford:  Yeah, I will. \r\n \r\nDe Mare:  ...and how it happened? \r\n \r\nGifford:  I got... I, uh, was... I got hired in April and my \r\nsister, Billie, was working in Montague High School, in the \r\noffice.  And so when she got out the first of June- and I \r\nhad an apartment- I said, “Why don’t you come down and put \r\nyour, um, application in.  Maybe you’ll get a job.”  So, \r\nshe come down and we went to Muskeega, she rode on the \r\nGreyhound Bus, and went in there and saw a bunch of young \r\n----------------Page (13) Break----------------\r\nkids come out, and they wouldn’t take their applications.  \r\nAnd Billie thought, gee, I thought, “What in the heck’s \r\nwrong?  What’s the use of me comin’ over?”  But she said, \r\n“I made up my mind.  I’m goin’ in.  I’m here.”  So, she \r\nwent in and they hired her.  She started right away.  She \r\nhad to get a uniform.   \r\nSo then, Eleanor, the, uh, uh, she worked at the \r\ngrocery store in Rothbury, she lived there with her \r\nhusband, and, uh, she was only makin’, like, fourteen \r\ndollars a week, and I said to Eleanor, “Why don’t you come \r\ndown here and put your application in?”   So she did.  She \r\ngot in right away, but she got in the lab.  Rr... I don’t \r\nknow what kind... I don’t know what kinda work she did.  But \r\nshe was in a lab.   \r\nAnd so then, that fall, I said to my dad, “When you \r\ngot,” you know, he just had to milk cows, he had the field \r\nwork done and everything else is all done, and I said, “Why \r\ndon’t you...” He used to work at The Continental before he \r\ngot married, and I said, “Why don’t you go down and put \r\nyour application in.”  So he went down, put... and he got \r\nhired right away.   So that... that was it.  But he just \r\nworked winters and then when he... and then he had summers he \r\nhad to work on the farm, y’know.  So he just worked one \r\nwinter.  But he liked it down there.   \r\n----------------Page (14) Break----------------\r\nAnd he went back to put it in again after he... the next \r\nNovember, and they... they did it all different.  You had to \r\ngo to the city one to get... to apply for a application.  And \r\nthey would send you where everybody wanted you.  You \r\ncouldn’t go to Continental, y’know, you had to go where \r\nthey sent ya’.  So, they sent him to Lakey’s, but he said, \r\n“I will not go to Lakey’s.”  Lakey’s Foundry, ‘cause you... \r\nit was hot... was... he thought...  He said, “I will not work in \r\na foundry.”  He had a good job at The Continental, but they \r\nwouldn’t do it.  They wouldn’t put him back in there.  So, \r\nthen he just quit, eh, for good and he never went back to \r\ntry.  So, that was the end of our workin’, and we all \r\nworked there ‘til the war was... what... practically over with \r\nand ... \r\n \r\n00:12:48:09------------------------------------------------ \r\n \r\nDe Mare:  Wow.  So it really... so the... so the... the eight... \r\nthe hiring office was hiring not just for Continental but \r\nfor... \r\n \r\nGifford:  For the whole city. \r\n \r\n----------------Page (15) Break----------------\r\nDe Mare:  For the city.  So, all the defense jobs that \r\nwere... \r\n \r\nGifford:  Yeah. \r\n \r\nDe Mare:  ...going on... \r\n \r\nGifford:  Yeah. \r\n \r\nDe Mare:  ...there was a central hiring that took place. \r\n \r\nGifford:  That’s right. \r\n \r\nDe Mare:  Interesting.  Okay. \r\n \r\nGifford:  When you had to go where they sent you.   \r\n \r\nDe Mare:  Right. \r\n \r\nGifford:  And if they didn’t hire... if you didn’t want it \r\nthere, they didn’t wait.  Take somebody else... \r\n \r\nDe Mare:  Right. \r\n \r\n----------------Page (16) Break----------------\r\nGifford:  ...for whenever they come in.  But before that we \r\njust went to the Continental office and that went a lot \r\nbetter. \r\n \r\nDe Mare:  Do you remember when that was?  When you started \r\nworking? \r\n \r\nGifford:  Uh-huh. \r\n \r\nDe Mare:  When was that? \r\n \r\nGifford:  April first of nineteen forty-three.  Uh-huh. \r\n \r\nDe Mare:  April first, nineteen forty-three.  Okay.  Now, I \r\nwanna go back.  You were living on your own in an apartment \r\nbefore you got that job.  Before... \r\n \r\nGifford:  Uh-huh. \r\n \r\nDe Mare:  Now what were you doing for a living?  Tell me \r\nagain what you were doing for a living. \r\n \r\nGifford:  I was working at the Whitehall Forum, which was a \r\nnewspaper office and a printing office and we did, um... \r\n----------------Page (17) Break----------------\r\nWhitehall Forum was the name of their weekly newspaper, we \r\ndid the Montague Observer, and the Labor Review from \r\nMuskeega, and then we did other printing orders and stuff, \r\nand that, so... \r\n \r\nDe Mare:  And... \r\n \r\nGifford:  ...I worked there.  \r\n \r\n00:13:49:14------------------------------------------------ \r\n \r\nDe Mare:   ...and what did you do there?  Did you work in the \r\noffices or did you work in the... where did you work? \r\n \r\nGifford:  I worked in the back where they did, uh, but I \r\ndid a lot of, uh, oh, I did... I wrapped pres... their orders \r\nout and I run kloogie machines and run some of the small, \r\nlittle things. \r\n \r\nDe Mare:  What’s a kloogie machine? \r\n \r\nGifford:  Where they, uh, had small orders. Like they had a \r\norder of thirty, might have thirty or forty, and then you \r\njust put them one at a time, and pull it out, put one in.  \r\n----------------Page (18) Break----------------\r\nI run that... they... they call the kloogie.  And, oh, the \r\nkloogie was bigger.  That was the hander.  The kloogie, I... \r\nthey used to do ballots, you know, for elections, and my \r\nboss said to me... he said, “Now you watch and count those so \r\nthere isn’t any missin’.”  So, my job was to sit there and \r\nwatch that thing, clickity clickity clickity click and I \r\nhad to count to make sure there was not one missing.  That \r\nwas the job.  Took a long time but it was easy.   \r\nI sat there and I did other little things.  I made, \r\nuh, pictures to put in the newspapers out of metal and \r\nstuff.  I... I, uh, melted all that metal and stuff.  And \r\nthen I put... they come in big vats, you know, big vats.  And \r\nthen you had to lay those down in there and pour the metal \r\nin the big thing and leave it sit for so long.  And when it \r\ngot dry, you pick it out.  Then I had to cut those all out \r\nwith a saw, I had to wear glasses so I wouldn’t get metal \r\nin my eye.  All kinds of things.  Just everything.   \r\nStacked papers and put address... and the... and when you \r\naddress the papers, every week you ran a... a... ad... address... \r\nwhere there address are, there was a machine, uh, well, \r\nyeah, you run it with your foot.  So, I had to take all \r\ntheir Montague Observers, I had to work nights.  Couple \r\nnights before the paper’d go out.  And I had to put every \r\npaper in there so every address got in.  I’d clickity \r\n----------------Page (19) Break----------------\r\nclickity cl.... And I had to keep files for the things so \r\neverything was in order.  I did the neigh... I did the \r\nWhitehall Forum, I did the Montague Observer and I did the \r\nLabor Review.  Easy job, but there was that clickity click, \r\nclickity click, clickity click.  I can still hear that \r\nclickity click.   \r\n \r\n00:15:44:09------------------------------------------------ \r\n \r\nDe Mare:  And how much money did you earn doing that work \r\ncompared to when you took the job down at... at Continental? \r\n \r\nGifford:  I... first... when I first got the Whitehall Forum I \r\nmade forty cents an hour.  And then I was there about three \r\nmonths and then they gave me forty-five.  And then I wasn’t \r\nthere quite a year when Abby came and got me.  She said, \r\n“Come on.”  So, I went.  I said, “Yeah, heck, why not, you \r\nknow?”  So, then we started out with fifty cents an hour at \r\nThe Continental but we made more with the bonuses.   \r\n \r\nDe Mare:  Can you explain how that worked?   \r\n \r\nGifford:  Well, it went by how your, um, how much work you \r\nput out... your department put out.  And we got paid every \r\n----------------Page (20) Break----------------\r\ntwo weeks, and Jim Sullivan was the head guy and he would \r\ncome out and put on the board what our bonuses were.  And \r\nwe always made more with the... on the bonus then we did on \r\nthe regular pay.  So... \r\n \r\nDe Mare:  Interesting. \r\n \r\nGifford:  That worked out pretty good. \r\n \r\nDe Mare:  And was there, in terms of the, you know, the... \r\nthe way that the labor worked with the management, were \r\nthere any... was there a union involved at the...? \r\n \r\nGifford:  Yes. \r\n \r\nDe Mare:  There was.  Can you talk a... so... so you joined the \r\nunion? \r\n \r\nGifford:  Yeah.  You... you were s’posed to really join it- \r\nand after thirty days- and they told me when I went in \r\nthere, some of the guys, they said, um, “Don’t complain \r\nabout anything. Do whatever they tell you to for thirty \r\ndays.  Don’t complain about a thing.  Be good.  And thirty \r\ndays when you get in union, you’re fine.”  So, thirty days \r\n----------------Page (21) Break----------------\r\nyou’re automatically in the union.  And so they said, “Well \r\nnow that... you gotta go to union meeting to do this, you \r\nknow, you got to join.  You gotta be sure.  You gotta go \r\nthere.  And then you better be careful ‘cause they do funny \r\nthings to you, they make... they might make you get up in \r\nfront and do funny things.  And you might... you might... they \r\nmight... they might do stuff to you.”  So, I was kinda \r\nscared.  I went and... We went and... Abby and I went, and \r\nmade... we... it’s just nothin’.  Nothin’.  It was just a \r\nregular old meeting.  They did that to scare us kids, us \r\ngirls, you know.   \r\nOh, hey, I gotta tell you somethin’ cute, too.  When \r\nyou work at... when you first went there, on your shoes you \r\nknow, and I worked there a few days and I... one morning, I \r\nput on my shoes and my heels were painted.  A red.  And I \r\ndon’t know when anybody did that ‘cause there was a line \r\nbehind me in the malor, and the both of us girls had our \r\nheels painted.  And so when all the girls that were, that \r\nthey could touch, the men painted their heels.  And so we \r\nwore painted heels.   \r\nAnd when I got a get new pair of shoes or... he... ‘cause \r\nthe other ones were worn out, they got soaked with oil, so \r\nI would, uh, went there again. Next morning, mm... I looked, \r\nand my heels were painted.  And I don’t know who did or how \r\n----------------Page (22) Break----------------\r\nthey did it.  ‘Cause they had to reach through there, \r\nthrough... through the opening there to do that.   And why \r\ndid... and both of us girls didn’t know it, you know, how \r\ncome they did that?  We still don’t know.  But you always \r\ngot your heels painted, on the shoes, your back of your \r\nheels were always painted red.  You were Rosie the Riveter, \r\nsee?  You were red. \r\n \r\n00:18:32:12------------------------------------------------ \r\n \r\nKelly:  What kind of shoes were they?  What... what... what \r\nwere... \r\n \r\nGifford:  What? \r\n \r\nKelly:  What kind of shoes were they when they... \r\n \r\nGifford:  I had loafers.  Regular... regular loafers, yeah.  \r\nYou know, and then... and then we’d heel in the back, they... \r\nthey had it all painted right along the... And you... \r\n \r\nDe Mare:  Guess you would, I mean... \r\n \r\n----------------Page (23) Break----------------\r\nGifford:  And if we’d’ve crossed our legs or somethin’, \r\nwe’d’ve gotten it on our... on our uniforms.  But then the \r\nuniforms... we kind of... us girls got... we didn’t want to wear... \r\nso about six months in a... that we wore a... everybody wore \r\nslacks; you could not wear a skirt in the shop.  They had \r\nto wear slacks.  And that’s how come I always wear slacks, \r\njust to remember to wear slacks. \r\n \r\nDe Mare:  I wanna go back for a minute and talk about, uh, \r\nto... that’s really funny.  I wanna go back and talk about \r\nthe, um, the pay and the union and what happened on the \r\nfloor.  So, when you were... when you joined the union, did... \r\nwas it... it was men and... what... do you remember what union it \r\nwas?  What the name of the union was? \r\n \r\nGifford:  C.I.O.  The C.I.O. \r\n \r\nDe Mare:  The C.I.O.  Okay. \r\n \r\nGifford:  Yeah, the C.I.O. \r\n \r\nDe Mare:  And, um, and, uh, was there any issue with the \r\nwomen... the women were expected to join the union just like \r\nthe men. \r\n----------------Page (24) Break----------------\r\n \r\nGifford:  Oh, yeah.   \r\n \r\nDe Mare:  Absolutely. \r\n \r\nGifford:  Mm-hm. \r\n \r\nDe Mare:  And do you remember were the men and the women \r\npaid the same amount of money? \r\n \r\nGifford:  I... \r\n \r\nDe Mare:  Or did you not know? \r\n \r\nGifford:  They were paid the same.  As near as I know.  \r\n“Cause I know some of the men and... and they said, “Well, we \r\nget the same pay you do.  You get the same pay we do.” They \r\nsaid.  So, as near as I know that’s what they told me.  Now \r\nI know... I never see... I never saw their paychecks. \r\n \r\nDe Mare:  Yeah. \r\n \r\n00:19:57:04------------------------------------------------ \r\n \r\n----------------Page (25) Break----------------\r\nDe Mare:  Now, and on the floor, how... what would you say \r\nthe percentage of... of the men and women working was?  You \r\nknow, how many women were working, how many men were \r\nworking on the floor.   \r\n \r\nGifford:  On my... on my floor?   \r\n \r\nDe Mare:  Yeah. \r\n \r\nGifford:  Or in my part? \r\n \r\nDe Mare:  Yeah. \r\n \r\nGifford:  I would say there was a few more men.   \r\n \r\nDe Mare:  A few more men than you. \r\n \r\nGifford:  “Cause they did, uh, there... there was... the women \r\ndidn’t work on the great big motors.  They kept track for \r\n‘em.  I know a couple girls that kept track of things after \r\nthe men told them.  But they never touched the motors, as \r\nnear as I know.  But on a six-cylinder down to four-\r\ncylinders there wa... uh, I used to go over... jump over and \r\nhelp Paul Cook when he’d get behind if we got caught up.  \r\n----------------Page (26) Break----------------\r\nI’d jump over and help him.  He did the same thing with \r\nthe... with the deal taking the rods and putting the cogs in \r\n‘em.  But not very often.  There was no women on that one, \r\nexcept for the inspector was a woman.   \r\n \r\nDe Mare:  Okay. \r\n \r\nGifford:  Grace. \r\n \r\nDe Mare:  And what was the... what was the relationship like \r\nworking with the men?  Was it... \r\n \r\nGifford:  Good. \r\n \r\nDe Mare:  It was good? \r\n \r\nGifford:  Mm.  Yeah, they were good to us.   Only one... \r\nbefore when we first went in there, when Rosie was first \r\nbrought in, in the mornings when you’d walk in there, they \r\nused to holler at you, “Well, there... there comes that one \r\nRosie.”  Or, “There,” you know, “There... there’s another...” \r\nOr if it was a new girl, they’d say, “Oh, we got a new \r\nRosie.”  They would holler out ‘cause we had to walk \r\nthrough the aircraft department, which was all men, to get \r\n----------------Page (27) Break----------------\r\nto our dept... to get to the test house.  So, we... though we... \r\nthey used... used to get hollered... And the first morning I \r\nwent in there, with... I walked with Abby and I walked in \r\nthere and someone said, “Hey, you old chiefie’s and girl \r\nyou,” some men hollered.  And I looked, and it was of the \r\nfarmers in Claybacks that was a friend of my dad’s.  So, \r\nhere I... “Hey, you old chiefie’s and girl,” he said.  So, \r\nthat was another shock.  Got caught right away. \r\n \r\n00:21:40:12------------------------------------------------ \r\n \r\nDe Mare:  What was the attitude of... of, like, your... \r\nObviously your family was supportive of you going, because \r\nthey all came with you. \r\n \r\nGifford:  Oh, yeah. \r\n \r\nDe Mare:  But what was the attitude of... of... towards the \r\nwomen who worked in the factories? \r\n \r\nGifford:  I... I’d say it was good.  They appreciated us.  \r\nThey didn’t fight... One time... and you know I have that poem \r\nout.  I... I’ll have to look and see if I can get it.  One \r\ntime in our... we got a paper out ev... every so often for our \r\n----------------Page (28) Break----------------\r\ndepartment, and some man had wrote it in there about the \r\nwomen workers.  He had writ a poem and it was all about us, \r\nyou know, where they ju... we just come there to flirt with \r\nthe men, and do this and do that.  And, uh... if I think that \r\nI can get it before I left ‘cause I had it out the other \r\nnight but I mighta lost it.  And then one of the \r\ninspectors- a lady inspector from our department- answered \r\nit.  You know, in a... in a rhymed poem, what women were \r\nthere for.  And the sheet is so yellow that you can hardly \r\nread it, but I found it the other night, so.  But I don’t \r\nknow... I hope I didn’t throw it away with that stuff.   \r\n \r\nDe Mare:  We’ll take a look for you because it’d be \r\ninteresting to see it. \r\n \r\nGifford:  (overlapping)  Yeah, you’d be... it’s cute.  Yeah. \r\n \r\nDe Mare:  It’d be interesting to see it.   Did you... did it... \r\ncan you talk a little bit about what it was like to be a \r\nyoung woman at that time and earning your own money and \r\nliving on your own in an apartment.  Can you talk about \r\nwhat that was like for you coming off the farm? \r\n \r\n----------------Page (29) Break----------------\r\nGifford:  Yeah yeah.  It was great.  It was fun.  Because I \r\nuh, joined the bowling league, so we had, uh, I was on a \r\nbowling team.  I liked that.  And, um, we had... once in a \r\nwhile we had parties, uh, like, a half-a-day go to some \r\nhall in Muskeegon and have a part.  Yeah.  And I liked it \r\nand I... ‘cause I moved to Muskeegon.  I was staying with a \r\nlady.  We rented... my sister and I rented a place to stay \r\nwith her ‘cause she... her husband was in the service.  And \r\nwe went to dances on Friday nights and we went out to Finn \r\nLake to another dance on Saturday night.  So.  It was just... \r\nit was just a lot of fun, bowling and all that kind of \r\nstuff. \r\n \r\n00:23:39:11------------------------------------------------ \r\n \r\nDe Mare:  Were there, um, I know that so many of the men \r\nwere overseas... Was there... what was it like to try to, like, \r\nbe dating at that time?  And what was your social life \r\nlike? \r\n \r\nGifford:  Uh, no dating.  No, I didn’t date ‘cause I had a \r\nboyfriend in the service.   \r\n \r\nDe Mare:  Where was he stationed? \r\n----------------Page (30) Break----------------\r\n \r\nGifford:  He was stationed... after he got... in India... no, \r\nfirst he was in Iran.  And then he was in India.  And he \r\nworked on, um, the... he did... didn’t see action and he wasn’t \r\nin battles, but they protected the China/Burma/India route \r\nso that nobody would, uh, come over there and bomb that.  \r\nThey watched that.  And then he drove, um, or he drove a \r\ntruck; lot of trucks.  Went in to town and get supplies and \r\nstuff.  But he was trained to, uh, pick off the injured and \r\nthe dead from the fields.  That’s what his training was; in \r\nthe ambulance.  But when they went to go overseas, their \r\noutfit was left.  Their orders got lost.  So then they got \r\nput in to this other order, so he didn’t have to pick them \r\noff, which he was happy about. \r\n \r\nDe Mare:  (unintelligible) \r\n \r\nGifford:  Yeah.  He...  Yeah.  Yeah. \r\n \r\n00:24:45:07------------------------------------------------ \r\n \r\nDe Mare:  Um, what... did... did working... can you talk a little \r\nbit about, like if... if working in the factory felt... how you \r\nfelt about what you were doing for the war? \r\n----------------Page (31) Break----------------\r\n \r\nGifford:  Yes.  We all felt... that’s really one of the \r\nreasons why I went.  I was feeling that I was helping the \r\nboys.  And we were all- all the girls did- so that, uh, \r\nthey were feeling that they was helping the war effort.  \r\nYou know, by... and they couldn’t get in... the boys were all \r\nbeing drafted, you know, at eighteen years old and they \r\ncouldn’t get workers in the shops and... nobody complained \r\nabout the girl... me working.  I never got any complaints \r\nfrom any bosses.  They were all good to me and... And one \r\ntime one of the bosses said, um, “I saw your name in the \r\npaper, Bonnie.”  And... and I said, uh, “What... what’d I... \r\nWhat’d I do?”  “Well, you won ten dollars in Grand Rapids \r\nat that bowling tournament,” he said.  So I had to go down \r\nto some bowling alley and pick up my ten bucks.   \r\nAnd then that same guy was out at the White Eagle \r\nwhere we were dancing, you know, it was kind of a bar but \r\nthey had a good band there and a singer and everything. \r\nAnd... and so, I was doing the jitterbug with a girl.  And so \r\nthe next Monday I went to work, this Jim- same guy- come up \r\nto me.  He said, “Well, I see we got another jitterbug in \r\nthe fam... in the ‘partment.  He said, ‘cause they had \r\nanother one.  Alice Reener.  And he went, “Boy, she was \r\ngood.”  He said, “Well, we got two jitterbuggers in the \r\n----------------Page (32) Break----------------\r\nfami... in the ‘partment now,” he says, so.  It’s good that \r\nhe was there.  He was there and he saw me.  Uh.  Uh.  That \r\nwas another funny thing.  I got caught. \r\n \r\nDe Mare:  What is your, um, do you have, like a, kind of, \r\ny’know, like your most vivid memory of working there?  Of \r\nsomething that happened in the... in the factory itself?  Do \r\nyou have a memory that you’d like to share? \r\n \r\nGifford:  With working at the shop? \r\n \r\nDe Mare:  Yeah. \r\n \r\nGifford:  Yeah.  You know, I can’t think of any... \r\n \r\nDe Mare:  You don’t have to but I’m just curious.   \r\n \r\nGifford:  Yeah.  I don’t... \r\n \r\nDe Mare:  (overlapping)  ‘Cause I think... \r\n \r\nGifford:  ...think there was anything funny.  Just... \r\n \r\nDe Mare:  Well, I... \r\n----------------Page (33) Break----------------\r\n \r\nGifford:  We just had to work and keep going and keep the \r\nmotors going through and, uh, some of the days we’d put a \r\nhundred and twenty-three or hundred and twenty-four- we \r\ncount... we kept track of how many we put through to see what \r\nwe were doin’.  A motors a day would go down our line.   \r\n \r\n00:26:42:21------------------------------------------------ \r\n \r\nDe Mare:  How many hours a day would you work? \r\n \r\nGifford:  We worked, uh, eight hours a day.  Well, they had \r\nthree shifts goin’.  So I worked the first shift- eight \r\nhours.  And I was thankful I got the first shift right \r\naway.  And, um, so we had to work, uh, eight hours and you \r\ncould work on Saturday cause you could only... the girls \r\ncould only work fifty-four hours a week.  So, on Sunday, if \r\nyou wanted to work on Sunday, which I worked... tried to work \r\nevery other Sunday ‘cause I didn’t want to work every day- \r\nI worked on Saturdays and then on Sundays, we would just \r\nwork six hours to get all our hours in... some... make a little \r\nbit more money.  Uh-huh. \r\n \r\n----------------Page (34) Break----------------\r\nKelly:  What did... what did you do with the money that you \r\nwere earning?  So you were earning more money than you had \r\never earned, really. \r\n \r\nGifford:  I put it in the bank.  So I... when I... my... after \r\nthe war I had... I had about... was... in my bonds, I had about \r\ntwo thousand five hundred dollars.  And I bought my \r\nfurniture for our apartment and I put a thousand dollars on \r\nour house when we built it.  Out of Continental money.   \r\n \r\nDe Mare:  (unintelligible) \r\n \r\nGifford:  And I bought clothes.  I bought a fur coat and \r\nall nice clothes and everything. \r\n \r\nDe Mare:  Um, one of the things when we’ve been talking to \r\nsome of the other women, they talked about the rationing \r\nthat was going on during the war.  Um, can you talk a \r\nlittle bit about that? \r\n \r\nGifford:  Rations?  Yeah. \r\n \r\nDe Mare:  Rations.  Yes. \r\n \r\n----------------Page (35) Break----------------\r\nGifford:  We had to have a... a... we had the regular little \r\ncoupon books.  You had... Sugar was rationed and a lot of \r\ncanned goods.  You couldn’t buy bananas.  They were had to \r\nget.  Pineapple.  All that stuff was hard to get.  And... but \r\nyou could only get so many, um, you had to show your points \r\nwhen you want canned vegetables and canned fruit and stuff. \r\nAnd sugar; it was one of the main ones, yeah.  I... I had \r\nthose little books.  I remember when I lived in Whalen, I \r\nremember walking up the Whitehall School to go get my \r\nlittle books so I could buy vv... food.  That was \r\ninteresting.  And gas was rationed, too. So, but I didn’t \r\nhave a car so I didn’t have a... \r\n \r\n00:28:44:19------------------------------------------------ \r\n \r\nKelly:  Were shoes rationed? \r\n \r\nGifford:  Pardon? \r\n \r\nKelly:  Were shoes rationed?  Rrrr... rrrr... \r\n \r\nGifford:  No, they weren’t rationed, but you had to... we got \r\nthe shoes that didn’t... they were called ‘ration shoes’.  \r\nThey weren’t made... the soles weren’t made as good and the... \r\n----------------Page (36) Break----------------\r\nthe... the leather- no leather.  It was all funny food or \r\nfunny things, you know.  It felt rough... material.  Yeah, I \r\nhad some of those shoes, too.  Yeah, I did.  But the \r\nloafers were pretty good.  If you could... if you really \r\nneeded ‘em, they would give you ‘em for work.  Yeah. \r\n \r\nDe Mare:  Can you... can you show us the picture of yourself \r\nand... and some... and show us the, um, what you used to wear? \r\n \r\nGifford:  Yeah.  Yeah.  This is me.  And it’s a blue... it’s \r\na blue uniform.  And it has a drop seat.  And we had to \r\nwork it... we had to wear ‘em at first.  You had to wear it \r\nor you couldn’t work, if you didn’t get ‘em.  So we had to \r\nbuy ‘em to g... and I bought two pairs at first.  At first I... \r\nI think they were, like, six dollars.  Yeah.  And we had to \r\nwear ‘em.  Yeah, and that’s me, y’know, the whole thing.  \r\nYeah.  We were called ‘Rosie the Riveters’. \r\n \r\n00:29:55:23------------------------------------------------ \r\n \r\nKelly:  And can you tell... \r\n \r\nGifford:  Did you get it? \r\n \r\n----------------Page (37) Break----------------\r\nKelly:  Mm-hm. \r\n \r\nGifford:  Uh-huh. \r\n \r\nKelly:  Can you talk about pa... like, the significance of \r\npants?   \r\n \r\nGifford:  Yes. \r\n \r\nKelly:  Can you talk about that... that... how... how that \r\nhappened and...? \r\n \r\nGifford:  Um, they, um, we had to... we had to unbutton them \r\nin the back to drop ‘em in the back.  And you know you \r\nalways felt, ‘Gosh, what if those buttons slide open, you \r\nknow, when you workin’, you’re go... go like this, you know, \r\nin a way, I... I... if they slide open.’  But they never did.  \r\nYeah.  Oh, that was... they... And they were blue at, uh, \r\nKirsten.  They were blue, you know, for... medium blue.  Mm-\r\nhm.  They’re pretty.  Yeah. \r\n \r\nKelly:  And did they... and so you... you were talking about \r\npants versus skirts. \r\n \r\n----------------Page (38) Break----------------\r\nGifford:  No, I liked the pants better. \r\n \r\nKelly:  But did you have to start with wearing skirts and \r\nthen you switched to pants or was it always... \r\n \r\nGifford:  No, you had to... you had to have it.  You had to \r\nwear pants right... you had to have ‘em.  We had to wait one \r\nday to get ‘em.  ‘Cause, uh, we could’ve gone to work on \r\nSaturday but they said we couldn’t get the uniforms.  So \r\nwhen she... we couldn’t get ‘til Saturday.  So, we went to \r\nwork on a Monday.  \r\n \r\nDe Mare:  But... \r\n \r\nGifford:  But you had to have ‘em.  But nobody wore skirts \r\nin there. \r\n \r\nDe Mare:  And did... but was the... did people... ‘cause people \r\nstill wear... did people still wear skirts, y’know, in their \r\nprivate life?  Did people still wear slacks, you know... \r\n \r\nGifford:  Well, slacks, yeah.  They wore skirts, too, you... \r\ny... a lot of people wore skirts, I mean, if you’re all at \r\none place if you want, but a lot of people wore slacks.  \r\n----------------Page (39) Break----------------\r\nThey... the... that’s how slacks and pants got in to goin’.  I \r\nnnn....  But I always liked slacks before, um, my girl, uh, \r\nmy cousin went to Chicago and she come home with a pair of \r\nnavy blue slacks that had red and white down it.  And I \r\nsaid to mother, “I gotta have a pair... pair like that.”  So \r\nI bought a pair.  And that’s how I... I was wearin’, likin’ \r\n‘em already in ninth and tenth grade.  And I said, “Well, \r\nthat helped.  That helps me wearin’ these slacks, you \r\nknow.”  You’re more comfortable.  You aren’t comfortable \r\nwith a skirt workin’, y’know.  And at... at Whitehall Forum \r\nand the tannery, too, the girls all wore ‘em...  all wore \r\nslacks.  Yeah.  You’re movin’ and stuff, and you can’t \r\nmove... what... wha... what if... if... if it flies, y’know, y’know?  \r\nAnd all of the fans around.  Yeah.  It was fun.  Fun, fun. \r\n \r\n00:31:57:07------------------------------------------------ \r\n \r\nKelly:  How was were you dad, you know, so you had four \r\ngirls... \r\n \r\nGifford:  Yeah. \r\n \r\nKelly:  ...and this farm, and you all... you all went off to \r\nwork and you... you were wearing pants and... was it a big \r\n----------------Page (40) Break----------------\r\ngenerational shift between your parents and... and you girls, \r\nin terms of, you know, did... did your dad support you \r\nworkin’ out in the... \r\n \r\nGifford:  Oh, yeah.  They were happy that we all... we \r\nusually all got out to get... get a job and everything. Now, \r\nthey... they were happy and went along with everything and \r\nvery agreeable.  “Just don’t work too hard,” they said... \r\nsaid.  “Well, no, you don’t work... you work... don’t work too \r\nhard at....” But, we did have to put in a lot of hours, \r\nthough.  But I tried to get it so that I’d get... got one \r\nSunday off every two weeks.  That’s... ‘Cause you gotta have \r\na day off, you know.  You know, you just can’t go all the \r\ntime.  I lost weight, but that was all right.  But, uh, \r\nyeah, that’s... \r\n \r\nDe Mare:  Do you wanna... do you wanna show us your... your, \r\nuh, do you wanna show us these and explain to us what they \r\nare? \r\n \r\nGifford:  I... I’ll... I’ll just show you one. \r\n \r\nDe Mare:  Yeah. \r\n \r\n----------------Page (41) Break----------------\r\nGifford:  Oh.  Yeah, these were the pay stubs from our... \r\nfrom our checks.  I saved... and I saved ‘em all just to be \r\nfunny, and every... my sisters said, “What are you doin’ that \r\nfor?”  I said, “Well, I think it’s funny.  I’m gonna save \r\n‘em all.” \r\n \r\n00:33:16:09------------------------------------------------ \r\n \r\nDe Mare:  What is that? \r\n \r\nKelly:  Oh, here’s the ration... \r\n \r\nDe Mare:  Oh, wow. \r\n \r\nGifford:  Oh, good. \r\n \r\nDe Mare:  You found it. \r\n \r\nUnseen:  (unintelligible) \r\n \r\nGifford:  Yeah.  Yeah.  That’s it.  That’s it.  That’s his, \r\nyeah. \r\n \r\nUnseen: (unintellible) \r\n----------------Page (42) Break----------------\r\n \r\nGifford:  Yeah, that’s what they look like.  Yeah. \r\n \r\nDe Mare:  You wanna hold it up for the camera? \r\n \r\nGifford:  Yeah, yeah, is... \r\n \r\nDe Mare:  Can you open it up? \r\n \r\nGifford:  Yeah.  This is a... the, uh, a war ration book for \r\nfood. \r\n \r\nKelly:  Can you say that one more time?  This is a... this is \r\na war ration... \r\n \r\nGifford:  War ration book, number three, here, it says.  \r\nFor... for food.   Now, that’s what they look like, yeah, uh-\r\nhuh.  Isn’t that funny?  See, and look.  When you... when you \r\nwant something you had to tear off those little nubs and \r\nyou gave it to the store.  Yeah.  Oh, yeah, and you know \r\nanother thing we did?  Um, the men had trouble getting \r\ncigarettes.  And so, us girls, they said they’d pay us to \r\ngo to the store and ask for cig...  cigarettes.  And I’d take \r\n‘em shop so they’d give us a little bit for getting’ them \r\n----------------Page (43) Break----------------\r\ncigarettes.  Some of the men that couldn’t get ‘em, you \r\nknow, couldn’t get enough.  Yeah.  Yeah.   \r\n \r\n00:34:30:02------------------------------------------------ \r\n \r\nGifford:  Yeah, that’s it. \r\n \r\nKelly:  Thank you.  Thank you for that. \r\n \r\nDe Mare:  (unintelligible) \r\n \r\nGifford:  I’ve been savin’ ‘em.  (or: I haven’t seen them.) \r\n \r\nKelly:  Can you show that... can you show your big... your big \r\nthing of all the ones you saved? \r\n \r\nDe Mare:  It’s this... the pile of your... the pile of your pay \r\nstubs. \r\n \r\nKelly:  Yeah, just show that big bundle. \r\n \r\nGifford:  Oh, this is my big pile of pay... my pay stubs.  Is \r\nthat what you call ‘em?  Pay stubs, yeah, pay check stubs, \r\nyeah.  I rolled ‘em all up and saved ‘em.  Just for fun.  \r\n----------------Page (44) Break----------------\r\nAnd they thought.... they thought I was foolish for doing \r\nthat, but I think it’s funny.  Oh, I broke the rubber band, \r\nthis old one. \r\n \r\nDe Mare:  And so can you read us what’s on one of the pay \r\nstubs?  What it says? \r\n \r\nGifford:  Yeah.  It, uh, you got it?  Okay.  It gives the \r\ndate... the pay period ending.  And what is this?  This one \r\nhere’s August the fifth.  And then it gives your actual \r\nhours, which was a hundred and five hours and one fourth.  \r\nI must’ve been late or somethin’.  And then it gives, uh, \r\nmy regular earnings.  Now, you want that, too?  My regular \r\nearnings on this one was sixty-eight fifty-one.  I musta \r\nhad a...  That’s the regular earnings and the bonus earnings \r\nwere ten dollar... uh, no, I got a hundred and four dollars \r\nand seventy-three cents.  So my...  And my overtime earnings \r\nwas twelve-o-three, why, I don’t know.  And my gross pay \r\nwas a hundred and five dollars and seventeen cents for two \r\nweeks.   \r\nAnd they took out social security- a dollar eighty-\r\nfive.  They took out withholding tax- thirty-three dollars \r\nand twenty cents.  They took out for the U.S. bond eighteen \r\nseventy-five.  The hospital or insurance was a dollar \r\n----------------Page (45) Break----------------\r\nforty-five.  And the union was two dollars.  And so my net \r\npay was a hundred and twenty-seven dollars and eighty-two \r\ncents for two weeks.  Not much.  Not now.  But, god, we did \r\na lot with the men, and the groceries weren’t that high, \r\nnow, and everything.  And I... while I was workin’ I... I... \r\nWell, I made sure I bought a fur coat, and I bought a \r\nbedroom suit- outfit- and too... took it out to my parent’s \r\nhome.  So I had a bedroom outfit if I needed one, after the \r\nwar.  And then I saved the rest for furniture or whatever I \r\nwanted to do with it.  So, that was it. \r\n \r\n00:36:48:16------------------------------------------------ \r\n \r\nDe Mare:  Wow.     \r\n \r\nGifford:  Mm-hm \r\n \r\nDe Mare:  Um, what was... do you... do you think that the... I \r\nhave just a few questions about how it... do you think that \r\nworking during the factory really connected to the... the \r\nlarger war effort?  Do you feel like that changed you or \r\naffected you in your later life? \r\n \r\n----------------Page (46) Break----------------\r\nGifford:  Oh, yeah, it changed me.  I was always a little \r\nbit shy, y’know, a little bit.  And I think being out with \r\na bunch of people and getting’ big and goin’ to these \r\nbigger places and bowling- I think it strengthened me to \r\nget out into the world, you know, gave me... Have faith in \r\nyourself, you know, just don’t hold back, you know.   And I \r\nthink that really helped me.  And especially at a war plant \r\nI thought I was doing a good job, you know, and they never \r\ncomplained about my working, so I thought, “Well, I must be \r\nall right.  I’m doin’ good, so I must go ahead, go ahead, \r\ngo ahead.”  Yeah. \r\n \r\nDe Mare:  Do you that it was, I mean, and this is, I don’t \r\nmean to project this but, I mean, do you think that... that \r\nthat was the experience of a lot of women around you? \r\n \r\nGifford:  Oh, yes.  Mm-hm.  A lot of ‘em.  Mm-hm.  Well, \r\nsome of ‘em didn’t stay too long, either.  I don’t know \r\nwhether they didn’t like it or what, I don’t know.  But... \r\nbut not very many.  They all... they stayed... they had girls \r\nin my department.  Nice girls.  Nice women.  And the women \r\nthat worked at... that I went... I was happy I didn’t get that \r\njob- was, um, when these motors were running they had to \r\nset the tappets.  They had to sit on a stool and they had a \r\n----------------Page (47) Break----------------\r\ncouple a different pairs of pliers and those things that... \r\nthings would be jumping up and down there near you.  And I, \r\nI hate... what if... I said, “What if I did...?”  I would’ve quit \r\nthat job, I think.  I just hated to watch them do that.  I \r\nwas so glad that I didn’t have to.  And that I got the job \r\nthat I did.  It was dirty, but that’s okay.  But to get in \r\nthere... and we all... everybody tried to do their part and \r\nthey were all very friendly, you know.  You’d go to the \r\nrestrooms and everything and everybody’s friendly, “How’re \r\nyou doin?”  And this and that, you know.  It just... it just \r\ngave me a lot of push to go to... for myself... \r\n \r\nDe Mare:  Yeah. \r\n \r\nGifford:  ...you know, ‘cause I was always a little bit shy, \r\nyou know, around people.  Not really at a dance, but, I \r\nmean, when I’d come to, like, schools or... or programs or \r\nspeakin’ or something. \r\n \r\n00:38:54:16------------------------------------------------ \r\n \r\nKelly:  Do you remember where you were when you heard that \r\nthe war ended?  Tell her. \r\n \r\n----------------Page (48) Break----------------\r\nGifford:  Oh, where I... where I was when the war ended?  I \r\nwas home.  And I had... I... I... I had quit.  I was home, yeah, \r\nat my mother’s, mm-hm. \r\n \r\nDe Mare: So you quit your job before the war was over? \r\n \r\nGifford:  Yeah, mm-hm. \r\n \r\nDe Mare:  So, can you tell us the story of why you left \r\nthe... why you left? \r\n \r\nGifford:  I was married and had a... Was pregnant for \r\nDarlene.  I hated to leave but I... just the way it was, \r\nyeah.  Yeah.  Oren came home and we had such... \r\n \r\nDe Mare:  Yeah. \r\n \r\nGifford:  I... I should... shoulda known better, but I didn’t.  \r\nI liked my job, though.  I really liked it.  I liked the \r\npeople and everything down there.  And it gave me a great \r\nexperience.   \r\n \r\nDe Mare:  Did you work after that or did you just... \r\n \r\n----------------Page (49) Break----------------\r\nGifford:  No.  I was a stay-at-home mom.  I wasn’t workin’.  \r\nOne of my girlfriends that worked at Hellmann in Whitehall, \r\nuh, she... she was married, too.  She only had one child.  \r\nAnd she said, “Bonnie, come on down.”  She says, “They’re \r\nhiring at-“ uh, uh.  She says, “I’ll get ya’ a job in the \r\ninspection,” she said.  “No,” I said.  “I... I’m not gonna \r\nleave my kids with anybody else.  I wanna be with them.”  \r\nAnd I did.  I stayed with them.  And they all did good.  \r\nThey’re all doin’ better than I am.  Darlene and Gene and \r\nBonnie-Lynn.  Yeah. \r\n \r\n00:40:18:19------------------------------------------------ \r\n \r\nDe Mare:  Do you think that going out into the world the \r\nway you did, um, informed how you raised your own \r\ndaughters?  Do you feel like you had more of a sense of \r\nthe... of independence and wanting to instill that in them?  \r\nCan you talk about what it was like to be the mother of \r\nyoung women?  \r\n \r\nGifford:  It... no... it... I... it didn’t seem to bother me.  I \r\ndon’t know, they probably complained about a lot of things, \r\nmy kids, but I don’t... They’re all doin’ good and they... \r\ndoin’... they’re doin’ great and... and they didn’t seem... have \r\n----------------Page (50) Break----------------\r\nany... If they had any complaints they didn’t tell me about \r\nit, so.  Maybe they will yet before I die.  I’ll get \r\nDarlene started on it.  “What’d I do wrong, Darlene?” I’ll \r\nask her. \r\n \r\nKelly:  Yeah, I don’t think it’s... I don’t think it’s about \r\ncomplaint.  It’s... it’s more that, you know, I think about \r\nMom raising two daughters, like you raised two daughters... \r\n \r\nGifford:  Yeah. \r\n \r\nKelly:  ...and... and, like, we’ll... the experience of being \r\nRosie for you, in kind of being independent and then doing \r\nthis... Did that... did you have any lessons from that that you \r\nwanted to teach your own daughters? \r\n \r\nGifford:  Oh. \r\n \r\nDe Mare:  Yeah. \r\n \r\nGifford:  No, not really, I, uh, just, wh... Everybody’s \r\ndifferent, you know?  Darlene was different and Bonnie-Lynn \r\nwas different.  They aren’t... they weren’t alike, you know, \r\nthey’re all different.  You have kids, they’re all \r\n----------------Page (51) Break----------------\r\ndifferent.  Uh, Jay-D was... they’re all different.  And you \r\nhave to do it all over again, you know.  You have to go \r\nright... right along with, uh, what they’re doin’ and acting \r\nlike and....  But they never caused too many problems.  Gene... \r\nGene used to give us a few headaches, but not bad.  And he \r\nnever got caught in the law.  And Darlene was good.  Yeah, \r\nshe was always... they were always on home on time and they \r\nwent on dates and, I don’t know.  No big problems. \r\n \r\n00:41:58:14------------------------------------------------ \r\n \r\nDe Mare:  When you think back to yourself at that time when \r\nyou were working, when you think of yourself as a young \r\nwoman- how old were you when you started working?  Do you \r\nremember? \r\n \r\nGifford:  When I started workin’?  In forty-three?  I was \r\nborn in twenty-two; I must’ve been twenty-one when I \r\nstarted.  Workin’ at the... at the shop.  At the Continental.  \r\nI worked before at Whitehall, I worked at the summer camp \r\nat Stony Lakes, uh, for two or three summers.  They always... \r\nthat lady from Missour... Missouri always called me and let... \r\nor sent me a letter to... if I could come back and work with \r\nher.  So then I finally had to write back and say, “No, I’m \r\n----------------Page (52) Break----------------\r\nworkin’ in Whitehall, I can’t come.”  So then she got \r\nsomebody to take my place.  She was a nice lady.  Her \r\nhusband run the Camp Winnemonka at Stony Lake, Orwig’s.  \r\nAnd when you go to Lake Michigan, Kirsten, there’s a house \r\non the right hand side there with a barn and stuff? \r\n \r\nKelly:  Mm-hm. \r\n \r\nGifford:  That was Mrs. Orwig’s girl camp.  She had about \r\ntwenty little girls there.  From ages from about eight to \r\ntwelve or so.  And we worked in the... My cousin and I worked \r\nthere.  Summer. \r\n \r\nKelly:  What... What did you do?  What was the girl’s camp?  \r\nWhat would they do? \r\n \r\nGifford:  Well, they, um, they had little... they had little \r\nlessons.  Everyday they had les... and they all sang.  And \r\nthey had singing groups.  And they do... they did little \r\nsports.  They played ball and all kinds of that stuff. And \r\num, we had to, um, clean their rooms.  And some of ‘em \r\nslept upstairs in the barn, and some slept in a corncrib, \r\nand some slept in the house.  And they had a fireplace \r\nthere.  They always had a meeting in the morning and they \r\n----------------Page (53) Break----------------\r\ndid singing and did different things for the kids to do.  \r\nGames.  And they... and then they’d go out and we’d have to \r\npack sandwiches for them and they’d go out in the woods and \r\neat out in the woods and have a fireplace and sing and \r\ndance and play.  And, you know, it was just: entertain the \r\ngirls.  It...  And each counselor had so many girls to look \r\nafter.  Nice counselors, too.  From Missouri and all over.  \r\nNice counselors. \r\n \r\n00:43:55:02------------------------------------------------ \r\n \r\nKelly:  Do you remember at the time that you were a Rosie, \r\ndo you remember what the media was like?  What the, you \r\nknow, were there commercials or posters or...? \r\n \r\nGifford:  I don’t think there was any commercials or \r\nposters or anything about it.  It seems like it was just \r\nautomatically... It started in, as I remember, in Detroit \r\nwhen the big... when they were working on those big bombers.  \r\nAnd that’s as... as how I remember it; the startin’ and \r\neverything.  And it just kinda went wherever the defense \r\nfact... factories were. But, it... I... you didn’t think anything \r\nabout it. You just, you just went to work, and you did it, \r\nand it’s what you had to put up with and that’s what we \r\n----------------Page (54) Break----------------\r\ndid.  Just put up with it and... When somebody might holler \r\nat ya’ in the morning once in a while: “Hi there, Rosie.  \r\nHow’re ya’ doin’ today?”  You might hear that when you walk \r\nthrough aircraft but that kind of wore off.  Then they qui... \r\nthen they kind of quit it after about six months. \r\n \r\nDe Mare:  How do you think it changed or do you think it \r\nchanged the way that, uh, the way that women were treated \r\nin the work force, or basically were seen in general?  \r\nBecause it really was this coming out, of this huge number \r\nof women who hadn’t left the home.  Can you talk a little \r\nbit about what you experienced or what you saw around you? \r\n \r\nGifford:  I... I, um, there was a couple of elderly women \r\nthat set those tappets, you know, I said... that I told you \r\nabout?  And I... I talk... talked to them... and one was from \r\nKansas City, and she was elderly, she was about forty-five \r\nyears old and I just, How come they hired her?  But, uh, \r\nshe was nice and I talked to her and I, uh, I talked with \r\nher as an elderly woman.  And, uh, I was surprised she was \r\nthere but she... she said she just wanted to get out and help \r\nthe boys, you know, and just....  Everybody was gonna help \r\nsomebody.  And that’s some and it did... didn’t bother me \r\nwith other people there.   \r\n----------------Page (55) Break----------------\r\nIt just... everything just... everybody worked together.  \r\nYou talked about the bowling.  You talked about eating \r\nlunch or going out to lunch or... or dinner.  We used to \r\nhurry up and run to that one restaurant and eat in a half \r\nhour.  We’d hurry up and walk.  We had to walk quite aways.  \r\nAnd they... when you entered that... that restaurant they sat \r\ndown and that... the woman was right there.  She was just \r\nrunnin’.  They had the dishes all this... perch or whatever \r\nthey...  They had two menus and you picked which one you \r\nwanted and they run back there and get it and set it there \r\nand boy you ate and paid and out you went.  For forty-five \r\ncents.  And if you had ice cream ‘cause sometimes we’d \r\norder... quick order ice cream or pie a la mode, then it was \r\ntwelve cents extra. So that was a real, fifty cen... cents or \r\nsomething.  Now, that’s pretty cheap.  So then you had your \r\nmeal, your hot meal for the day, you know, you really \r\ndidn’t have to cook that much at night. \r\n \r\n00:46:39:12------------------------------------------------ \r\n \r\nDe Mare:  Did a lot of people travel to the area?  I know \r\nyou said people came up from Arkansas to work there, so \r\nwere there a lot of people that traveled from a great \r\ndistance to work in the factories? \r\n----------------Page (56) Break----------------\r\n \r\nGifford:  I... well... Ludington.  Some of the men and girls \r\ncame from there.  Couple women who... they rode in a station \r\nwagon, they come there.  I think it was six.  Six of them.  \r\nI know they were from Luddy.  And Kent City, and Grand \r\nGeva, Spring Lake, and Montague and Whitehall and Shelby \r\nand Hart.  You know, a lot of them working... \r\n \r\nDe Mare:  And... \r\n \r\nGifford:  ...way far away. \r\n \r\nDe Mare:  And you, uh, you rented a room, you said, in the \r\nhouse of someone who’s husband was away at the service.  \r\nDid a lot of people like how did people live?  I mean, did \r\na lot of people rent rooms and rent rooms out?  \r\n \r\nGifford:  Yeah. \r\n \r\nDe Mare:  They did. \r\n \r\nGifford:  They did. \r\n \r\n----------------Page (57) Break----------------\r\nDe Mare:  Obviously that doesn’t really happen so much \r\nanymore, you know, we don’t really operate that way. \r\n \r\nGifford:  Mm-mm. \r\n \r\nDe Mare:  Do you remember what you paid for rent? \r\n \r\nGifford:  Yeah.  When... when I lived in Whitehall, me... I was \r\nworkin’ at the... at the Forum, I paid three and a half.  For \r\na room and a little kitchen, but I had to go downstairs to \r\nthe bathroom, through... through their kitchen.  That was in \r\nWhitehall.  And then when we... then Billy... Billy and I \r\nstayed there for a while.  And then when she moved in they \r\ncharged us six dollars a week.  And it was kind of nice; \r\nthey had... had carpeting in, and the kitchen, we had a table \r\nand kerosene stove.  We had to buy our own kerosene.  And \r\nwe got our heat and our water and it... it was nice.  \r\nAnd then we moved to Muskeegon.  We went to stay with \r\na girl that... she had her ad in the paper.  She wanted \r\nboarders ‘cause her husband was in the service.  And, um, \r\nher name was Helen Mier.  And she had a little girl.  Rudy.  \r\nAnd we stayed there for a while and then she wanted to go \r\nto work, too.  So then she went and got a job at Seal \r\n----------------Page (58) Break----------------\r\nPower, so then we had to get an apartment.  So we went... \r\nwent and got an apartment. \r\n \r\n00:48:32:00------------------------------------------------ \r\n \r\nGifford:  (con’t)  Yeah, it was nice in Muskeegon.   And \r\nthen we stayed in Muskegon three apartments a... and on... on \r\na... street.  Uh, Williams street, Wesley street... aah- what \r\nwas the other one?  Stan, help me.  They all began with W.  \r\nGod I forgot the other one.  Ah.  Williams.  Wesley, \r\nWilliams, Stan, what was the name of that street?  It was \r\nnear his house.  If I looked out my bedroom window I could \r\nsee his backyard.  But I didn’t know... didn’t know him, you \r\nknow.   \r\n \r\nUnseen:  It was called ‘Windsor’.  Windsor. \r\n \r\nGifford:  Yeah, Windsor.  Win... Windsor.  There ya’ are.  \r\nThey all began with W.  Yeah.  Seven, uh, seven six nine, \r\neight six one, and eight four one were the numbers of the \r\nthree places that I stayed at. \r\n \r\nKelly:  You have an incredible memory. \r\n \r\n----------------Page (59) Break----------------\r\nDe Mare:  You really do.  You really do. \r\n \r\nGifford:  I, eh... \r\n \r\nKelly:  Do you want a little glass of water or something?  \r\nAre you getting... \r\n \r\nGifford:  It’s pretty dry.  Why, aren’t you done yet? \r\n \r\nKelly:  No... no... Close. \r\n \r\nDe Mare:  Just a... Just a couple more questions. \r\n \r\nGifford:  Yeah, I’ll be all right.  Yeah. \r\n \r\nDe Mare:  Okay. \r\n \r\nKelly:  Are you okay?  Okay.  (unintelligible) \r\n \r\nDe Mare:  Okay, um, were... do you think that you learned to \r\ndo things at that time that you learned skills whether they \r\nwere actual physical skills or... or life skills that were \r\nhelpful to you in the rest of your life? \r\n \r\n----------------Page (60) Break----------------\r\n00:49:48:16------------------------------------------------ \r\n \r\nGifford:  Oh, yeah. \r\n \r\nDe Mare:  And can you talk to me about that a little bit? \r\n \r\nGifford:  Well, I was gonna say, your, you know, I, um, \r\nwanted to go to business college when I graduated from high \r\nschool.  Eh, because I was liked bookkeeping and typing and \r\nall that stuff.  I wanted to do that, but my parents didn’t \r\nhave the money so that I had to pick up what I could.  And \r\nso I thought then when I got over and got a job I’d go back \r\nto school, but I never did that.  I got interested in other \r\nthings.  Bowling and friends and all that kind of stuff.  \r\nGoing and going, movies and... you... you lost interest.  Then \r\nthat was the end of it.  That was the end of it.  Yeah. \r\nBut I, I think it really helped me to get out.  Like I \r\ntold you before it gave me a little push that I’m not... I... \r\nI’m good enough to go further, you know.  So it gave me a \r\nlittle push.  It helped me a lot, being... working with a \r\nbunch at the shop.  That I was... felt like I was doin’ \r\nsomethin’, and just built up a little more morale. \r\n \r\n----------------Page (61) Break----------------\r\nKelly:  I’m sorry, one... one of the things that we started \r\nseeing as... as we interview all these Roses is: we started \r\nunderstanding that a lot of the changes for women, in \r\nwomen’s rights and things of the, like, sixties and \r\nseventies... \r\n \r\nGifford:  Mm-hm \r\n \r\nKelly:  ...like that couldn’t’ve really happened without so \r\nmany women going to work as Rosies.   \r\n \r\nGifford:  Mm-hm.  Yeah. \r\n \r\nKelly:  Cc... can you talk... what was that time like when \r\nlater in the sixties and seventies where... \r\n \r\n00:51:17:07------------------------------------------------ \r\n \r\nGifford:  Yeah.  Well, I think, um, a lot of women, like I \r\nsay, didn’t really have the push... some... there were some \r\npush... pushy women, you know, there were some... some are \r\njust: go.  But I think it helped a lotta ww... women.  I know \r\na lot of the girl... the two girls that have died now that on \r\nmy... on my, uh, that worked on my line... she... she was always \r\n----------------Page (62) Break----------------\r\nholding back, too.  And she got where she was just \r\nexpanding, you know, and just let... let loose, you know, \r\nlettin’ out, you know, just how to go.  Yeah.  And I... I \r\nthink... I know this on her, she... maybe she knows this on me, \r\ntoo, I don’t know... But I think it just... it did... you’re just \r\nas good as the men are, you know, you’re just as good.  \r\nBefore you’re a... you always felt the men were better than \r\nyou, or bigger than you, or something.  You... way back, you \r\nknow, men always had, when women couldn’t vote, you know, \r\nyou always thought, “Well, maybe we’re a little bit under \r\nthe men,” you know?  But it gave you the idea that you were \r\njust as good as they are.  And that’s it.  You’re just as \r\ngood as you were.  And you worked right along with \r\neverybody and if I could... that one man complained, ‘cause \r\nhe wrote a poem, if I can... If I can find it real quick like \r\nI’ll show it to ya’. \r\n \r\nDe Mare:  But I jus... there’s just really one or two more \r\nthings.  I mean... \r\n \r\nGifford:  Okay. \r\n \r\nDe Mare:  ...and then we can look for those other... \r\n \r\n----------------Page (63) Break----------------\r\nGifford:  Okay. \r\n \r\nDe Mare:  When you think back to that time, when you think \r\nback to that young woman who was twenty-one years old, and \r\nwas there any advice, like, now looking back with your \r\nwhole life, is there anything you’d like to say to her? \r\n \r\nGifford:  To a woman? \r\n \r\nDe Mare:  To you.  To yourself. \r\n \r\nGifford:  To... to myself.    \r\n \r\nDe Mare:  Yeah... \r\n \r\nKelly:  (overlapping) Back at that time... \r\n \r\nDe Mare:  (overlapping) ...what would you say? \r\n \r\nGifford:  (overlapping) Yeah, back at... \r\n \r\nKelly:  ...when you were a Rosie. \r\n \r\nGifford:  Okay. \r\n----------------Page (64) Break----------------\r\n \r\nDe Mare:  Yeah. \r\n \r\nGifford:  Well, I would say that, uh, I did pretty good, \r\nand I... I told myself, I did tell myself, you gotta save \r\nmoney.  You can’t spend all your check, you know, like a \r\nlot... lot of them are doing?  And just spend it and spend it \r\nand spend it.  Nah.  And I made my mind... I... I saved money \r\nevery paycheck.  That’s was one of my goals.  I’m gonna \r\nsave money so if a... this war ever gets over, I got \r\nsomethin’.  A little bit, you know.   \r\nAnd... Then I supported myself and I bought a lot of \r\nclothes I told you about.  Fur coat- it was two, three \r\nhundred dollars.  And bought lots of nice clothes and \r\npurses and makeup and I had, um, thirty-four sweaters after \r\nthe war.  And I had twenty-seven brassieres, after the war.  \r\nOh, that’s not goin’ down there?  Don’t you put that towel \r\ndown there. \r\n \r\n00:53:42:11------------------------------------------------ \r\n \r\nGifford:  (con’t)  Well, you know you could buy a sweater \r\nfor a dollar ninety-eight and one time I was... I was \r\ndowntown there at Newton and I saw this one shop, I think \r\n----------------Page (65) Break----------------\r\nit was at Beverly’s, as a sweater that kinda long hair and \r\nit was a dollar ninety-eight so I took it.  And I had to... \r\nto get back at the shop.  I had to leave it in where the \r\nguard was; I couldn’t take it in the shop.  Can’t take \r\nanything in there.   \r\nSo, then my... when I went home I showed it... I picked it \r\nup, I showed it to Helen Mier, the girl who was... well, she \r\nsaid, “I want one like that.  I want a yellow one.  Will \r\nyou... will you go pick me up one around noon?”  So, I had \r\nto... to next noon... I had to go way down there and get her a \r\nyellow one so she could have one like that sweater.  Mine \r\nwas blue.  So that was... just some of the things you do... \r\ncrazy.  \r\n \r\nKelly:  (unintelligible) \r\n \r\nDe Mare:  Can you talk a... can you just talk a little bit \r\nabout how you felt about the war itself?  Um, it was such a \r\nhuge event, um, and I think that something that it’s... it’s \r\nhard for people now to understand how much it was part of \r\neveryday life for people. \r\n \r\nGifford:  Mm-hm \r\n \r\n----------------Page (66) Break----------------\r\nDe Mare:  ‘Cause now w... our wars are not part of our  \r\neveryday life.  Can you talk a little bit about that? \r\n \r\nGifford:  Yeah.  Well, on a Sunday, when the war... December, \r\nwhen we were bombed, and when I heard President Roosevelt \r\non the radio say, “We’re at war.  We’re at war,” he says.  \r\n“We’re gonna do it.”  And you know, I shook.  I shook and I \r\nwas just shaky all over, ‘cause I, you know, war, you know, \r\nI never... I was only... what was I?  About eight... eighteen, \r\nnineteen years old, or was something.  Kinda young.  And I... \r\nI shook.  I remember just shakin’ terrible, when they de... \r\nin the... in the house there and whenever, for a while there. \r\nAnd then my dad got to talkin’ bout little bit, you \r\nknow, and he kinda soothed everything down.  It really, and \r\nthey did it, and “We’ll... We’ll win.  We’ll win,” he said.  \r\n“Don’t worry about it.  We’ll win.”  And so, we did.  So.  \r\nBut I re... I still to this day, when I think... you think of \r\nthat, how I... I shook, shook, shook like this.  ‘Cause I \r\nthought war was killing and, you know, what are they going \r\nto do to us?  Are they going to bomb us even more and what \r\nare we gonna...?  I might die and all that kind of stuff \r\nyou’re thinkin’.  But, I got over it.   \r\n \r\n00:55:57:04------------------------------------------------ \r\n----------------Page (67) Break----------------\r\n \r\nDe Mare:  It was a very immediate feeling. \r\n \r\nGifford:  It was very... it was very sss... it was a very sad \r\nday at our house.  We were... we were at home when we heard.  \r\nVery sad day.  And how they bombed and killed all the \r\npeople at Pearl Harbor, you know, that... that was so sad, \r\nvery sad.  I know I... I didn’t like it a bit.  But you kind \r\nof learn to get... you had to learn... my dad... Dad kind of \r\nsmoothed it over and talked to us.  Up, my mother, too.  \r\n \r\nDe Mare:  And then what was it like to have your boyfriend \r\nat the time overseas? \r\n \r\nGifford:  Just there.  I... I went out dancin’.  I... I... he \r\nknows I like to dance, mmmm, Oren was not a good dancer.  \r\nAnd he... he didn’t care.  He said, “You.”  I said, “Can’t \r\nyou tell the beat?” He says, “It’s all a bunch of noise to \r\nme.  Just a bunch of noise,” he said.  And I thought, ‘Oh, \r\nheck.  I’m... I... I... he know I liked to dance and I’d been \r\ndancin’ for year.  And, uh, so, I said, “I’m goin’ to \r\ndances.  I don’t care.”  And I did.  We all went and he \r\nstill went when my mom and dad went, we went.  And then \r\nwhen I got a lot older we went and Billy and... Billy knew, \r\n----------------Page (68) Break----------------\r\nand I usually went with some girls and... we had to dance, \r\n‘cause, uh, this is it, you have to dance. Square dance or \r\nround dance and Shoddish or whatever they’re doing.  I \r\nremember doing the Shoddish- the German Shoddish at my \r\ngrandpa down at Stony Lake.  I was about five, six years \r\nold.  You know how the Germ... I don’t know if you’ve ever \r\nseen it. \r\n \r\nDe Mare:  I don’t think I have. \r\n \r\nGifford:  You’ve seen it, haven’t ya’, Kir?  Yeah.  It’s a \r\ncute little dance.  I remember doin’ that.  My Grandpa \r\nHoltz.  Uh-huh.  That way I just had to go.  Uh, he got... he \r\nnever... he knew... he knew I went. \r\n \r\nKelly:  How do you think it’s different now with the war, \r\nlike what times are like, what... how is it different then to \r\nnow when you’re... there’s a war now and... \r\n \r\nGifford:  I know it. \r\n \r\nKelly:  ...and you all think about it?   \r\n \r\n----------------Page (69) Break----------------\r\nGifford:  I don’t like it.  I don’t like it.  I just... I \r\nhate it.  I just hate war.  I just don’t like it.  And I \r\nthink it’s stupid, you know, and I... but we won the war, you \r\nknow, in so many years, and they aren’t winning.  Or they \r\ndon’t... well, they might be winning some of it but, uh, you \r\nknow, we’re still in it, you know.  Why are we in it so \r\nlong?  I just don’t understand that.  I don’t like that \r\npart of it.  But, I’m not supposed to talk about war, so. \r\n \r\n00:58:13:09------------------------------------------------ \r\n \r\nDe Mare:  Why not? \r\n \r\nGifford:  Your hus... your... your dad was in it.  Stan was in \r\nit.  He went... he had a tough time over there.  That’s why \r\nhe walks with a... a... his legs are all numb from the Brown \r\nRot and all that kind of stuff; malaria, rabies.  \r\nOtherwise, he’s all right but his... his legs... has to walk \r\nwith a walker.  But he’d been through hell. \r\n \r\n00:58:36:16------------------------------------------------ \r\n \r\nGifford:  Uh, Can I give my maiden name?  \r\n \r\n----------------Page (70) Break----------------\r\nDe Mare:  Sure, you can give it... \r\n \r\nKelly:  (overlapping) Yeah.  You... \r\n \r\nGifford:  Oh, okay, you can hear it.  I... I was Bonnie \r\nTithiessen and I married Oren Gifford.  Yeah.  And what  \r\nwas I supposed to all tell ya’? \r\n \r\nDe Mare:  You were supposed to tell me where... what you did \r\nduring World War II. \r\n \r\nGifford:  Oh, World War II.  I went to the fact... well, went \r\nto the Continental and worked there, in the, uh, in the \r\ntest house, for two, ‘bout two and a half years, then I \r\nquit. (Unintelligible) Yeah, it was nice.  It was nice.  It \r\nwas a gre... great experience for me.  It gave me a lot of \r\npush, you know?  You’re... you’re all right.  You’re okay.  \r\nSo that’s... that’s the feeling I got.   \r\nAnd I liked it there.  I got... liked the girls.  We got \r\nalong good.  And liked the bowling and the parties and \r\ngoin’ out with all the girls.  Yeah, I had more fun when I \r\nwent with girls at a dance.  I wouldn’t go with a guy, \r\n‘cause, uh, I didn’t want... he... If you go with a... a date, \r\n----------------Page (71) Break----------------\r\nthen they wouldn’t ask... no... nobody else would ask you to \r\ndance.  But I danced with everybody.   \r\nThe men... boys would all come up.  I used to have at \r\nStony Lake three or four dances promised ahead of time to \r\nsomebody, y’know, you’d promise this guy, promise that guy.  \r\nThen he’d remember them, too.  They all remembered them.  \r\nAnd you get to dance with all the good dancers, ‘specially \r\none with (unintelligible); boy, was he ever a good dancer.  \r\nI liked that.  So, I... I just liked to go.  ‘Cause I wasn’t \r\ngonna stay at home and sit and mope in a room while my \r\nboyfriend and he didn’t ask me to go, so, he didn’t care.  \r\n“You go ahead.”  He was goin’ out.  Did things- \r\nshouldn’t’ve done.  But that’s how it goes.  That’s how it \r\ngoes. \r\n \r\nDe Mare:  That’s wonderful. \r\n \r\nGifford:  She knows. \r\n \r\nDe Mare:  (overlapping) Let’s go see if you can find that, \r\nuh, find that... find the poem and stuff... \r\n \r\nKelly:  (overlapping) Yeah, let’s see if we can find it and \r\nsome... \r\n----------------Page (72) Break----------------\r\n \r\n01:00:19:21------------------------------------------------ \r\n \r\nDe Mare:  ...we have the, what the...  \r\n \r\nGifford:  Can... can you read all that? \r\n \r\nDe Mare:  I think I can read it. \r\n \r\nGifford:  With the... yeah... \r\n \r\nDe Mare:  Yeah. \r\n \r\nGifford:  Yeah.  And thi... thi... one... the one is a boy’s and \r\nthen the girl answers it.   \r\n \r\n001:00:28:04----------------------------------------------- \r\n \r\nGifford:  And she’ll read it; I’ll just sit here.  ‘Cause \r\nI... \r\n \r\nDe Mare:  Yeah. \r\n \r\nGifford:  ...I... I can’t read it fast enough for that.   \r\n----------------Page (73) Break----------------\r\n \r\nDe Mare:  That’s all right. \r\n \r\nGifford:  It’s too little. \r\n \r\nDe Mare:  Okay.  So this is... this is the poem that one of \r\nthe... the men... men workers wrote... \r\n \r\nGifford:  It’d be... yeah... \r\n \r\nDe Mare:  ...about... and then there’s a... the answer is the \r\npoem that the woman wrote back. \r\n \r\nGifford:  Yes. \r\n \r\nDe Mare:  And this is... The paper is dated Thursday, \r\nDecember 30th, 1943, Continental Motors, Local 113 UAWCIF. \r\n \r\nGifford:  Uh-huh. \r\n \r\nDe Mare:  Poem number one:   \r\nHow I would like to get up in the evening,  \r\nAfter the sun has stopped it’s shining, \r\nAnd meander to the shop I work in, \r\n----------------Page (74) Break----------------\r\nAnd find the dames had stopped their whining.   \r\nIf you ask me the truth, and believe me,  \r\nI have failed to see one yet \r\nThat was worth her weight in baloney,   \r\nBlond, redhead, or brunette.  \r\nI like to look at the bumps in her sweater \r\nOn the blond with the empty dome, \r\nBut I prefer to have mine in an apron \r\nWho’s brave enough to stay home.   \r\nThere’s many a... a glandless old monkey \r\nThat’s already blown his top, \r\nBecause he got a smile from blondie, \r\nThat dizzy dame in the shop.   \r\nShe expects her rest period in the morning, \r\nAnd two or three in the afternoon,  \r\nAnd will ask the boss tomorrow for a layoff,  \r\nTo go see her hubby soon.   \r\nAnd... and many’s the boss that’s gone goo-goo, \r\nOver dames that don’t wear skirts,  \r\nAnd forsaken his dear old mama,  \r\nThe one that irons his shirts.   \r\nSo listen, old pal, and heed me,  \r\nIf you have any brains and guts,  \r\nJust forget the mole in inspection,  \r\n----------------Page (75) Break----------------\r\nFor she’s after your money and just plain nuts.   \r\n \r\nGifford:  That’s it.  That’s it. \r\n \r\n01:02:01:09------------------------------------------------ \r\n \r\nDe Mare:  And how... how did you feel when you read that the \r\nfirst time?  Wow.  Okay, and the answer was written by one \r\nof the women workers. \r\n \r\nThe women’s place is in the home \r\nOn that we all agree. \r\nAnd were conditions different \r\nThat’s where most of us would be. \r\nIt seems that there’s a... a certain war \r\nThat’s taken most our men \r\nAnd we’re just filling in their jobs  \r\n‘Til they come home again  \r\nWe’re not here just to show our forms \r\nOur clothes, our curls, our faces, \r\nWe’re here to do what should be done \r\nAnd still know where our place is. \r\nWe may all kid and joke a lot \r\nTo make a brighter day \r\n----------------Page (76) Break----------------\r\nBut underneath we’re pining for \r\nOur husbands far away. \r\nThey’re giving everything they’ve got \r\nThey’re sacrificing all \r\nAnd if you’ve heard of army slang \r\nThey’re really on the ball. \r\nAnd while they fight for freedom, \r\nThere’s money we must earn, \r\nAnd if you think we’re liking this, \r\nBoy, you’ve a lot to learn. \r\nAs for asking for time off \r\nWhen hubby’s furlough’s here, \r\nRemember you’re at home each day \r\nWith those that you hold dear. \r\nAnd if you’re a sing... If you are a single man, \r\nThere’s something mighty wrong; \r\nYou must belong to the 4F class; \r\nYou’re hanging around too long. \r\nI’ve noticed that there’s seamen \r\nWhen working are no whiz, \r\nBut if you think you’re hurt, boys, \r\nJoin up and see what work is. \r\nI’ve heard the country’s wanting \r\nMore womens in the plants, \r\n----------------Page (77) Break----------------\r\nAnd don’t forget we’re women \r\nEven if we do wear pants. \r\nWhere is this inspection \r\nYou have to write about? \r\nIf something new has been added, \r\nWe’re anxious to find out. \r\nYou can’t be so ambitious- \r\nTo hear and see so much, \r\nTo know just what we do and wear \r\nAnd how we whine and such. \r\nYou might have written to that- no, wait a minute- \r\nYou might have written that to get \r\nA good old laugh or two, \r\nAnd I’m not kidding, brother, \r\nThe laugh is all on you. \r\nThere’s one thing that sure bothers me, \r\nAnd I think it’s just a shame, \r\nA fellow who can write so well, \r\nWill not sign his name. \r\n \r\n01:03:52:21------------------------------------------------ \r\n \r\nGifford:  She signed her name, didn’t she? \r\n \r\n----------------Page (78) Break----------------\r\nDe Mare:  Uh, I don’t see it here.  Um:  \r\nThis may not touch your feelings, \r\nI’m sure that it won’t, \r\nBut we work for our money, \r\nEven if you think we don’t. \r\nI hope the guy that started me \r\nTo write this little stuff, \r\nWill let all this soak in \r\nAnd tell me if he’s had enough. \r\nThat’s... \r\n \r\nGifford:  I know the girl... I know the woman that wrote \r\nthat; she was an inspector.  I knew her. \r\n \r\nDe Mare:  Wow. \r\n \r\nGifford:  Her name’s Adia. \r\n \r\nDe Mare:  That’s kind of amazing.  I’m gonna read the \r\nlittle thing that happened, the way that these two things \r\nwere introduced in the paper.  It says, ‘Department 49 \r\nMotor Test.  Christmas has come and gone, and we wonder now \r\nif everyone will settle down to the business of winning the \r\nwar.  It seems as though a lot of employees thought that \r\n----------------Page (79) Break----------------\r\nthe war was over last week, as eighty-eight men and women \r\nwere absent from Department 49.  Perhaps they were all \r\nsick- what do you think?  We think that most of them were \r\ngiving Hitler and the Japs a break.  Well, now that’s off \r\nmy chest.’  Do you recall what that’s about? \r\n \r\nGifford:  No. \r\n \r\nDe Mare:  No. \r\n \r\nGifford:  It was... the... evidently, I didn’t know there was \r\nthat many missing... \r\n \r\nDe Mare:  Yeah.   \r\n \r\nGifford:  ...from work.  But in... in a week, was that in a \r\nweek? \r\n \r\nDe Mare:   Yeah, it was a week, that’s what it said.   \r\n \r\nGifford:  In a week? \r\n \r\nDe Mare:  But it’s then... then it goes on to say, ‘Last week \r\none of the night men thought he would tell the women where \r\n----------------Page (80) Break----------------\r\nto head it at with a piece of poetry.  It was placed on the \r\nbulletin board.  We are now sending it in along with the \r\nanswer that one of the women wrote.  We feel that it \r\nanswers the fellow and we hope that this settles the \r\nmatter.’ \r\n \r\nGifford:  Yeah. \r\n \r\nDe Mare:  That’s really... that’s really nifty. \r\n \r\nGifford:  (overlapping) (unintelligible) \r\n \r\nDe Mare:  That’s really nifty. \r\n \r\nGifford:  I... I should get a copy of that ‘cause it’s \r\ngetting yellow.  I wonder if, uh, Mark could do it on the \r\ncopy machine? \r\n \r\nDe Mare:  Oh, yeah. \r\n \r\nGifford:  He does a lot of stuff... \r\n \r\nDe Mare:  Oh, yeah. \r\n \r\n----------------Page (81) Break----------------\r\nGifford: ...my son, yeah. \r\n \r\nDe Mare:  Oh, yeah. \r\n \r\nGifford:  Yeah, ‘cause it... that’s so yellow.  And I found \r\nthat the other day in my stuff, so.  Yeah, I knew that girl \r\nthat did that one.  I know there was quite a few missin’ \r\nthat month or week or whatever it was.  It wasn’t me.  I \r\nwas there.   \r\n   \r\n----------------Page (82) Break----------------\r\n"}