{"id":"catherine-gaultier","identifier":"ROSIE_INTERVIEW_025","hash":"rosie","url":"http://127.0.0.1:8080/interviews/catherine-gaultier","label":"Catherine Gaultier","description":"Catherine Gaultier first worked for Sears for $7 a week, but as a Rosie in Cleveland for Fisher Body she made just over $2 an hour.","image":"http://127.0.0.1:8080/images/ROSIE_INTERVIEW_025-interview-thumbnail.jpg","type":"video","content":"Catherine Gaultier first worked for Sears for $7 a week, but as a Rosie in Cleveland for Fisher Body she made just over $2 an hour.  1 \r\nCatherine Gaultier \r\n \r\nThe Real Rosie the Riveter Project \r\nInterview 25 \r\n \r\n \r\n \r\nInterview Conducted by  \r\nKirsten Kelly \r\nJune 26, 2010 \r\nNashville, Tennessee  \r\n \r\n \r\n \r\nFor The \r\nFor the Tamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n----------------Page (0) Break----------------\r\n 2 \r\nInterview: Catherine Gaultier \r\nInterviewers: Kirsten Kelly  \r\nDate: June 26, 2010 \r\nPlace: Nashville, Tennessee \r\n \r\nGaultier: I’m Catherine Gaultier. \r\n \r\nKelly: And how old? \r\n \r\nGaultier: And I’m 95 years old and then I was one of the- I \r\nworked. I was a Rosie the Riveter. \r\n \r\nKelly: And how old? \r\n \r\nGaultier: I’m 95 years old. And then I was one of the Rosie \r\nthe Riveter. \r\n \r\nKelly: and where did you work as a Rosie? \r\n \r\nGaultier: I worked in Cleveland, Ohio. I worked for a \r\nFisher Body and before that I was working at Sears making \r\n$7 a week. While I was there three gentlemen came up to me \r\nand said, “Are you interested in going to be a riveter?” \r\nAnd I said, “I don’t know. I’ll have to ask Sears if they \r\n----------------Page (1) Break----------------\r\n 3 \r\ncould release me.” And they went to him and said, \r\n“certainly you can go.” And that’s how I got my job. \r\n \r\nKelly: And what did you make in Cleveland? \r\n \r\nGaultier: at that time I was making $7 a week at Sears but \r\nit was little over $2 an hour but I don’t remember exactly \r\nhow much but it wasn’t very much.  But but at that time, it \r\nwas a lot.  \r\n \r\nKelly: So when you were a Rosie you made- \r\n \r\nGaultier: Little over $2 an hour. \r\n \r\nKelly: Wow, really? So that was quiet a big difference from \r\nSears. \r\n \r\nGaultier: Oh yes, oh yes.  So I was so excited about it and \r\nI worked there pretty close to three years. And then well I \r\nwas there I had the three children and I had to work at at \r\nduring the day.  Then at night my husband worked. He worked \r\nto take care of the children. Then he went nights and I had \r\nthe reverse you know. And that’s how I kept staying there. \r\nAnd when I was going there at night when I went back to \r\n----------------Page (2) Break----------------\r\n 4 \r\nwork at night, I had to get up real early and get on the \r\nbus. Make three bus stops at that time because we didn’t \r\nhave the money, we didn’t have the car. And uh so after I \r\nstayed until the war ended. And while we were there he said \r\nwe’re going outside to stay in the uh the park lot.  They \r\nwere going to have a visitor. So in the meantime, he comes \r\nan airplane. The b-29 we were all there.  He comes out, he \r\ntips his wing, went all the way down, came back, tipped it.  \r\nAnd everybody was- we were crying.  Really crying, it was \r\nsad. And uh then about three weeks later, I think about \r\nthree weeks, we lost our job because the war ended because \r\nthey went to Iwo Jima. That’s when they bombed that Iwo \r\nJima. \r\n \r\n03:14:10--------------------------------------------------- \r\n \r\nGaultier: And that was the end of our- my career.  I had to \r\ngo back to sears. \r\n \r\nKelly: What do you think you learned from being a Rosie? \r\n \r\nGauliter: When I went there to be a Rosie, I was so proud \r\nand so happy and my husband also thought it was just \r\nwonderful. And so it was just it was just like we were \r\n----------------Page (3) Break----------------\r\n 5 \r\nplaying it was nice.  Everybody was so nice and gentle and \r\nuh I enjoyed it. I couldn’t wait to go back to work. I \r\ndidn’t want to take care of the children. \r\n \r\nKelly: Do you- Do you have a favorite uh funny memory or a \r\nfunny thing that happened while you were a Rosie? \r\n \r\nGaultier: The only thing- the men always made me do the \r\ndirty work. I had to get down to the bottom- (laughs). When \r\nthey were bucking I had to be thee to make sure they hit it \r\nright. And of course, had to be very careful and it had to \r\nbe even you know. It was so- they were something else.  \r\nThey were on top and you’d do the bottom. But we had a good \r\ntime. Everybody was so congenial. It was nice. \r\n \r\n04:35:21-------------------------------------------------- \r\n \r\nKelly:  What was the feeling like about the war at that \r\ntime? \r\n \r\nGaultier: I was very upset about it you know. I didn’t know \r\nhow long it was going to last you know. And everybody there \r\ntalked so much about death. And it was bad. It was- I knew \r\na lot of friends who were going into the service to the w- \r\n----------------Page (4) Break----------------\r\n 6 \r\nand I really felt bad. But it but it managed. We had to \r\nkeep on going. So but it- everybody was worried about it. \r\nSo when they bombed that and within one week it was all \r\ngone.  No war. The war ended and I lost my job. \r\n \r\nKelly: Do you remember how you found out you lost your job? \r\nDo you remember? \r\n \r\nGaultier: Oh yea I remember when I lost the job. \r\n \r\nKelly: What happened? How did you find out that you \r\ncouldn’t- \r\n \r\nGaultier: Oh we were dismissed.  They told us that we were \r\nall through. Everybody lost their job at that time. And \r\nthen it was- even then I went back to Sears. So- for $7 a \r\nweek. \r\n \r\nKelly: You worked for three years you said? As a Rosie? \r\n \r\nGaultier: Yes. \r\n \r\nKelly: What did you do with the extra money that you were \r\nmaking? Do you remember?  \r\n----------------Page (5) Break----------------\r\n 7 \r\n \r\nGaultier:  Well we paid of our home. Yes. So we were so \r\nhappy about that. You know, it was nice. \r\n \r\nKelly: Get a jump start? \r\n \r\nGaultier: Oh yes. It was sad it had to be that way but it \r\ndid help us. So- \r\n \r\nKelly: And what did your husband do during the war? \r\n \r\nGaultier: He was- he worked for the railroad.  He worked \r\nthere for 43 years, same one. And that of course he didn’t \r\nhave to go to the service because it was a railroader that \r\nwas important for them to move their materials around you \r\nknow. So that’s why he was there. And he took care of the \r\nchildren. \r\n \r\nKelly: A pretty modern husband at that time? \r\n \r\nGaultier: Oh yes yes so and uh, it was nice. I enjoyed \r\nevery minute of it. \r\n \r\nThe End. \r\n----------------Page (6) Break----------------\r\n"}