{"id":"edith-lyons","identifier":"ROSIE_INTERVIEW_022","hash":"rosie","url":"http://127.0.0.1:8080/interviews/edith-lyons","label":"Edith Lyons","description":"During the war, Edith Lyons worked in several places, following her husband around to different army bases.","image":"http://127.0.0.1:8080/images/ROSIE_INTERVIEW_022-interview-thumbnail.jpg","type":"video","content":"During the war, Edith Lyons worked in several places, following her husband around to different army bases.  1 \r\nEdith Lyons \r\n \r\n \r\nThe Real Rosie the Riveter Project \r\nInterview 22 \r\n \r\n \r\n \r\nInterview Conducted by  \r\nKirsten Kelly \r\nJune 26, 2010 \r\nNashville, Tennessee  \r\n \r\n \r\n \r\nFor The \r\nFor the Tamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n----------------Page (0) Break----------------\r\n 2 \r\nInterview: Edith Lyons \r\nInterviewers: Kirsten Kelly  \r\nDate: June 26, 2010 \r\nPlace: Nashville, Tennessee \r\n \r\nLyons: I am Edith J. Lyons and I was born, do you want \r\nthis. Nallen Fayette County, West Virginia. I lived in \r\nNallen, which was a small lumber town until I was about 12 \r\nyears old I believe. Went to grade school there then we \r\nmoved to Lookout, which was, which was close to Nuttall \r\nHigh School and finished grade school at Divine Elementary.  \r\nI went one year to Nuttall High School after that we moved \r\nto Ansted, West Virginia. And I went there three years, \r\ngraduated from Ansted High School. Then unfortunately I got \r\nmarried between my junior and senior year of high school so \r\nmy husband was very young too. He was a miner. Worked in \r\nthe coalmines. But when the war came along he decided to go \r\nt Newport, Virginia and work in the shipyards so he asked \r\nme to go along and I did. We were there about two weeks and \r\nhis number came up and he was drafted into the Army. But \r\nduring that time, at two weeks, I had registered at the \r\nunemployment service and they sent me to Camp Patrick \r\nHenry. And a construction company, Doyle, Wrestler and Wise \r\nwas building an Army camp so at Fort Patrick Henry, which \r\n----------------Page (1) Break----------------\r\n 3 \r\nis no longer in existence. Um, I went into a typing pool \r\nand my education so far had been in business subjects. I \r\nwent Charleston School of Business in Charleston, West \r\nVirginia.  So I was in this typing pool, did that for quiet \r\nsome time. Then the supervisor of the job needed a \r\nsecretary so he asked and I was who held up my hand and he \r\nasked me then to be his secretary and I worked there until \r\nthat job was almost complete and his company sent him to \r\nPortsmouth, Virginia doing the same thing. Putting in \r\nanother Army Camp.  Then toward the end of that time, my \r\nhusband was at Stewart Air- I think it was Stewart Airbase \r\nin Nashville, Tennessee and ask me to come here and I did \r\nand went to the unemployment service again and they sent me \r\nto Gillespie Airways. Gillespie Airways, to the best of my \r\nknowledge was a commercial airway but had just recently \r\ngotten a contract to train Army aircraft students and J.D. \r\nGillespie hired me to do the reporting on this job. \r\nReporting the process of the pilots, the trainee. We had \r\nand I keep thinking it was 16 pilots who may have been \r\ncommercial pilots before they came to that job.  \r\n \r\n04:07:12------------------------------------------------ \r\n \r\n----------------Page (2) Break----------------\r\n 4 \r\nAnd we trained 120 students. 60 came one day and 60 the \r\nnext and kept rotating. And as they completed a flight, \r\nthey put their log books out in the hangers and the biggest \r\njob I had there would go, take them back to my office, read \r\nthem and make a report on them. Of course, I had to decide \r\nwhat was important to report. I also reported, I think on \r\nthe pilots, the airplanes, the mechanics and so forth and \r\nof course, I was walking from my office, past a government \r\noffice that was there and uh, into the commercial airline \r\nplace. We came past that into the hangers and uh, I guess I \r\nstarted with the first flight and as I could catch up with \r\nthem, I did 60 of those everyday to report on. Then 60 more \r\nthe next day, same students.  I worked there, I think for \r\nover a year and then my husband was in Biloxi, Mississippi \r\nand asked me to come there, so I did that and uh, I looked \r\nfor a job there and I must of- I keep thinking that I \r\nworked somewhere in Biloxi, Mississippi but probably I \r\ndidn’t. Then I went to Gulf Port, Mississippi and worked \r\nthere for a short time with it was a government facility. \r\nThen I got tired of all that running around so I decided it \r\nwas time to go back Charleston, West Virginia and went to \r\nthe unemployment office again and they sent me to General \r\nMachinery. General Machinery was the parent company of the \r\nGovernment Ordinance Plant and they were manufacturing big \r\n----------------Page (3) Break----------------\r\n 5 \r\nguns for the war effort. My job there was as secretary to \r\nthe Chief Accountant and Vice President so what I did, \r\nmostly, took letters, dictations, was to type on a type \r\nwriter, with a cartridge this long, eleven copies at a time \r\nof reports on the guns that were manufactures there and \r\nsent on someplace for the war effort. I typed eleven copies \r\nat a time on special onionskin paper with special carbon \r\npaper. And uh, I’m not sure exactly how long I worked \r\nthere. It was a nice job but then I decided not to work \r\nthere anymore. I went home for a bit which was in Fayette \r\nCounty. Then I came back to Charleston and found another \r\njob with the Hudson Automobile Agency and I think the, I \r\njust heard this recently that there was the Hudson Plant \r\nwas converted into doing something with the War Effort.  I \r\ndidn’t know that until I talked to another Rosie here. Um, \r\nmy job there was a secretary but I was checking the the \r\nbooks and the financial statements and typing those. Also, \r\nordered cars, talked with customers.  At that time, I think \r\nI could have called anyone of 65 people who were on our \r\nlist waiting for automobiles that didn’t come in very fast. \r\nAnd with that agency we ordered retail, wholesale, new \r\ncars, and we also had used cars there.  And there was a \r\nmechanic shop where they repaired things like that. But \r\nwhen I would call Detroit I would have to tell them what I \r\n----------------Page (4) Break----------------\r\n 6 \r\nwanted on these cars and we’d try to add as many \r\naccessories as possible.  And then there, by that time, I \r\nwas divorced, after 10 years of having been married and not \r\nseeing my husband very much during that time. And uh, so \r\nthis young man called from Carmine and asked how soon he \r\ncould get a Hudson and we told him we hoped about 90 days \r\nand uh so he said he’d come in.  One day I was in the \r\noffice all by myself. You had to walk across the show room \r\nfloor and up some steps to get to my office and uh, saw \r\nthis young man come in the door and watched him walk across \r\nthe showroom floor and up the steps. He came up and said, \r\n“I want to sign up.” So I signed up. I gave him an order \r\nform- well I found an order blank and started writing \r\neverything down. And I sold him a convertible with white \r\nsidewall tires and a Kleenex dispenser, which was unheard \r\nof I think. But everything I could think of to go on as an \r\naccessory, I sold him.  He didn’t get that car. He had to \r\nwind up buying a used Buick, I think but he said later that \r\nhe signed up for a car and I signed him up for life. And we \r\nwere married 54 years. He died 2002. He became- he was in \r\nthe Engineering Department at Carbine and they had layoffs \r\nsoon after we were married.  We had discussed the fact that \r\nhe might go back to school so we decided that now was the \r\ntime if you are ever going back to school, do it now. \r\n----------------Page (5) Break----------------\r\n 7 \r\n \r\n11:44:17--------------------------------------------- \r\n \r\nLyons: He went to Marshall that’s in Huntington, West \r\nVirginia. They signed him up but on the way out- I can’t \r\nremember exactly how that happened but the Register, or the \r\nperson who had interviewed him to be a student said, “I’m \r\nsorry Mr. Lyons, we- your grades were so low at the \r\nUniversity of Tennessee that we can’t accept you with \r\nthat.”  So he was broken hearted then.  But then, this man \r\nwho interviewed him said, “If you go to Charleston and get \r\na couple of semesters or get a couple of hours and make \r\nsome good grades, then you can come back.” I’d like to tell \r\nyou this. While I was at Gillespie Airway, FDR decided- or \r\nthe government decided that we had too many pilots in \r\ntraining and that they needed to wash out some that were \r\ntraining and not take in anymore for a bit. And maybe that \r\nwas supposed to be the end of it. Anyway, my husband was \r\nin- my wonderful husband was in training to be an Air Crew- \r\nAir Force Pilot. He had finished all his training. His \r\nuniforms orders and he had one flight to do and the same \r\norders went to Pensacola that came to Gillespie Airways, so \r\nI knew how these boys were washed out of the service- \r\nwashed out of the Air Corps and uh, then they all had find \r\n----------------Page (6) Break----------------\r\n 8 \r\nother places to go. I think my husband was offered \r\nAnnapolis for more training or whatever.  Anyway, he \r\ndecided to go back to basic training. Went back to Great \r\nLakes and uh from there he became a...let’s see, he was on an \r\nLSM supply ship that went to China and back so we didn’t \r\nmeet until about ’40...’46. \r\n \r\nKelly: Right after the war. \r\n \r\nLyons: Right after the war.  So uh then- \r\n \r\nKelly: Did he know you were a Rosie? \r\n \r\nLyons: No, of course, I didn’t know I was a Rosie. \r\n \r\nKelly: So after the war did you work through the rest of \r\nyour life? \r\n \r\nLyons: Yes, m’am I did. I retired from the Talbot County \r\nLibrary in Easton, Maryland after I had I had become 62 \r\nyears old, signed up for my social security and uh I \r\ndecided, well, I might need another jobs or I might need \r\nsome money to carry me over so I signed up for unemployment \r\ncompensation.  I think I drew one check and social security \r\n----------------Page (7) Break----------------\r\n 9 \r\ngot started and then I got another job.  So I tried to stop \r\nthe social security payments so that I could- \r\n \r\nKelly:  What did you learn from being a Rosie? \r\n \r\nLyons: From being a Rosie, uh, I learned a lot I really did \r\nbecause there are about 10 years of my life that I just \r\nsort of blanked out.  I didn’t like being a divorcee and uh \r\nI didn’t care about people know I was. I was ashamed of it \r\nbut this was not my fault. So anyway, the name went under \r\nat Gillespie was my first husband’s name. I think I should \r\ntell you that because if it’s the Gillespie Airway people \r\nwho I worked with or their descendants hear about this, \r\nthey would probably remember me as Basie but that’s not my \r\nname. It was Bays. B-A-Y-S. One of the trainee’s, one day \r\nsaid, “Why do they call you baby?” And I said, “Oh they \r\ndon’t call me baby, they call me Basie after my last name.  \r\nI’ve always had a nickname, one way or another. I started \r\nwith Johnny from Johnson, my middle- my maiden name.  Let’s \r\nsee what else did I get called? \r\n \r\n17:01:14----------------------------------------------- \r\n \r\n----------------Page (8) Break----------------\r\n 10 \r\nKelly: Do you have one favorite story or one favorite \r\nmemory from the time when you were a Rosie, during the war? \r\n \r\nLyons: Yea. \r\n \r\nKelly: Just one, just one... \r\n \r\nLyons: Well the teamwork at Gillespie Airways were just \r\ngreat and I knew all these people there and we went to \r\nparties together and we just- each of us knew that we were \r\naway from home and uh it was just a nice feeling to be \r\nthere and to know that these people cared about you. And \r\nyou were away from home so uh that was nice. \r\n \r\nKelly: Sounds like a very supportive- \r\n \r\nLyons: And now I’m glad to be remember this because I sort \r\nof wiped it out for so long. \r\n \r\nThe End. \r\n----------------Page (9) Break----------------\r\n"}