{"id":"eileen-tench","identifier":"ROSIE_INTERVIEW_026","hash":"rosie","url":"http://127.0.0.1:8080/interviews/eileen-tench","label":"Eileen Tench","description":"During World War II, Eileen Tench worked at the Goodyear Plant building PBM Navy airplanes.","image":"http://127.0.0.1:8080/images/ROSIE_INTERVIEW_026-interview-thumbnail.jpg","type":"video","content":"During World War II, Eileen Tench worked at the Goodyear Plant building PBM Navy airplanes.  1 \r\nEileen Tench \r\n \r\nThe Real Rosie the Riveter Project \r\nInterview 26 \r\n \r\n \r\n \r\nInterview Conducted by  \r\nKirsten Kelly \r\nJune 26, 2010 \r\nNashville, Tennessee  \r\n \r\n \r\n \r\nFor The \r\nFor the Tamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n----------------Page (0) Break----------------\r\n 2 \r\nInterview: Eileen Tench \r\nInterviewers: Kirsten Kelly  \r\nDate: June 26, 2010 \r\nPlace: Nashville, Tennessee \r\n \r\nTench: Well my name is Eileen Tench. Actually, Eileen \r\nHeaden Tench. And um I started well after the war started \r\noh I shouldn’t start there either. When I first heard about \r\nPearl Harbor, my father and I had gone to a movie and we \r\nwere on our way home. And there was no one in the cold \r\nnight. And we heard this terrible news. So then my \r\nboyfriend at the time, he eventually had to go to the \r\nservice. He was drafted. And then Goodyear was hiring. \r\nGoodyear Aircraft so I thought, oh I think I’ll go over \r\nthere. So I had to go to school for three weeks to learn \r\nhow to drill and rivet and do that kind of stuff. So when I \r\ngot finished with that, then they sent me over to Goodyear \r\nAircraft. And I worked in the Air Dock, which is the big \r\nhanger where they used to build blimps. And uh so then in \r\nthe winter time they put up like tents all because the \r\nbuilding was so big and they put all these tents up and \r\nthat’s where we worked, under there. And then in the summer \r\ntime they would roll the canvas back and uh said, the \r\nbuilding was so big, it would rain in there and that was \r\n----------------Page (1) Break----------------\r\n 3 \r\nthe story you used to- but actually what it was \r\ncondensation dripping because when we would go outside of \r\nthe canvas to go to the bathroom, you’d get dripped on. So \r\nwe knew it was the condensation. It wasn’t really raining. \r\nAnd I was uh we worked at benches, on benches and we did \r\ndrilling and and this one friend of mine she was working \r\nthe punch machine and she caught her thumb in it and just \r\npunched a hole in her thumb. And she sat there and I yelled \r\nand everybody came in and released the machine.  But she \r\nkind of slumped over. She kind of passed out. She was okay \r\nthough. That was one of the bad experiences I had there. \r\n \r\n02:47:20--------------------------------------------------- \r\n \r\nKelly: Was it dangerous? \r\n \r\nTench: Pardon? \r\n \r\nKelly: Was it dangerous work or- \r\n \r\nTench: No. Not really you had to be careful. You had to \r\ncover your hair because every so often they’d come around \r\nwith this really long drill with hair all around it. They \r\ntried to scare you know. Now see if you don’t cover your \r\n----------------Page (2) Break----------------\r\n 4 \r\nhead, that’s what will happen. You’ll lose your hair. It \r\nwill get caught in a drill. So uh then one time they had \r\nWallace Barry. He was movie star come to-they were selling \r\nbonds. And they had a big rally outside the building. And \r\nthen- \r\n \r\nKelly: Did you buy bonds? Was that something- \r\n \r\nTench: Oh yea, I did. Bought my first house when we sold \r\nall my bonds.  When my husband came home, we got married in \r\n1945 and um we sold all my bonds and bought a house. That \r\nwas our first house.  When I first started working, I was \r\nmaking $.75 an hour and then when the war ended I was \r\nmaking $1.20 an hour and that was big money and so then \r\nwhen the war ended it was just like turn out the lights and \r\ngo home. I mean I was one of the last ones to leave and it \r\nwas just really weird. And they had- we had gas rationing \r\nyou know and I had an eight sticker because I live far \r\nenough away that I could get the bigger amount of gas. And \r\nwe had to have so many passengers.  I had an eight coupon \r\nso I’d get people rides to pick up. So- \r\n \r\nKelly: And did you have a car you drove? \r\n \r\n----------------Page (3) Break----------------\r\n 5 \r\nTench: Well my brother had a car. He had a ’38 Chevy.  He \r\nhad to go into the Navy so he sold me his car. So I had my \r\nown car and that was great. And one of the girls I worked \r\nwith had a car just like it.  So we’d all get together and \r\ngo places. \r\n \r\nKelly: Can you talk about exactly what you did as a Roise? \r\nLike what did you do each day when you showed up to work? \r\n \r\nTench: Well they had these parts that we had to drill holes \r\nin and they were called Al- alerones. I worked on a PBM, \r\nthat was a Navy airplane and um then they had, what’s it \r\ncalled, a boot. It looked like a boot almost. It was big \r\nshoe like you put on a giant or something and I put rivets \r\nall around the outside. You had to drill holes, put the \r\nrivets in and use the bucking bar. And um- \r\n \r\nKelly: And that was for the airplanes you were making? \r\n \r\nTench: Um uh and uh when you first start working there, \r\nthere was always someone pulling a fast one on somebody so \r\nthey called me- they told me to go over- they had a tool \r\nbench where you’d go get the drills and stuff and you had \r\nto get stuff so um they told me to get some prop wash so I \r\n----------------Page (4) Break----------------\r\n 6 \r\nwent over to the window and said, I need some prop wash and \r\nsoon as I said it the look on the guys face, I knew it was \r\na joke.  You know what prop wash is? It’s the air behind a \r\npropeller.  \r\n \r\n06:42:04--------------------------------------------------- \r\n \r\nKelly: Do you remember what your very first, what your very \r\nfirst day was like when you were hired as a Rosie? \r\n \r\nTench: I was afraid.  I didn’t know what to expect but it \r\nwasn’t long before I made friends with all the people I \r\nworked with.  There was one lady, she was comical because \r\nshe wanted to learn how to make airplanes. She was going to \r\nbuild her own plane. She wanted to know how to make every \r\npart.  It was impossible and every once an a while they’d \r\ncome over the P.A. System and tell us what was going on \r\nduring the war or what was happening. When they had D-Day \r\nthey told us and we were all so happy then because we \r\nthought maybe this is going to be end. And it was close to \r\nthe end so- \r\n \r\n----------------Page (5) Break----------------\r\n 7 \r\nKelly: Do and did you have a bucker with you? You were a \r\nriveter and you had bucker with you or what? What were the \r\npositions- \r\n \r\nTench: Well sometimes we could do both. I mean hold the \r\nbucking bar and rivet at the same time. And if you weren’t \r\ncareful sometimes the metal would get a little hairline \r\nsplit in it and you had to drill a little hole at the end \r\nof that crack to keep it from going any further.  And there \r\nwere difficult things like that we had to do. \r\n \r\nKelly: Who was- can you- what were you wearing at that \r\ntime? What were you- \r\n \r\nTench: My mother made me coveralls like and that’s what I \r\nwore mostly.  \r\n \r\nKelly: And what were the fashions like when you weren’t \r\nworking? What what were women wearing at this time? \r\n \r\nTench: Well, not much different than now.  We didn’t have \r\nhoes, nylons, we painted our legs. Drew a line up the back \r\nof our legs for the seam. And that was funny because \r\n----------------Page (6) Break----------------\r\n 8 \r\nsometimes if you got wet it would get kind of messy.  Other \r\nthan that I- \r\n \r\nKelly: Was it- was it a big thing for women to go to work \r\nat this time? \r\n \r\nTench: I don’t think so. I don’t think so. \r\n \r\nKelly: No? Because you were working before? \r\n \r\nTench: Uh no. \r\n \r\nKelly. No.  So this was your first job. You were a Rosie \r\n \r\nTench: (nodding) Yea. \r\n \r\nKelly: And then did you keep working after the war? Did you \r\never work again? \r\n \r\nTench: uh well after the war, like I said, we got married. \r\nMy husband got home in April and then we got married in \r\nJune and I uh of course didn’t have a job then because the \r\nplant just closed down so I went work at a match company \r\n----------------Page (7) Break----------------\r\n 9 \r\nand uh I worked there until I got pregnant and that was the \r\nend. So- \r\n \r\n09:58:00--------------------------------------------------- \r\n \r\nKelly: What do you think being a Rosie taught you for the \r\nrest of your life? What do you think it gave you? \r\n \r\nTench: Ummm, well I really don’t know. It, it, I learned \r\nhow hard it was to work and make money. I used to be \r\nashamed to tell anybody I worked for Goodyear Aircraft \r\nbecause it seemed like there was a lot of hanky panky going \r\non during that time and uh of course I wasn’t involved in \r\nany of that because I was just a teenager. But it just \r\nseemed like it didn’t have a very good reputation.  And \r\nthat’s why I just wasn’t too happy to say I worked for \r\nGoodyear Aircraft because I thought, well they’re going to \r\nthink that I’m a bad person. And I wasn’t. \r\n \r\nKelly: Were you one of the younger ones working there? \r\n \r\nTench: Yea, um uh. \r\n \r\nKelly: And what was the age range of the women working? \r\n----------------Page (8) Break----------------\r\n 10 \r\n \r\nTench: Well it varied, um there was um I guess teenagers \r\nand I guess probably- well some of my friends were- well \r\nthe one lady had a little boy. I think he was ten. And \r\nPolio was a big thing during that time and I remember she \r\nwas very concerned about him getting Polio. And then there \r\nwas a couple older ladies who had bifocals and every time \r\nthe supervisor would come around and tell them to do \r\nsomething, he’d be showing them something and this is not \r\nvery nice, he would say, look at this you know, both of \r\ntheir heads would fly back. You know when they would have \r\nto look through their bifocals. And I thought that was \r\nfunny. I have to do that now myself. \r\n \r\n12:10:04--------------------------------------------------- \r\n \r\nKelly: What were some of the feelings about the war at this \r\ntime? \r\n \r\nTench: It was terrible. It was really sad. I mean, it hit \r\non the best part of my life I felt and uh I just- made it \r\nbad for kids my age- teenagers because we didn’t have \r\nanything to really look forward to because everything was \r\n----------------Page (9) Break----------------\r\n 11 \r\ntaken, everything was rationed. You couldn’t get shoes and \r\nyou couldn’t do this and you couldn’t do that. \r\n \r\nKelly: Do you remember hearing um about any stories or \r\nabout anything that was happening in Europe or in with \r\nJapan? \r\n \r\nTench: Well I know that that nobody liked the Germans and \r\nnobody liked the Japanese. ‘Cause they were what was \r\ncausing all our problems. \r\n \r\nKelly: Did you know anyone who served in the war? \r\n \r\nTench: Yes, uh um, one of my classmates was killed on on a \r\nD-Day and uh then I had some other classmates who were in \r\nthe service but they got back home. And then uh I had some \r\nof my family members were in the Army. \r\n \r\nKelly: Were there pretty good relations between the men who \r\nstayed working and the Rosies or was it difficult sometimes \r\nor was it- were there challenges?  \r\n \r\nTench: Uh not too much. Um we called the Four F-ers. Did \r\nyou ever hear of the- you didn’t? You’ve never heard of the \r\n----------------Page (10) Break----------------\r\n 12 \r\nFour Fs?  They were the guys that stayed home and they \r\ndidn’t have to go serve their country. There were a lot of \r\nthem- it wasn’t their fault. They had some medical problem \r\nor reason but that’s why girls didn’t have any boyfriends \r\nbecause they were all Four F-ers and nobody wanted to \r\nassociate with a Four F-er. \r\n \r\nKelly: And what did the F stand for? \r\n \r\nTench: I don’t know. \r\n \r\nOther person: F is the classification. \r\n \r\nKelly: Oh \r\n \r\nTench: Oh that’s right. \r\n \r\nOther person: It’s the Army Classification as to whether \r\nyou are fit or not.  That’s what it stands for. \r\n \r\nKelly: Oh ok, right. \r\n \r\nTench: Yea. \r\nThe End. \r\n----------------Page (11) Break----------------\r\n"}