{"id":"idamae-mason","identifier":"ROSIE_INTERVIEW_017","hash":"rosie","url":"http://127.0.0.1:8080/interviews/idamae-mason","label":"Idamae  Mason","description":"Idamae Mason worked for Consolidated Vultee Aircraft in New Orleans, Louisiana during World War II.","image":"http://127.0.0.1:8080/images/ROSIE_INTERVIEW_017-interview-thumbnail.jpg","type":"video","content":"Idamae Mason worked for Consolidated Vultee Aircraft in New Orleans, Louisiana during World War II.  1 \r\n \r\n \r\nIdamae Mason \r\n \r\n \r\nThe Real Rosie the Riveter Project \r\nInterview 17 \r\n \r\n \r\n \r\nInterview Conducted by  \r\nAnne de Mare  \r\nJune 28, 2010 \r\nNashville, Tennessee  \r\n \r\n \r\n \r\nFor The \r\nFor the Tamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n----------------Page (0) Break----------------\r\n 2 \r\nInterview: Idamae Mason \r\nInterviewers: Anne de Mare  \r\nDate: June 26, 2010 \r\nPlace: Nashville, Tennessee \r\n \r\nMason: I’m Idamae Mason and I live in Birmingham, Alabama \r\nand during World War II, I worked and Consolidated Vultee \r\nAircraft uh on Lake Pontchartrain in New Orleans, \r\nLouisiana. \r\n \r\nDe Mare:  What did you do there? \r\n \r\nMason:  I inspected the castings and forgings that was \r\nbeing machined into the landing gear.  We had the first had \r\nto check to see if there was enough metal in it to be \r\nmachines and then I had use the Rockwell Machine to test \r\nthe hardness of it. And then if it past that, I would send \r\nit to Magnaflux to see if there were any cracks inside and \r\nif there were, if it was okay it would be machined. \r\n \r\nDe Mare: Now, had you ever done any work like this before?  \r\nWhen you were younger? \r\n \r\nMason: No. \r\n----------------Page (1) Break----------------\r\n 3 \r\n \r\nDe Mare:  Can you tell me a little bit about your \r\nchildhood, like where you came from and how you ended up \r\nthere? \r\n \r\nMason: (laughs) Well I’m a little country girl.  I walked \r\nthree miles to school.  It was a two-teacher school.  And \r\nuh back then, you had to first- the first year was the \r\nprimer.  If you’re little red hen found a seed, it was a \r\nwheat seed. Had to go through all that. But I had a brother \r\nand sister older than me.  I knew my alphabet so and I \r\ncould spell worlds in the newspaper so I learned to read \r\nbefore I even got to school.  \r\n \r\nDe Mare: That’s wonderful. \r\n \r\nMason: So I was only in there a month and then I went into \r\nthe first grade. \r\n \r\nDe Mare: And what did your parents do?  What kind of work \r\ndid they do? \r\n \r\nMason: My father, at that time worked on the railroad.  He \r\nwas carpenter on the railroad. Of course, mother stayed \r\n----------------Page (2) Break----------------\r\n 4 \r\nhome and took care of the children and would over see the \r\nfarm work. \r\n \r\nDe Mare:  And what kind of farm work would you do? \r\n \r\nMason:  Well, a little bit of everything. Uh we had sweet \r\npotatoes, Irish potatoes and the winter Irish potatoes. \r\nPeanuts, corn, had to pick cotton. And raised hay so we had \r\nto raise everything that uh was necessary on the farm. \r\n \r\nDe Mare: So now as a young woman when you went to work down \r\nin New Orleans, what was that like- you were earning money.  \r\nWhat was that like for you, to earn that kind of money that \r\nyou earned-? \r\n \r\nMason: Well it was big money. Well, I thought this is like \r\nhaving an executive job compared to what- you only got a \r\ndollar a day. \r\n \r\nDe Mare: Working on the farm. \r\n \r\nMason: No I didn’t get paid for my work. \r\n \r\n----------------Page (3) Break----------------\r\n 5 \r\nDe Mare: So where did you earn a dollar a day, when you \r\nwere down in New Orleans? \r\n \r\nMason: No, ironing and tailoring in Birmingham, Alabama. \r\n \r\nDe Mare: Ok. \r\n \r\nMason:  I first started out altering fur coats, which I \r\ndidn’t know how to do but I learned right quick.  My boss \r\nnever did find out about it.  I picked up a pair of \r\nscissors to cut the fur and the one of the ladies knew I \r\ndidn’t know anything about it so she (didn’t say anything)- \r\nso she showed me how. And uh I kept that until- you know \r\nthat’s just seasonal. So at Christmas time they told me I \r\nwould sell toys and I said, “I’m no salesman. I don’t want \r\nto sell.”  And so well you have to. So I went up and third \r\ncustomer came in. I had pulled out everything. And of \r\ncourse, this was during the Great Depression and no one had \r\nmuch money so when she asked to waited on, I said, “do you \r\nwant to just look or are you going to buy?”  \r\n \r\n05:03:21--------------------------------------------------- \r\n \r\nMason: So I decided I wasn’t a salesman. \r\n----------------Page (4) Break----------------\r\n 6 \r\n \r\nDe Mare: Now can you tell me the story of how you got the \r\njob working in the defense plant.  Do you remember how that \r\nhappened? \r\n \r\nMason: Well the plant opened up and I decided that would \r\npay better than what I was getting. So you had to go to \r\nclasses, three weeks, to learn the proper names for the \r\nparts of the plane. And then you uh had to buy your uniform \r\nthat you wore and go into the plant.  Well they tried me at \r\nthe to be a riveter.  But my wrist wasn’t strong enough to \r\nhold the- I cou- to hold the pneumatic gun. But you had to \r\nhave electric to actually do the work.  It was too heavy so \r\nthey said you’d be bucker then.  I was a bucker one day.  I \r\ncame in, I couldn’t hold it in both hands.  I would hold it \r\nup and I was all black and blue.  So then they put me on \r\nbunch work. You had to uh. My job was to drill hoes in the \r\nforms where they blanked out the parts. Well I got metal \r\npoisoning and they wanted me to take sick leave. And I \r\nsaid, “I’m not sick. You can transfer me to another \r\ndepartment.”  And they didn’t want to so I said, “I’m going \r\nto sit on that stool eight hours and draw my pay.” And \r\nthat’s what I did for six weeks.  And I went to night \r\nschool at Tulane University. I wanted a blueprint reading \r\n----------------Page (5) Break----------------\r\n 7 \r\nbut the class was filled.  So I signed up for aircraft \r\ndrafting.  I did not know what I was getting into. So about \r\nthe second week, the professor looked at the class and \r\nsaid, not a third of you will to finish.  And he was \r\nlooking straight at me. And I thought well buddy I’ll show \r\nyou I’ll finish. Because if he hadn’t said that I’d \r\nprobably quit. And I got my certificate and I thought I was \r\ngoing into blueprint reading and that’s when they put me in \r\ninspection. And that’s where I stayed until the war ended. \r\n \r\n08:25:03----------------------------------------------- \r\n \r\nDe Mare: You had quite the adventure there.  Now can you \r\ntell me the story of when the war ended?  What happened \r\nafter the war? \r\n \r\nMason: Well we had to give up the- they sold the plant to \r\nKelvinator and uh while I was working you had to work \r\nthree- there were three shifts, the render shift, the swing \r\nshift and the graveyard shift. Well I had just come off the \r\ngraveyard shift and I had just worked three months by the \r\ntime you got oriented to that one, you were changed to the \r\nnext one. So I was glad I came off of it otherwise I would \r\nhave had to clean up for that department. So I drew my- \r\n----------------Page (6) Break----------------\r\n 8 \r\nwent back to Collinsville. I mean, Yup, back to \r\nCollinsville and drew my penance.  I think it was twelve \r\nweeks. \r\n \r\nDe Mare: Unemployment? \r\n \r\nMason: And then I went to New Orleans, I mean to \r\nBirmingham. I came in to Birmingham and got a job in \r\ntailor. \r\n \r\nDe Mare: And is that what you did for a while after that? \r\n \r\nMason: Yea, then I decided that I couldn’t use my hands \r\nvery good because I got metal poisoning I just couldn’t \r\nwork my hands real good. So I got a job as a payroll clerk \r\nwith a gas company. \r\n \r\nDe Mare: Can you tell me about the metal poisoning in your \r\nhands?  Can you explain that to me? \r\n \r\nMason: Well you had to drill uh they used the Kirkside \r\nwhich was an aluminum alloy to make the form and that the \r\nshavings and drilling it entered the pores of my skin. Uh \r\nit formed uh a hard surface.  These three fingers were \r\n----------------Page (7) Break----------------\r\n 9 \r\npulled in like this.  So you couldn’t do anything with your \r\nhand like that. \r\n \r\nDe Mare: Do you have-I wish we had longer to talk to you.  \r\nDo you have a favorite story that happened?  Like an \r\nanecdote you remember. An event that happened while you \r\nwere working that stands out among the other things? \r\n \r\nMason: Well, yes. Uh Errol Flynn. You know movie stars had \r\nto come and promote bonds. Well Errol Flynn came and he was \r\nso drunk he couldn’t find the gate so he started climbing \r\nthe fence. So he came back to the hotel.  He was about \r\nhalfway up the fence by the time- \r\n \r\nDe Mare: That’s amazing. \r\n \r\nMason: And uh we only had thirty minutes you know for lunch \r\nand we had three different lunch periods and you only had \r\nthirty minutes. And they tickets- the colors were changed \r\nand if you didn’t finish in thirty minutes they’d have to \r\ncall your boss before you could pay for it. They’d dock you \r\nfor a half an hour. So everyone wanted to finish up.  They \r\nstarted running and then they put up a sign, walking ten \r\nmiles an hour. So Victor Mature came and we were headed \r\n----------------Page (8) Break----------------\r\n 10 \r\nright at lunchtime.  So we couldn’t stay and talk to him we \r\nhad to run and get through that line. He got close we \r\ndidn’t pay him any attention. \r\n \r\n13:06:02--------------------------------------------------- \r\n \r\nDe Mare: When you worked in the plant, was it is mostly \r\nwomen or was it women and men? What was it- how was it? \r\n \r\nMason: It was well the ones that- I guess there were about \r\nas many men as there were women. Because it took the men to \r\nfind- I mean to uh get everything ready to be- the plane to \r\nbe put together. \r\n \r\nDe Mare: Ok, so the men did a lot of the heavy work- \r\nheavier work than the women did at that point? \r\n \r\nMason: Yes and they sabotaged all of two planes. Uh they \r\nuh, you know they had to test it over Lake Pontchartrain. \r\nUh see they had the pontoons where they could land on water \r\nas well as the landing gears for the land. And uh, he \r\nstarted to take off and the propeller fell in Lake \r\nPontchartrain. And they- They had brought the FBI in. I \r\ncould spot every one of them because they wore uniforms \r\n----------------Page (9) Break----------------\r\n 11 \r\njust like everyone else but they didn’t do much work. They \r\nwould be pretending they were working then they’d raise up \r\nand look around at everybody.  That’s the way they caught \r\nthem. Was you know, whenever they tried to do sabotage \r\nwork.  \r\n \r\nDe Mare: So who were the people doing the sabotage work? \r\n \r\nMason: Um, well I wasn’t it that part of it to know exactly \r\nwhere and they second one was- it was like he had just \r\ntaken a knife and chopped it off behind the pilot and co-\r\npilot and they landed in Lake Pontchartrain and the shrimp \r\njust uh left the skeleton but they were fastened to their \r\nseats, the seatbelts was still in tack. The clothing they \r\nhad on underneath on between them and the seat, that was \r\nthe only way they could identify which one was which.  \r\n \r\n15:47:23------------------------------------------------- \r\n \r\nDe Mare: That’s a terrible story. \r\n \r\nMason: I mean, it was a clean cut and how that- I never \r\ncould figure that out. \r\n \r\n----------------Page (10) Break----------------\r\n 12 \r\nDe Mare: Now do you remember how much money you were paid \r\nto work there?  Do you remember how much you made? But you \r\nremember it was a lot of money at the time for you? \r\n \r\nMason: Yes it was. \r\n \r\nDe Mare: Do you remember what you did with the money. \r\n \r\nMason: Well I sent it to my youngest brothers in school in \r\nNew York to do electrical and gas work. \r\n \r\nDe Mare: You paid for his education? \r\n \r\nMason: Yes. \r\n \r\nDe Mare: And what did you- after the war, how do you think, \r\ndid doing that work change you? Do you think it affected \r\nyou to be involved in this bigger effort for the war? \r\n \r\nMason: Yes. \r\n \r\nDe Mare: Can you talk a little bit about that? \r\n \r\n----------------Page (11) Break----------------\r\n 13 \r\nMason: Well, it changed the lifestyle of everybody.  And of \r\ncourse back then uh, we had to be dressed proper. You \r\ncouldn’t let your ankles show and you couldn’t wear blouses \r\nwith low necks. So uh of course if they saw it today, \r\nthey’d have a heart attack. \r\n \r\nDe Mare: Do you think- you think that working women- can \r\nyou talk about that?  How did it change- how, how did being \r\na workingwoman change that attitude do you think? \r\n \r\nMason: what we started wearing pants suits then.  We were \r\nnot allowed to wear pants suits to go shopping. You had to \r\nbe dressed like you were going to church. Make sure you had \r\nyour gloves and your hat or they would not wait on you. Uh \r\nwe didn’t have time to go home and change clothes if we \r\nwanted to buy something after we got off from the plant. So \r\nI showed as long as I could stand it because they kept \r\nwaiting on everybody else that came in that was dressed \r\nproper. And I said, “are you going to wait on me or do you \r\nthink my money is too dirty?” So they got busy and waited \r\non me. I knew that I was making a lot more than they were. \r\n \r\nDe Mare: Do you think it effected, because obviously you \r\nhave a daughter. Do you think, do you think that going out \r\n----------------Page (12) Break----------------\r\n 14 \r\nand working in that way and earning that much money and \r\nbeing that independent, do you think that changed how you \r\nraised your daughter? \r\n \r\nMason: Yes it definitely.  \r\n \r\nDe Mare: It’s interesting because I wonder how from your \r\nperspective if you thought that they way you raised your \r\ndaughter was different than the way you were raised.  Can \r\nyou talk about that? \r\n \r\nMason: Well I wanted her to, as she grew up to experience \r\neverything. And pay attention to things that were \r\nhappening. And I got criticized because they thought I was \r\ntoo lenient with her but I knew that for her future she \r\nneeded to know all about that. \r\n \r\n19:49:14-------------------------------------------------- \r\n \r\nDe Mare: I think you did pretty well. \r\n \r\nDaughter: She had a- she wanted- she went to college and uh \r\nher father said that if she went to college she was going \r\nto be a schoolteacher because she could only be a nurse, a \r\n----------------Page (13) Break----------------\r\n 15 \r\nschool teacher.  You know there are only certain things you \r\ncould do. That a woman could do. And that’s not what she \r\nwanted to do- \r\n \r\nDe Mare: Can I ask you what you did want to do? \r\n \r\nMason: I wanted to fashion sketch. Uh, you see you did not \r\nwork in an office with men because they might rape you. \r\nThat was that idea. You could teach school but you couldn’t \r\nwork in an office even if you were in a different room. \r\nThat just thought that men were terrible. \r\n \r\nDe Mare: So interesting. So what did- did you end up going \r\nto school for fashion illustration?  \r\n \r\nMason: no I didn’t. \r\n \r\nDe Mare:  What did you end up going to school for? \r\n \r\nMason: Right after the war I worked in the Dash Company. I \r\nwas- did payrolls.  And I gave out uh if anybody didn’t \r\nknow about the place, they’d come and ask me. SO I learned \r\nall about how the operations were and I check all the- each \r\ndepartment had to make out their own payrolls but I had to \r\n----------------Page (14) Break----------------\r\n 16 \r\nproof them before they’d let them through. Make the checks \r\nout. \r\n \r\nDe Mare: Now um, and I don’t know if you can answer this \r\nquestion but it’s a question that’s been on my mind when \r\nyou talk to the women about going into working in- you \r\ndidn’t have a family at that point. You were single, you \r\nwere still a young girl at that point.  Do you know what \r\nthe women did who had children and families? Like how they \r\ndealt with have kids and going to work when there was no \r\none to take care of the kids? \r\n \r\nMason: You couldn’t. \r\n \r\nDe Mare:  You couldn’t.  I’ve just been wondering about \r\nthat because I know so many women went to work- \r\n \r\nMason: No, they started after World War II. \r\n \r\nDe Mare: I was just curious- \r\n \r\nMason: You had to do the best you could but you stayed home \r\nand took care of your children. \r\n \r\n----------------Page (15) Break----------------\r\n 17 \r\nDe Mare: So you talked a little bit about the attitude um \r\nyou know you weren’t supposed to work with men in an \r\noffice, this was after the war.  During the war, when you \r\nworking side-by-side with the men, did you have any trouble \r\nwith them? Did you have any challenges? \r\n \r\nMason: No. no. \r\n \r\nDe Mare: No. Nothing. \r\n \r\nMason: They were willing to show anything that I wanted. \r\nThey all knew me down at the plant. No matter which \r\nbuilding I was in. They- the two lift operators were having \r\nand argument and uh I had gone to help the girl out who \r\nchecked out the aluminum sheets because they were behind.  \r\nAnd uh, they had European A-frame. They bent her leg up- \r\nyou know bit the bottom leg. But I hollered for them to \r\nstop and they didn’t pay me any mind and I screamed just as \r\nloud as I could and that got their attention. And several \r\nof the bosses from the main plant come running- they \r\nthought I was about half dead. They came in and saw that \r\nnothing was wrong with me and said, “Idamae, what’s the \r\nmatter?” And I said, “Well, they wouldn’t pay any attention \r\nto me and they were bending that girls leg. I said I \r\n----------------Page (16) Break----------------\r\n 18 \r\nthought they were going to break it.” So they- I screamed \r\nto get their attention.  I didn’t dream that they could \r\nhear it all the way to the other building. \r\n \r\n24:13:08--------------------------------------------------- \r\n \r\nDe Mare: That’s a wonderful story. \r\n \r\nMason: Everybody was extremely nice to me. \r\n \r\nDe Mare: It’s interesting because we hear that a lot but \r\nalso that there was this feeling that you weren’t supposed \r\nto work with men because it was so dangerous, or it was not \r\nlady like and yet you’re in the plant and everyone seems to \r\nthink- you know. Now was there any kind of labor union \r\nwhere you were? Was there any kind of- was there a labor \r\nunion? Were you a member of the union when you worked or \r\nno? \r\n \r\nMason: No. \r\n \r\nDe Mare: No, ok so there was no union. \r\n \r\n----------------Page (17) Break----------------\r\n 19 \r\nMason: No, inspectors and uh the ones, the different \r\ndepartment heads were under a ten thousand dollar bond. So \r\nuh when people would come in visitors you know walking \r\naround and ask me uh, what I was doing and I would say if \r\nyou want to know you’re going to have to ask my boss. And \r\nuh, so well uh, you can’t tell me what you’re doing? I \r\nsaid, I told you- you have to ask my boss if you want to \r\nknow anything about it because they were slipping out, \r\nblueprints and things. And there was a lot of stealing \r\ngoing on when it first opened up.  What they would do, they \r\nsome of them would you know steal what you call silverware \r\nnow, they would take rolls of paper- toilet tissue and wrap \r\nit around their body to go through. They final had to get \r\nwomen to check the women because the men weren’t supposed \r\nto touch the women. \r\n \r\nDe Mare: That’s interesting.  So they had a lot of theft \r\nfrom the factories. \r\n \r\nMason: And they found out that they were sneaking out \r\nblueprints and selling them. There were three German \r\nsubmarines in the gulf and a Coast Guard could only go so \r\nfar out and they would come almost to the Coast Guard.  \r\nWhat they wanted to do was to get in the land.  They knew \r\n----------------Page (18) Break----------------\r\n 20 \r\nwe were getting the castings and forgings, nuts and bolts \r\nfrom Birmingham so they could come to Birmingham and bomb \r\nthem.  To keep, so we wouldn’t have anything to work with. \r\nAnd they dynamited the levee twice. They wanted to just \r\nwash us away but they threw bags of seamen in too and then \r\nthey built it up for two Jeeps.  They’d meet in the center \r\nand they’d patrol 24 hours a day.  \r\n \r\nDe Mare: Just if there was anything else you want to say \r\nabout that time in your life. Just from your own \r\nperspective, anything that you wish people knew? \r\n \r\nMason: Well, not off hand. \r\n \r\nDe Mare: That’s ok.  You did wonderfully.  This was lovely. \r\nIt was really lovely to get to meet you a little bit. And I \r\nloved your stories, I really did. I really loved your \r\nstories so thank you so much. \r\n \r\nTHE END. \r\n----------------Page (19) Break----------------\r\n"}