{"id":"mabel-myrick","identifier":"ROSIE_INTERVIEW_027","hash":"rosie","url":"http://127.0.0.1:8080/interviews/mabel-myrick","label":"Mabel  Myrick","description":"Maybel Myrick worked as a secretary in the War Department of the Pentagon until the war ended.  ","image":"http://127.0.0.1:8080/images/ROSIE_INTERVIEW_027-interview-thumbnail.jpg","type":"video","content":"Maybel Myrick worked as a secretary in the War Department of the Pentagon until the war ended.   Mabel Myrick \r\n \r\nThe Real Rosie the Riveter Project \r\nInterview 27 \r\n \r\n \r\n \r\nInterview Conducted by  \r\nElizabeth Hemmerdinger \r\nJune 25, 2010 \r\nNashville, Tennessee  \r\n \r\n \r\n \r\nFor The \r\nFor the Tamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n----------------Page (0) Break----------------\r\nInterview: Mabel Myrick \r\nInterviewers: Elizabeth Hemmerdinger  \r\nDate: June 25, 2010 \r\nPlace: Nashville, Tennessee \r\n \r\nMyrick: Mabel Myrick. \r\n \r\nHemmerdinger: Where are you from? \r\n \r\nMyrick: Kimberly, Alabama. \r\n \r\nHemmerdinger: And where do you live now? \r\n \r\nMyrick: In Kimberly. \r\n \r\nHemmerdinger: And where did you grow up? \r\n \r\nMyrick: Right there in Kimberly. \r\n \r\nHemmerdinger: And where did you do the work that you did \r\nduring the war. \r\n \r\nMyrick: I worked as a secretary I the Pentagon building for \r\nthe War Department. \r\n----------------Page (1) Break----------------\r\n \r\nHemmerdinger: What kind of work did you do? \r\n \r\nMyrick: Well I- we typed letters, we typed what we called \r\nuh interoffice memos, we called them endorsements and I \r\nanswered the phone.  I kept up with people in our \r\norganization who were travelling. Uh some of the letters I \r\ntyped were actual letters signed by the Secretary of War, \r\nHenry Stimson. And when my boss dictated those, I typed \r\nthem up; he checked them; we put them in a folder; I took \r\nthem up to the fifth floor to his secretary’s office and \r\nwaited for his signature. And then we brought them back to \r\nour office and we mailed them. \r\n \r\nHemmerdinger: How long were you doing that? \r\n \r\nMyrick: I was there until the war was over.  I went in ’44 \r\nand the war was over, you know in latter part of ’45. And \r\nfrom there I was transferred to Veteran’s Administration.  \r\n \r\nHemmerdinger: And before you got the job at the Pentagon, \r\nwhat were you doing? \r\n \r\nMyrick: Well, I went right out of high school. \r\n----------------Page (2) Break----------------\r\n \r\nHemmerdinger:  How old were you? \r\n \r\nMyrick: 18. Um the government- a representative from the \r\ngovernment came around to our school and offered us to take \r\na test. Those of us who had taken book keeping or typing \r\nand shorthand.  When we took the test, they sent us our \r\nresults and when mine came it had a train ticket to DC. \r\n \r\nHememerdinger: Oh my goodness. \r\n \r\nMyrick: And I thought a lot of my classmates would also be \r\ngoing so I wasn’t really worried. But when I got to the \r\ntrain station there was only one other girl I knew there.  \r\nAnd when we got there she was assigned to the Navy \r\nDepartment doing payroll because had taken book keeping and \r\nI was sent to the Pentagon.  \r\n \r\n02:05:19------------------------------------------------- \r\n \r\nHemmerdinger: So here’s an 18 year old girl leaving home \r\nand uh what was it like, what was your experience like? \r\n \r\n----------------Page (3) Break----------------\r\nMyrick: uh it was a new world. I had four brothers in \r\nservice and my mom and dad did not feel good about me \r\nleaving but they did not try and stop me. In fact, they \r\ngave me the money to go on. So um, yea, we all kept in \r\ntouch with each other that was one thing. Uh my brothers \r\nwrote me and we all wrote home. And but I had- and while I \r\nwas there I was able to see 3 of my brothers but I could \r\nnever get two of them together. And in November my youngest \r\nbrother was killed in France. \r\n \r\nHemmerdinger: November of what year? \r\n \r\nMyrick: 1944. And I had met a young man there that I very \r\nmuch liked.  And he- uh went through Africa and into Italy \r\nand he was killed there so the war was getting very close \r\nto me. \r\n \r\nHemmerdinger: What did it feel like to go from a home that \r\nwas so protected, and you left home with a suitcase? \r\n \r\nMyrick: that’s right. Uh when I was in high school, I was \r\nnot allowed to go to the ball games even though they were \r\nafter class, in the daytime. So I was very sheltered but it \r\nwas a new life, but I tried to remember how I was brought \r\n----------------Page (4) Break----------------\r\nup and I also we had orientation that they warned us not to \r\nbe alone with any of the soldiers or sailors coming through \r\nand not take them home with us because some some bad things \r\nhad happened to some of the girls that took that risk.  So \r\nwe went out in groups. Of course I met a lot of new friends \r\nat work and we would go out in groups and when we dated we \r\nalways double-dated or triple-dated so- \r\n \r\nHemmerdinger: You- these women- these young girls were \r\nfrom- \r\n \r\nMyrick: Other states  \r\n \r\nHemmerdinger: Other states. \r\n \r\nMyrick: I met girls from all over. \r\n \r\nHemmerdinger: Where did you all live? \r\n \r\nMyrick: uh well the government had a place called Arlington \r\nFarms that you could stay but when my classmate and I went, \r\nwe already knew a girl up there and she wanted us to live \r\nwith her until we found a place of our own and we did. And \r\nwe found a place out on End Street, northwest. It had uh a \r\n----------------Page (5) Break----------------\r\nlittle stove, a little sink and a couch that made a bed. \r\nAnd that’s where we lived most of the time I was there. And \r\nit was headed downtown into work. \r\n \r\nHemmerdinger:  And do you have a story for us about what \r\nyour first day of work was like? Or your best day? Or a \r\nchallenging day when they asked you to do something that \r\nyou never thought you were capable of? \r\n \r\nMyrick:  The first day? Uh they sent me to the Pentagon by \r\nbus and I met a lady there on the Concourse who took me to \r\nthe office where I would be. And the office was an open \r\noffice. There were about 12 or more people in management. \r\nMost of them- a lot of them were officers and some civilian \r\nmen and women, a lot of women and one secretary. So there \r\nwas a lot of work.  I had to take dictation. A lot of \r\ntimes, we had to work really late. And my boss thought \r\nnothing of dictating three hours. It can tier your hand. \r\n(laughs) but uh I did enjoy all of it but you know, we were \r\nglad when the war was over so the boys could come home.  I \r\nwas glad for my brothers to come home. \r\n \r\n06:16:12----------------------------------------------- \r\n \r\n----------------Page (6) Break----------------\r\nHemmerdinger: Did you go on working? \r\n \r\nMyrick: When I came home, yea I did. I found a job at- it \r\nwas not as exciting, it was in a jewelry store. In an \r\noffice, in a jewelry store.  \r\n \r\nThe End. \r\n \r\n----------------Page (7) Break----------------\r\n"}