{"id":"marion-yagoda","identifier":"ROSIE_INTERVIEW_031","hash":"rosie","url":"http://127.0.0.1:8080/interviews/marion-yagoda","label":"Marion  Yagoda","description":"Marion Yagoda went to work at age 16 because her father didn't think women needed a high school diploma. ","image":"http://127.0.0.1:8080/images/ROSIE_INTERVIEW_031-interview-thumbnail.jpg","type":"video","content":"Marion Yagoda went to work at age 16 because her father didn't think women needed a high school diploma.   1 \r\nMarion Yagoda \r\n \r\nThe Real Rosie the Riveter Project \r\nInterview 31 \r\n \r\n \r\n \r\nInterview Conducted by  \r\nKirsten Kelly \r\nJuly 12, 2010 \r\nDetroit, MI \r\n \r\n \r\n \r\nFor The \r\nFor the Tamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n----------------Page (0) Break----------------\r\n 2 \r\nInterview: Marion Yagoda \r\nInterviewers: Kirsten Kelly \r\nDate: July 12, 2010 \r\nPlace: Detroit, MI \r\n \r\nKelly: Well, hi. \r\n \r\nYagoda: Hi, how are ya? \r\n \r\nKelly: Good, how are you? \r\n \r\nYagoda: Fine, thank you. \r\n \r\nKelly: Can you start introducing yourself. \r\n \r\nYagoda: My name is Marion Yagoda. Y-A-G-O-D-A. And uh I ma \r\n85 years old and I was Rosie the Riveter when I was 18.  \r\nHow that came about was I was going to school. I was going \r\nto uh um...I’m trying to think of the name of the school \r\nright now.  Um it was a wo—a girls school.  There was a \r\ngirl’s school and there was a boy’s school and the girl’s \r\nschool was on one street and the boy’s school was a few \r\nblocks down. The boy’s school was called Wilber Wright and \r\nthe girl’s school, I can’t remember the name right now, but \r\n----------------Page (1) Break----------------\r\n 3 \r\nthat’s where my mother sent me. After I came from Cash \r\nTech, I went to Cash Tech in the 10\r\nth\r\n grade, and I couldn’t \r\nhack chemistry so my mother put me there and I was um doing \r\nhome ec. and I specialized in dress making and I was \r\nsupposed to go out to work for six months as a dress maker. \r\nAnd then come back and get my diploma and my dad said to \r\nme, “A girl don’t need a diploma.” He said, “How ‘bout \r\ngoing out to work, because we need the money.” So he says, \r\n“Go to work. You really don’t need to get a diploma.” So I \r\nwent—I applied at Bridge Manufacturing.  They had a school \r\nthere.  They were teaching women how to rivet and to buck. \r\nAnd I went to school there, I don’t remember how long I \r\nwent school, but from there I went to Connor’s in Detroit \r\non Connors Avenue and that’s where Bridge Manufacturing was \r\nand that’s where I was Rosie the Riveter. We made wing—wing \r\ntips for B-17s and B-29s. And my partner’s name was Rosie. \r\nSo it just so happened that her name was Rosie so was Rosie \r\nthe Riveter too. And we were making uh the production was \r\nhalf a wing tip a day and we speed it up to two and half \r\nwing tips a day and everybody was mad at us because we \r\nupped the production. And her and I were doing two and half \r\nwing tips on B-17s and B-29s. \r\n And I remember this one story when I was bucking the \r\nrivet I had my hand up and I was bucking the rivet and this \r\n----------------Page (2) Break----------------\r\n 4 \r\nman came along in back of me and hit me on the rear end and \r\nI had a dolly bar in my hand and I took that dolly bar and \r\nthrew it and I missed his hand about half an inch. And so \r\nhe never did that again. \r\n \r\n03:42:11----------------------------------------------- \r\n \r\nKelly: That’s incredible.  Was there at this time, because \r\nit was such a new thing, was there—what were the men \r\nfeeling about all these women? \r\n \r\nYagoda: Well the men that were in there were 4-F because \r\nthey were rejected because they weren’t they weren’t able \r\nto go to war so they were working in the factory along with \r\nthe women but there was more women than there was men \r\nthere. And I remember my mother used to make me a lunch and \r\nshe would put corn in a thermos or tomato soup or some kind \r\nof soup in the thermos.  I never had coffee because I never \r\ndrank coffee then but uh she always put something in the \r\nthermos for me and I loved corn so uh I really looked \r\nforward to those thermos jugs when it came to lunchtime. \r\n \r\n----------------Page (3) Break----------------\r\n 5 \r\nKelly: And what—can you talk about your day? Like how long \r\ndid you work and what was your break like and then how \r\nlong— \r\n \r\nYagoda: Well before I started I used to start at three \r\no’clock in the afternoon. My shift was three o’clock in the \r\nafternoon so instead of going at three o’clock I went at \r\ntwelve o’clock and we had a baseball team and I was the \r\npitcher and played baseball always before we went to work.  \r\nAnd uh we had the girls played against each other. We \r\ndidn’t play with the men. The men didn’t play baseball. It \r\nwas just the women. \r\n \r\nKelly: That’s amazing. So they really...how did that start? \r\nHow did the baseball start? \r\n \r\nYagoda: I don’t know how it started but I remember being a \r\npitcher of the baseball team. And we always played baseball \r\nbefore our shift. \r\n \r\nKelly: That’s amazing, that’s really amazing...It was \r\nprobably also really good morale for all the people \r\nworking. \r\n \r\n----------------Page (4) Break----------------\r\n 6 \r\nYagoda: Yes it was. \r\n \r\nKelly: How was morale at the time? I mean, the war was \r\ngoing on and what were people’s feelings about it? What \r\nwere your feelings at the time? \r\n \r\nYagoda: I remember that I used to write to quite a few \r\nfellas that were in the service that were friends of ours \r\nand friends of my brother. And I used to write to my \r\nbrother. He was in the service. And we used to write \r\nletters to them and uh there wasn’t, there wasn’t there \r\nwasn’t an issue with the morale. There wasn’t an issue with \r\nthe morale.  I don’t remember exactly because it was so \r\nmany years ago. \r\n \r\nKelly: Do you remember some of the things that you would \r\ntry to say in your letters or what were you—or why were you \r\nwriting? \r\n \r\nYagoda: Well to keep up the morale of the young fellas that \r\nwere in the service.  My brother was on the U.S.S. Langley \r\nand that was bombed about three times and he was down the \r\nhole down below and I used to write to him almost everyday. \r\nI used to write a letter to him but he came out of it okay \r\n----------------Page (5) Break----------------\r\n 7 \r\nand came home and became a judge.  He was a lawyer and then \r\nhe became a judge. \r\n \r\n07:35:08-------------------------------------------------- \r\n \r\nKelly: And did you have—did you know anyone else in the \r\nservice at that time? \r\n \r\nYagoda: Oh yea!  I knew about maybe four or five fellas \r\nthat were in the service and I used to write to them. \r\n \r\nKelly: And do you think that’s different than today that \r\nthe morale around? \r\n \r\nYagoda: Well the people were more into the war before the \r\nSecond World War, this time people didn’t do what we did. \r\nWe saved cans, we we recycled everything. We saved our oil, \r\nour cooking oil. We had red food stamps and green food \r\nstamps.  The green food stamps were—the red food stamps \r\nwere for food and the the green fo- stamps were for \r\ngasoline and they don’t do that today. They didn’t ration. \r\nEverything was rationed before and the morale of the people \r\nwere amazing. It really was and they really went along with \r\neverything but not like today. Today people are not like \r\n----------------Page (6) Break----------------\r\n 8 \r\nthat because of the war. They they just think of themselves \r\nand not of what’s going on. \r\n \r\nKelly:  When you—what what was inside the factory like? \r\n \r\nYagoda: We had benches that were about that high and we had \r\nsteps to go up to the benches and the uh the wing tips were \r\nstanding up, straight up and we would work on either side \r\nof each other and sometimes I would rivet, use the drill \r\nmotor and rivet and sometimes she would. We would take \r\nturns riveting and bucking. I remember one time when I was \r\nriveting and I had a big long drill about that long and I \r\nput the drill, I tilted my head to one side and put the \r\ndrill to drill the hole in the aluminum and I co and the \r\ndrill caught in my hair and I took a big chunk out of my \r\nhair.  I still have the scar today up here because of it. \r\n \r\n10:18:06------------------------------------------------ \r\n \r\nKelly: Wow. \r\n \r\nYagoda: I was lucky that I didn’t do more damage than what \r\nI did and because of that they made us wear caps after \r\nthat. \r\n----------------Page (7) Break----------------\r\n 9 \r\n \r\nKelly: Oh so you were the first accident and they really \r\nhad to change. \r\n \r\nYagoda: They changed afterwards and everybody had to wear a \r\nblue cap to cover their hair, all the women had to wear a \r\nblue cap to cover their hair.  Or a bandana and tie it to \r\ntie their hair up. \r\n \r\nKelly: Oh the famous bandana in that poster. \r\n \r\nYagoda: In that poster, right, that poster... \r\n  \r\nKelly: And and what else did you wear? Was was there \r\nuniforms? \r\n \r\nYagoda: No we didn’t have uniforms. I just wore slacks and \r\na top. We didn’t have uniforms. \r\n \r\nKelly: Had you worn slacks before ever? \r\n \r\nYagoda: No, not before that. I started wearing slacks when \r\nis started working in the factory and I started wearing \r\nthem ever since. \r\n----------------Page (8) Break----------------\r\n 10 \r\n \r\nKelly: So we were— \r\n \r\nYagoda: I didn’t only work in the factory, you know as \r\nRosie the Riveter. Afterwards, when I left the factory, I \r\nwas there for a few years and after that I went to the \r\nInduction Center. The Induction Center is where they \r\nbrought the men into the service but where I worked was \r\nwhere the boys came to have lunch and they had lunch free. \r\nBut my dad worked a Wagner Baking Company and Wagner Baking \r\nCompany made pies and my dad would unload his whole truck \r\nthere at this one particular—at the Induction Center. And \r\nall the boys would get a slice of pie.  It cost fifteen \r\ncents. They didn’t have to pay for the meal but they had to \r\npay for the pie. And I was the cashier and I took in the \r\nmoney from the boys from the pie but the meal was free.  \r\nBut I worked there for a while for a couple of years \r\nand then after that I went upstairs. This this was in a \r\nfactory.  There was a factory upstairs from the Induction \r\nCenter and I went upstairs and got a job making parachutes. \r\nNot the parachute itself but the pack for the parachute. \r\nThe parachutes were made there but in in a different \r\nsection than I was working. And I used to make the packs \r\n----------------Page (9) Break----------------\r\n 11 \r\nand put the buttons on the snaps on the packs and we used \r\nto work real fast to really boost up the production. \r\n \r\nKelly: So you were a go-getter because you really tried to— \r\n \r\nYagoda: I did a little bit of everything. \r\n \r\nKelly: And did you stay working through your whole life or \r\num? \r\n \r\nYagoda: I stayed working. When my brother came home from \r\nthe service, my father had—before my brother came home from \r\nthe service, my father had a grocery store, got a grocery \r\nstore but I was working at um J.L. Hudson in the Women’s \r\nHalf Size dresses in the basement. And my father said to \r\nme, “I’m going to open up a store. I’d like you to come and \r\nwork for me.” So I quit Hudson’s, J.L. Hudson’s and went to \r\nwork for my dad. And then when my brother came home from \r\nservice, he took over.  I said, “You can take over my job \r\nnow, I’m going out to work.” So I went to work at Kern’s. \r\nYou remember Kern’s? Downtown Detroit? Kern’s and Company.  \r\nIt was right next door, right across the street form J.L. \r\nHudson. \r\n \r\n----------------Page (10) Break----------------\r\n 12 \r\nKelly: Was it another clothing store? Another— \r\n \r\nYagoda: No, I worked in the lotions department but it was \r\nsomething like J.L. Hudson. \r\n \r\nKelly: And did you stay working when you got married and \r\nhad children. \r\n \r\nYagoda: I didn’t get married until I was 29. I stayed home \r\nwith my parents all that time and I stayed working with my \r\ndad most of the time in the store.  I used to get up and go \r\nto work with him in the market to Eastern Market and get \r\nvegetables to take to the store. \r\n \r\n15:15:04------------------------------------------------ \r\n \r\nKelly: So that was that in a time when most women were \r\ngetting married at 18 19 and you were much more mature and \r\ngrown up and had all of this experience. What was that like \r\nfor you? \r\n \r\nYagoda: Well, I liked it so much at home; I didn’t want to \r\nleave home. Not only that, I didn’t have a steady \r\nboyfriend. I didn’t have a steady boyfriend at the time.  \r\n----------------Page (11) Break----------------\r\n 13 \r\nBut I used to go out with my girlfriends and we’d go out to \r\nthe Grace Dome that they would have dancing there. And \r\nyou’d sit there and wait for a fella to come up to you and \r\nask you to dance.  It was disappointing when they didn’t \r\ncome up and ask you to dance. \r\n \r\nKelly: That was such a time when the music was so much a \r\npart of things. \r\n \r\nYagoda: Oh the music was beautiful. All the big bands that \r\nthey had then. \r\n \r\nKelly: Would you go to dances with live bands? \r\n \r\nYagoda: Yes, yes. They were all live bands at the Grace \r\nDome. \r\n \r\nKelly: So—let’s go back to the time right before Rosie \r\nbecause we’re really trying to get it in the context of \r\nsomeone’s life, the women who were Rosies.  What was your \r\nchildhood like? \r\n \r\nYagoda: I don’t remember too much of my childhood because I \r\nkind of grew up kind of fast. We lived on 17\r\nth\r\n Street and \r\n----------------Page (12) Break----------------\r\n 14 \r\nnext door was my-our neighbors, the Mahurs that lived next \r\ndoor to us on 17\r\nth\r\n. And I went to St. Leo’s School and I \r\nused to walk to school with my neighbor.  Her name was Rita \r\nMahur.  Her and I were friends and we would walk to school \r\nand go over the railroad tracks and walk to school and then \r\nwalk back. And my mother used say to us, “Don’t speak to \r\nstrangers.”  Because that was a time when this one girl was \r\nkidnapped and they put her in a trunk and my mother would \r\nscare us and tell us, “Don’t talk to strangers. Don’t take \r\nanything from strangers. Don’t take any money. Don’t take \r\ncandy so we weren’t aloud to take any of that from anybody. \r\n \r\n17:46:04------------------------------------------------ \r\n \r\nKelly: Was your family originally from Detroit or did they \r\ncome from somewhere else? \r\n \r\nYagoda: My father from came from Lebanon and he was—my \r\nfather and mother were first cousins. My father and mother—\r\nmy father uh my mother came here to visit a cousin and my \r\nfather saw her and followed her to Texas and asked her to \r\nmarry him.  And then they weren’t marrying first cousins. \r\nFirst cousins weren’t marrying because they were Catholic \r\nso my father told the priest, “If you don’t marry us, I’ll \r\n----------------Page (13) Break----------------\r\n 15 \r\nturn Protestant.”  He was Catholic. So the priest married \r\nthem. So they came back to Michigan here and they stayed in \r\nMichigan. \r\n \r\nKelly: And did you have brothers and sisters? \r\n \r\nYagoda: I had two brothers and one sister. \r\n \r\nKelly: And you said you felt you had to be—grow up fast. \r\nWhy did you feel you that you had to grow up fast? \r\n \r\nYagoda: I don’t know...I just felt like things were moving \r\nfast with me.   \r\n \r\nKelly: And can you tell the story about—so your dad wanted \r\nyou to go to work— \r\n \r\nYagoda: Right. \r\n \r\nKelly: He wanted you to stop going to school and not get \r\nyour diploma and then can you say what happened later just \r\nin 2001? \r\n \r\n----------------Page (14) Break----------------\r\n 16 \r\nYagoda: Well he didn’t want me to get a diploma so in 2003 \r\nI decide I wanted to get my diploma before I died so I \r\nlooked up the school, Farmington Community School and \r\nstarted to go there. I went there on Tuesday and Thursday \r\nnights, I drove there. I was 78 years old. I drove there to \r\nschool every Tuesday and every Thursday night until uh \r\nuntil uh I graduated. And when I graduated, I was an A \r\nstudent and I was valedictorian and I made a speech—I \r\ngraduated from Farmington High School. I went to community \r\nschool but our graduation was held at uh at um at \r\nFarmington High. And my teacher was there uh the Mayor of \r\nSouthfield was there, Brenda Lawrence; she came to my \r\ngraduation and Paul Condino who was a representative of \r\nMichigan went to my graduation. And Verde, I believe his \r\nname was Verde uh he was from one of the other communities \r\nall at my graduation. \r\n \r\nKelly: What was that like to stand up in front of everyone \r\nand and finally get that— \r\n \r\nYagoda: Finally get my diploma? It was wonderful. It was \r\nwonderful. And I lived here at the time at the Pocket \r\nTrowbridge, it was called the Trowbridge but other owns \r\nbought it and they call it the Pocket Trowbridge now. But \r\n----------------Page (15) Break----------------\r\n 17 \r\nbefore when it was the Trowbridge they made me a big part \r\nand Brenda Lawrence and Paul Condino all came to my party \r\nhere. \r\n \r\nKelly: And so did you give a speech? \r\n \r\nYagoda: Here? \r\n \r\nKelly: No, at uh as the valedictorian, did you give a \r\nspeech? \r\n \r\nYagoda: Yes, I gave a speech. \r\n \r\nKelly: And and what is one thing that you said? What is— \r\n \r\nYagoda: Well I thanked my family and thanked everybody and \r\nthanked God that I was able to graduate and that I had \r\nalways wanted to graduate. And that my father wouldn’t let \r\nme grad—wouldn’t let me get a diploma. And I finally got \r\none. \r\n \r\nKelly: That’s amazing...that’s an amazing story. \r\n \r\n----------------Page (16) Break----------------\r\n 18 \r\nYagoda: But he had passed away.  My father had passed away \r\nso he didn’t know.  So my son was there and my my uh my \r\ndaughter-in-law and my two grandchildren; they were all \r\nthere.  I have a picture of all of them. \r\n \r\nDe Mare: I think it’s interesting what you said to go back \r\nto when you were in the factory and the time the gentlemen \r\npatted you on the behind— \r\n \r\nYagoda: Uh um. \r\n \r\nDe Mare: And I was wondering if you could talk a little bit \r\nabout the relations between men and women in the factory \r\nand how that was? And you can talk to Kirsten you don’t \r\nhave to look at me. \r\n \r\nKelly: Yea, look at me.  \r\n \r\nDe Mare: But yea just to talk a little bit about that \r\ndynamic.  \r\n \r\nYagoda:  Well the thing is the relationship between the men \r\nand the women was really the men kept to themselves and the \r\nwomen kept to themselves. Nobody intermingled because there \r\n----------------Page (17) Break----------------\r\n 19 \r\nwere all different ages, in fact, there was a woman working \r\nthere that was in her 50s and she was working at the bench \r\nnext to me. And they were all different ages that were \r\nworking there. Not just my age. I was 18 at the time and \r\nshe was 50 and the other women were all different ages.  \r\n \r\nKelly: And were there women who had children? \r\n \r\nYagoda: She had children. She had children, the woman who \r\nwas 50 but I don’t remember too many of them right now \r\nbecause it has been so long ago but she stands out in my \r\nmind. \r\n \r\nKelly: So was there any dating or what was the dating like? \r\n \r\nYagoda: No dating. There was no dating in the factory. \r\nThere wasn’t any of that going on. They were strictly all \r\nbusiness. They all stuck to whatever they were supposed to \r\ndo and they did it.  We had a production of, like I told \r\nyou, of two and a half wing tips a day so that really kept \r\nus busy and we were on our toes. And we really produce. \r\n \r\nKelly: And what would happen at lunchtime? Would all the \r\nwomen go to one place? \r\n----------------Page (18) Break----------------\r\n 20 \r\n \r\nYagoda: No. We all just sat at our benches and ate our \r\nlunch. \r\n \r\nKelly: And how long would you get? A half-hour? Hour? \r\n \r\nYagoda: A half-hour as far as I can remember. \r\n \r\nDe Mare: And can you remember how much money you made? \r\n \r\nYagoda: A $1.39 an hour. I remember that...and that was \r\ngood money back then. $1.39 an hour. \r\n \r\nKelly: And what did you do with your money at this time? \r\n \r\nYagoda: My mother would use my paycheck to run the house \r\nand she took my father’s paycheck, I told you he was \r\nworking at Wagner Baking Company. She took my father’s \r\npaycheck and she saved that and uh took my paycheck and \r\nused it run the house with and she saved my father’s \r\npaycheck and she saved up enough money to buy a house on \r\nOregon. So I worked there quite a while and she took all \r\nthe money that I made and ran the household with it. And \r\nshe used to make...she made-she took piece of cloth about \r\n----------------Page (19) Break----------------\r\n 21 \r\nthat long and about that high (showing) and she made \r\nsections and she would put so much for food, so much for \r\nrent, so much for miscellaneous, so much for \r\ntransportation. And she was a penny-pincher and she knew \r\nhow to save money and she saved up enough money to buy this \r\nhouse on Oregon.  \r\n \r\n26:15:14--------------------------------------------------- \r\n \r\nKelly: That’s amazing. It’s really hard to imagine people \r\ndoing that by being that disciplined today. \r\n \r\nYagoda: And she was and she used to take my brother with \r\nthe wagon. And we were a couple miles from Eastern Market. \r\nShe’d put my brother in the wagon; he was small then and \r\nshe’d take him down, walk down to the market and by the \r\ngroceries and the meat and everything for $5.  She’d come \r\nhome with bags full of food. And she’d pull that wagon with \r\nmy brother and she’d bring it back home. She walked all the \r\nway Eastern Market and back again. \r\n \r\nKelly: Did you have a car at this time? Or how did-- \r\n \r\nYagoda: No. \r\n----------------Page (20) Break----------------\r\n 22 \r\n \r\nKelly: How’d you get to work? \r\n \r\nYagoda: I took the bus and when I came home in the morning. \r\nOne o’clock in the morning...my mother would be there \r\nwaiting for me at the bus stop...every morning.  \r\n \r\nKelly: Was it da—did she feel it was dangerous? \r\n \r\nYagoda: Well there were undesirables living next door to us \r\nand I had a bad experience. I was coming home from choir \r\npractice and I let my friend off at the corner, which was \r\n12 or 15 houses down; we lived in the middle of the block.  \r\nI walked her to I walked form the church to the bus stop \r\nand then I walked home. And as I walked home there two \r\nfellas two and undesirables in the car following me. And I \r\ngot to my porch and start pounding on that door screaming, \r\n“Ma ma ma.” And he followed me up the porch it was a big \r\nlong porch. He followed me up the porch and both my mom and \r\nmy dad came to the door and my dad saw him and my dad \r\nchased him down the alley with a shotgun.  He didn’t find \r\nhim but he chased him down the alley in hi pajamas with a \r\nshotgun. \r\n \r\n----------------Page (21) Break----------------\r\n 23 \r\nKelly: And how old were you when that happened? \r\n \r\nYagoda: I was about 16. So from then on when I came home \r\nfrom work from the factory, I came home at one o’clock in \r\nthe morning. I don’t’ remember if it was one o’clock or \r\nthree o’clock; I don’t remember if it was a 12 hour shift \r\nbut I know we started at three o’clock. And my mother would \r\nalways be waiting for me at the bus stop after that and \r\nshe’d walk me home. \r\n \r\nDe Mare: So you went straight to work out of high school \r\nbefore you graduated?  Can you talk a little bit how you \r\nthink working especially in the war effort, which was such \r\nimportant work, how that changed you? How it affected you? \r\n \r\nYagoda: It didn’t really chance me because that was my \r\nfirst job.  It was my first job working in the factory but \r\nfrom then on I kept on working. \r\n \r\nDe Mare: Did you enjoy that kind of work when— \r\n \r\nYagoda: I enjoyed every bit of what I was doing. In fact, \r\nI’m the type of person who likes a challenge when Rosie and \r\nI boosted the production from half a wing tip to two and a \r\n----------------Page (22) Break----------------\r\n 24 \r\nhalf wing tips I liked the challenges.  Like I said, \r\neverybody was mad at us because of it. But I liked the \r\nchallenge. \r\n \r\nKelly: So what did you do when everyone was mad at you? How \r\ndid you feel? \r\n \r\nYagoda: We didn’t care. We didn’t care. We were doing our \r\nown thing. But I was going to say every time we made a wing \r\ntip we had an inspector come to inspect it and if there was \r\na can in there, they called it a can, where there was uh a \r\nbump we would have to take and repair that. And we would \r\ntake and put a a a not a screwdriver but it looked like a \r\nlittle screw driver and we’d put it in the hole, lift it \r\nup, make another hole and put another rivet in there to \r\ntake the can out. And we would keep that until we got it \r\nright. \r\n \r\nKelly: Was there a feeling at all, what was the feeling \r\nlike in terms of the importance of the job in terms of—\r\nbecause you were making the airplanes that the boys were \r\nfighting— \r\n \r\nYagoda: Right. \r\n----------------Page (23) Break----------------\r\n 25 \r\n \r\nKelly: Right.  Was there a feeling of being a part of that \r\nand that that the detail in each thing was kind of life \r\nlife-saving or— \r\n \r\nYagoda: It was life-saving and that’s why I say whenever we \r\nmade something we’d make sure it passed inspection and it \r\nwas right. \r\n \r\nKelly: So why...so why were we fighting the war? \r\n \r\nYagoda: Why? \r\n \r\nKelly: Yea just from your mother. It’s great to hear. \r\n \r\nYagoda: Because Hitler had invaded Germany or had invaded \r\nthe United States and then when Japan—when they had uh uh \r\nwhat was that? \r\n \r\nKelly: Pearl Harbor. \r\n \r\nYagoda: Pearl Harbor. When they had Pearl Harbor that was \r\nabsolutely devastating. That was absolutely devastating and \r\n----------------Page (24) Break----------------\r\n 26 \r\nthen to send our boys over there. So many of them went form \r\nhere to over there to fight. \r\n \r\n32:46:03--------------------------------------------- \r\n \r\nKelly: To Europe or to Japan or to Okinawa? \r\n \r\nYagoda: To Europe and to Okinawa. And then when they had \r\nthe atomic bomb, that’s what stopped it. I think it was \r\nTruman wasn’t it who Ok-ed the atomic bomb.  We were glad \r\nof that. \r\n \r\nKelly: Is there anything that you think you learned from \r\nbeing a Rosie? \r\n \r\nYagoda: Rosie the Riveter? \r\n \r\nKelly: Yea. \r\n \r\nYagoda: Well, I am very proud to have been a Rosie the \r\nRiveter and I am glad because it stuck with me for the rest \r\nof my life and I never forgot it. And I was glad I was a \r\npart of the war effort. I am glad I’m a part of history. \r\n \r\n----------------Page (25) Break----------------\r\n 27 \r\nKelly: Yea... \r\n \r\nDe Mare: And what was it like to be a young person with all \r\nthe activity of the war around you in Detroit you know?  \r\n \r\nYagoda: You see, my father and my mother were um my father \r\nand mother were kind of strict so we never got out and \r\naround and about so I really don’t really know how things \r\nwere but I know one thing, Belle Isle today is nothing like \r\nwhat it was. We used to go to Belle Isle and sleep there \r\nwas too hot. My uncle took us out in his truck one day and \r\ntook us to Belle Isle and slept on this side of Belle Isle \r\nbecause we had no air condition. And the people were all so \r\nfriendly and so together much more so than they are today. \r\nEverybody worked together as a as a team. That’s how people \r\nwere. \r\n \r\nThe End. \r\n \r\n----------------Page (26) Break----------------\r\n"}