{"id":"susan-taylor-king","identifier":"ROSIE_INTERVIEW_006","hash":"rosie","url":"http://127.0.0.1:8080/interviews/susan-taylor-king","label":"Susan Taylor King","description":"Susan discusses racial segregation at Eastern Aircraft and her role in the struggle to desegregate the defense industries in Baltimore.","image":"http://127.0.0.1:8080/images/ROSIE_INTERVIEW_006-interview-thumbnail.jpg","type":"video","content":"Susan discusses racial segregation at Eastern Aircraft and her role in the struggle to desegregate the defense industries in Baltimore.  \r\n \r\n \r\nSusan Taylor King \r\n \r\nThe Real Rosie The Riveter Project \r\n \r\nInterview 6 \r\n \r\n \r\n \r\n \r\n \r\n \r\nInterview Conducted by \r\n \r\nAnne de Mare & Kirsten Kelly \r\n \r\nApril 16, 2010 \r\n \r\nBaltimore, Maryland \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\nFor The \r\n \r\nTamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n----------------Page (0) Break----------------\r\nInterview: Susan Taylor King \r\n \r\nInterviewers: Anne de Mare & Kirsten Kelly \r\n \r\nDate:  April 16, 2010 \r\n \r\nPlace:  Baltimore, Maryland \r\n \r\n \r\n \r\n \r\nDe Mare: Just to begin, um, can you introduce yourself, \r\ntell me your name and tell me when you were born. \r\n \r\nKing:  I am Susan Taylor King, born July 13, 1924, and uh, \r\na place called Kilmarnock, Virginia, that’s northern \r\nVirginia. \r\n \r\nDe Mare:  Can you describe your childhood a little bit? \r\n \r\nKing:  As a child I came into the household of, I was the \r\nsecond child, mother and father, we lived with our \r\ngrandparents for a while, in a small house.  Then, Daddy \r\nbuilt us a bungalow with two acres of land, and I lived \r\nthere with three, four other children, my mother had had.  \r\nMy mother was a homemaker all of the time.  We loved to do \r\ngarden, pick flowers, pick berries, and play in the yard \r\nwith my brother.  When I be- was, oh, about fifteen years \r\nold, my parents decided that that wasn’t a place to raise \r\n----------------Page (1) Break----------------\r\nchildren.  So Daddy heard about, uh, his friends in \r\nBaltimore making five dollars a day, and he was making only \r\none dollar, so he put all four of us in a car and drove us \r\nto Baltimore.  We lived with our cousin in a small \r\napartment until we were able to get our own.  We enrolled \r\nin the school system in Maryland, and I finished Doug, \r\nFrederick Douglass High School.  I was in the class of the \r\nfirst graduate of a three-year course because the war had \r\nbegun.   \r\nIn 1941, another baby came so we became a family of \r\nsix.  And, uh, after I finished high school, I was seeking \r\nemployment because I really wanted to be a nurse or a \r\nteacher.  I thought that was a way to get out of poverty.  \r\nI went to look for a job.  Jobs were hard to find, and for \r\na girl at eighteen years old without any typing ability, \r\nthat’s what they called it back in the day.  And I decided \r\nI did not want to be a housekeeper, and I did not want to \r\nmarry, so three, two other girls and I went to what we \r\ncalled the Defense Training School.  While we were at the \r\nDefense Training School, we took the trade of riveting.  \r\nAnd that landed us at Boring Highway, in the old Chevrolet \r\nPlant, uh, riveting.  That’s how Rosie the Riveter came \r\ninto my life.  At that time it wasn’t important except that \r\nwe were riveters, we were doing something, and making more \r\n----------------Page (2) Break----------------\r\nmoney than anybody in our family.  We actually made more \r\nthan our parents at that time. \r\nSo we began saving bonds, and they planned marriage \r\nand I planned college.  But I was on the job and the only \r\nway I, the only way out was to say I was going to be a \r\nnurse.  So I politely wrote that I was going to be a nurse, \r\nI was going to Hampton because Hampton was, uh, training \r\nyoung women to be nurses in the army, in the segregated, of \r\ncourse, army at that time.  When I got there I decided I \r\nwanted to be a social worker.  This was the story of my \r\nlife, so we got out of that, while at Hampton, uh, one of \r\nmy sisters became ill with a tumor of the brain, and \r\n(unintelligible) came with the economy again and so I came \r\nback home and helped the family at this time.  I took a job \r\nas, what was that, a nurse, a nurse’s assistant, for...   \r\n \r\nKelly:  Can we stop? \r\n \r\nDe Mare:  Yes. \r\n \r\n00:03:53:15------------------------------------------------ \r\n \r\nDe Mare:  Do you wanna continue just to tell the story \r\nright now, or do you want me to go back and ask you some \r\n----------------Page (3) Break----------------\r\nquestions about what you’ve already talked about?  There’s \r\na couple things you said that are really interesting.   \r\n \r\nKelly:  Let’s go back.  Yeah. \r\n \r\nUnseen:  Yeah, let’s go back. \r\n \r\nDe Mare:  Yeah.  Um, you said that you decided that you \r\ndidn’t want to marry.  Can you tell me why that is? \r\n \r\nKing:  I didn’t want to marry young, ‘cause I’d seen enough \r\nyoung mothers with a house full of babies, and wonderin’, \r\nthey had to come out here, we used to call out here, this, \r\nthis particular neighborhood wasn’t developed at the time.  \r\nBut there was a place in the valley that all the young \r\ngirls who didn’t have anything to do, the only jobs we had \r\nhere would be housekeepers and nurses, uh, maid.  Not \r\neveryone, I had enough sisters and brothers, and I really \r\ndidn’t want to be a nursemaid.  A cook, a housecleaner, \r\n‘cause I’m not good at those things, and I didn’t want to \r\ndo it for a living.   \r\n \r\nDe Mare:  Do you remember when you were that age what you \r\ndid want to do?  What you thought you would, if you could \r\n----------------Page (4) Break----------------\r\nlook at your future back then, do you remember what you did \r\nwant to do? \r\n \r\nKing:  I want, I’ve always wanted to be a professional, and \r\nI always wanted to marry a man with more education than I \r\nhad so he’d make a bigger salary and we could have a home \r\nto live in, support our children.  \r\n \r\nDe Mare:  That’s kinda what happened, isn’t it? \r\n \r\nKing:  Yes, it is. \r\n \r\nDe Mare:  Um, can you talk a little bit about when you were \r\ndown in Virginia, ‘cause you said that, you know, you were \r\nvery poor down in Virginia.  What did your father do for a \r\nliving?  Can you talk a little about the home life when you \r\nwere very young, before you moved to Maryland? \r\n \r\n00:05:23:00------------------------------------------------ \r\n \r\nKing:  Oh.  When we were in Virginia, Daddy was what they \r\ncall a seasonal worker.  In the summertime, he worked on \r\nthe waters, fishing or crabbing.  And uh, in his spare \r\ntime, he would do, working as a gardener.  He worked for Du \r\n----------------Page (5) Break----------------\r\nPont, I guess you’ve heard of the Du Ponts?  Yes, at Du \r\nPont, they bought an estate down there in Virginia, and my \r\ndaddy was one of the people who did the lawns, and kept the \r\nlawns and the place going.  And then when the, the boats \r\nwent out to sea, he would go out to sea and catch fish and \r\nwork at the wharf, and that type of thing. \r\n \r\nDe Mare:  Ok, and your mother was at home because you had a \r\nlot of brothers and sisters? \r\n \r\nKing:  Yes.   \r\n \r\nDe Mare:  Ok, and what did your, um, what did your other \r\nbrothers and sisters do? \r\n \r\nKing:  Of the, uh, brothers and sisters, uh, one sister \r\nwas, is a, well, she’s dead.  One sister’s a nurse.  One \r\nsister died early on, with a tumor of the brain before she \r\nwas able to do professional work.  Her idea was to be a \r\nnurse, but she died of cancer of the brain.  Uh, sister, \r\nother sister became a teacher, got a master’s degree at N... \r\nfinished Morgan, master’s degree at NYU and taught in New \r\nYork for 32 years.  She passed in 1985.  Um, my uh, third \r\nsister became a nurse here in Baltimore, she went to the \r\n----------------Page (6) Break----------------\r\nhospital and did nurse training, and worked in Boston, (I \r\nmean) Baltimore, went away to Rochester, New York, raised a \r\nfamily, and worked as a nurse.  She’s back here now in \r\nretirement. \r\nMy fourth sister finished Morgan in chemistry, and she \r\nwent to California and worked as an engineer.  She’s back \r\nhere in retirement.  My brother, the oldest of the family, \r\nnever wanted to go to school, so he followed Daddy’s \r\nfootsteps when we came to Baltimore working at the \r\nwaterfront.  And uh, retired as a grass keeper, caretaker \r\nof grass, whatever.  He was married and had five children.  \r\nMy one sister was married and had three children.  I was \r\nmarried and had two children.  They were the grandchildren \r\nof the family.  Both parents died at, I would think by \r\ntoday’s marker, at an early age.  My daddy died at 77 with \r\na heart condition.  My mother died at 78 with multilyomeia, \r\na cancer condition of the spine.  So us, the four of us \r\nliving, kind of stuck together until tragedy came and my \r\nsister died five years ago, leaving now three girls.  So \r\nthat’s where we are with the family.   \r\n \r\n00:08:20:00------------------------------------------------ \r\n \r\n----------------Page (7) Break----------------\r\nDe Mare:  Did you ever think when you were younger that you \r\nwould all, that you would all do as well as you did?  I \r\nmean, it’s extraordinary, actually.  It seems like you \r\nmoved a great distance. \r\n \r\nKing:  Oh, no, not really.  I had a, some role models down \r\nthere in Virginia who were, some cousins who’d gone to \r\ncollege.  But as the war came, people became more affluent, \r\nand uh, when I go back down there now to visit an aunt who \r\nis 97 years old, some, some of the (young), people I grew \r\nup with are, have gone to college.  In fact, I know a \r\nfamily, there were ten, ten children and all ten of them \r\nwent to college; went to Hampton and Virginia State.  So \r\npeople are moving on.  Don’t know what you’re going to go... \r\nwhere you’re going.   \r\n \r\nDe Mare: Um, can you, uh, can we talk about your, your \r\nearliest work experiences?  Was the, was the job in the \r\ndefense plant your first job? \r\n \r\nKing:  Yes, it was. \r\n \r\n----------------Page (8) Break----------------\r\nDe Mare:  And can you talk about what it was like as a \r\nyoung woman to um, to earn your first money and to, uh, \r\nwhat that meant to you when you were that old? \r\n \r\nKing:  Well, I repeated to myself, when I get enough money \r\nI’ll have more than two pairs of shoes.  Because when I was \r\nyoung we had a pair of shoes to wear to school and a pair \r\nto wear to church.  So my dream was to have more than two \r\npairs of shoes.  So when I got my first money, and I’d more \r\nthan two skirts, two blouses, so when I got my first money, \r\nafter I (paid) bought the war bond, gave Mother some, I \r\nwould buy a piece of clothes for my wardrobe.  Never very \r\nextravagant but I always built my wardrobe up.  And that \r\nwas it.  You hadn’t had money, I wasn’t going to spend it \r\nin junk.   \r\nBut I was going downtown, and of course you don’t know \r\ndown... Baltimore was one of the most segregated northern \r\ncities.  People of color could not try on clothes downtown, \r\nso there were stores on what we call Pennsylvania Avenue \r\nthat sold label clothes and very good clothes.  My mother \r\nalways steered us to Pennsylvania Avenue to buy the clothes \r\nbecause downtown you could buy clothes, you couldn’t try it \r\non.  If you bought it and it didn’t fit even you couldn’t \r\ntake it back.  And some stores we, you couldn’t even go \r\n----------------Page (9) Break----------------\r\ninto downtown.  I remember the experience because I never \r\nhad it growing up, but I remember going into a, trying to \r\ngo into a store downtown, and uh, the saleslady said, “We \r\ndon’t serve you black folk here” and uh, my sister and I \r\nhad to go out because we didn’t want to be arrested.   \r\nAlso downtown, back in the day, if we wanted to eat we \r\nhad to stand up.  That’s what people don’t talk about in \r\nBaltimore.  We had to stand at a sp... specific counter, at \r\nthe lunch counter, just to buy a hot dog.  So people went \r\ndowntown but there were many reasons why, and I do believe \r\nI, I’m trying to remember, but I do believe we had a water \r\nfountain even in Baltimore saying, I know they had it in \r\nAnnapolis, saying either “white” or “colored” or “black” \r\nand “white”; that was downtown Baltimore.  So it was very, \r\nvery, uh, segregated, that social and cultural area of \r\nBaltimore was.   \r\nThere were places in Baltimore that they didn’t,  \r\neven the big park, they didn’t even want, they had a black \r\narea for, Druid, Druid Hill Park, and a white.  And I \r\nremember very vividly my uh, uncle, was very irate and I \r\nwould say today he would be a racist, if he was Malcolm X \r\nhe woulda’... ‘Course he’s my brother, Mother’s brother, so \r\nhe’s long since dead.  But I remember he was walking \r\nthrough Druid Hill Park and they arrested him because they \r\n----------------Page (10) Break----------------\r\nsay he walked in the, uh, white section.  So he had to stay  \r\nin jail overnight until somebody got him out.  And of \r\ncourse his reason was that maybe, he didn’t have any \r\nreason, maybe he had been drinking or something, walking \r\nfrom his girlfriend’s house. \r\nSo that’s one part of Baltimore that people don’t want \r\nto dwell on.  Of course, when I came here I did attend the, \r\nuh, inte- the segregated high school.  There were two, two \r\nhigh schools in Baltimore, see, Dunbar on the east side and \r\nDouglass on the west side.  Our teachers were very, very \r\nwell trained, because University of Maryland would not \r\nallow teachers, uh, people to go, people of color there, so \r\nthe people of color who had finished Morgan or Kappen State \r\nor Boeye, uh, the eastern shore school, Maryland would give \r\nthem scholarship to go to Chicago, New York, Pennsylvania, \r\nanywhere you want to get your master’s degree.  Therefore \r\nwe had a select group of teachers teaching us.  Our black \r\nteachers prob- were probably more educated than the white \r\nteachers because we did not have to pay for a higher \r\ndegree.  That was, they were the people who taught me.  And \r\nI felt that I had a very good education here in Baltimore.   \r\n \r\n00:13:46:08------------------------------------------------ \r\n \r\n----------------Page (11) Break----------------\r\n \r\nDe Mare:  It’s really, it’s really interesting.  It’s \r\nreally important to, to get that stuff out there because \r\npeople don’t talk about it anymore. \r\n \r\nKing:  I don’t even know if people know about it. \r\n \r\nDe Mare:  Do you remember, um, I want to go back to, I want \r\nto talk about segregation in the work place.  Um, you \r\nworked at Eastern... \r\n \r\nKing:  Aircraft. \r\n \r\nDe Mare:  Aircraft.  Um, and you started working there in \r\nwhat year?  Do you remember? \r\n \r\nKing:  Uh.  Forty-two. \r\n \r\nDe Mare:  And were there, were there, uh, were the, were \r\nthere other black women working there and black men working \r\nthere at the time, and was that a new thing for Eastern \r\nAircraft?  Do you remember back to that time? \r\n \r\n----------------Page (12) Break----------------\r\nKing:  Uh, being uh, eighteen years old when I went there, \r\nI guess my mind wasn’t really focused on the soc... social \r\naspect.  But Eastern Aircraft was a new plant, it was owned \r\nby the Chevrolet Plant, as I have heard people say, and, \r\nuh, the federal government bought it as a defense plant to \r\nmake planes or small parts for planes.  So with Eastern \r\nAircraft itself was completely integrated, I wasn’t the \r\nfirst work... black worker there but the, the black people \r\nand the white- everybody intermingled.  Uh, public \r\ntransportation was integrated, always, in the state of \r\nMaryland, so you did not feel the prejudice anywhere in my \r\nfirst work place.   \r\n \r\nDe Mare:  Ok.  And was the, um, supervising, um, the \r\nworkers were integrated, male/female, black/white...- what \r\nwas the, what was the management like?  Do you remember? \r\n \r\nKing:  If I can remember back... All white, I’m sure.  Maybe \r\nafter I left, because I was there in the early years, maybe \r\nsome black people rose to be supervisors or whatever, \r\nbecause we were all on the ground floor to begin with. \r\n \r\nDe Mare:  Right.   \r\n \r\n----------------Page (13) Break----------------\r\nKing:  Because I was actually taught riveting by a black \r\nforce, people who had, men who had finished Hampton, or \r\nagricultural schools in the southland and they had come \r\nhere to teach and they were all black so I’m sure before \r\nthis whole thing was over, we did have blacks who had, uh, \r\ncome up through the ranks.  That I’m not too sure but I \r\ndon’t know, I would just suspect. \r\n \r\nDe Mare: And when you went to the training school, you said \r\nyou were taught by black men, was your training.... \r\n \r\nKelly:  Sorry, can we... let’s... \r\n \r\n00:16:01:18------------------------------------------------ \r\n \r\nDe Mare:  So, uh, I just want to go back to, you said that, \r\nthe, the, that when you learned how to rivet you were \r\ntrained by black men... \r\n \r\nKing:  Yes. \r\n \r\nDe Mare:  Only black men.  Was your training school \r\nintegrated or segregated?  Did you... \r\n \r\n----------------Page (14) Break----------------\r\nKing:  Segregated.  We, I lived in segregated Baltimore \r\nwith education, so the uh, training school was on \r\n(Wayshus?) Street and Freemont Avenue, completely in the \r\nblack neighborhood. \r\n \r\nDe Mare:  Ok.  I just wasn’t sure because it was defense \r\ntraining, not high school, if it was also that way. \r\n \r\nKing:  Yes.   \r\n \r\nDe Mare:  Um, do you remember how much you got paid when \r\nyou worked? \r\n \r\nKing:  What, Camille, what did...?  That lady said, she said \r\ns‘bout fifty-seven dollars a week... I really don’t recall \r\nback that far. \r\n \r\nDe Mare:  But it was a lot of money at the time? \r\n \r\nKing:  Yeah, it was. \r\n \r\nDe Mare:  And you said, you made a, you made a statement \r\nthat I thought was so interesting, that when you went to \r\nwork you earned more than your parents were earning. \r\n----------------Page (15) Break----------------\r\n \r\nKing:  Yeah, because at the time, see my daddy wasn’t a \r\nhigh school graduate.  And uh, even though he worked on \r\nthe, uh, where’d Daddy work?  Down in the shipyard or \r\nwaterfront, he probably, his salary probably wasn’t any \r\nmore than mine.  Sixty dollars a week.  Unless he worked \r\novertime.   \r\n \r\nDe Mare:  And you were still living at home at that time? \r\n \r\nKing:  Yes I was. \r\n \r\nDe Mare:  Okay. \r\n \r\n00:17:11:01------------------------------------------------ \r\n \r\nDe Mare:  Um, can you just, can we kind of go to a \r\ndifferent idea, which is: can you explain to me exactly \r\nwhat you did?  Can you explain how a person riveted and \r\nwhat you worked on and the aircraft that you worked on?  \r\nCan you talk just a little bit about, whatever you remember \r\nabout actually working.. \r\n \r\n----------------Page (16) Break----------------\r\nKing:  I didn’t really (unintelligible)...  But uh, I worked \r\non the part of the plane was called the elevator, somewhere \r\non the wing of the old fashioned plane.  It was something \r\ncalled a elevator that, uh, monitored the way, the level \r\nthe plane was going in the air.  And I was holding the \r\nrivet gun, putting the rivet in the hole, and my girlfriend \r\nwas behind holding a bar called ‘buckin’ the rivet’, and \r\nthe rivet had to be a certain distance inside and a certain \r\ndistance from the bottom. \r\nIf the rivet was flawed, your supervisor was always \r\nover your head because he said, “You cannot dent this \r\naluminum.”  A, a small crack in the aluminum  would cause \r\nthe planes to come down.  So I was the riveter.  My \r\ngirlfriend was on the back, called ‘the buckin’, so we \r\nwould have breaks every so often during the day so we \r\nwouldn’t get tired or nervous...  and I guess that’s about... \r\nwhere the elevator of the plane is I really don’t know, but \r\nI worked on the small parts.   \r\n \r\nDe Mare:  That’s a lot of pressure on a person, if you know \r\nthe plane’s gonna go down if that rivet isn’t right!   \r\n \r\nKing:  Yeah, it was, I don’t know. \r\n \r\n----------------Page (17) Break----------------\r\nDe Mare:  That’s a lot of pressure.  Um, do you remember \r\nhow you got the job in the factory?   \r\n \r\nKing:  After I finished the defense training school I \r\nfilled out an application.   \r\n \r\nDe Mare:  And you said that Eastern Aircraft was, was \r\nintegrated? \r\n \r\nKing:  Yes. \r\n \r\nDe Mare:  Were the other factories in the area integrated?  \r\nCan you talk about what that dynamic was?   \r\n \r\nKing:  I, I’m sure I really don’t know.  I was eighteen \r\nyears old but I’m sure the shipyard and the Martin and \r\neverybody... I never heard anybody say that they were not \r\nintegrated- the factory work.  It wasn’t the factory in \r\nBaltimore, maybe the, the black employees didn’t get up the \r\nladder as high, but Baltimore was socially integrated.  \r\nThat has to do with trying on clothes and drinking and \r\nwhatever.  We all, we traveled on buses and streetcars; we \r\ndidn’t have to go to the back. \r\n----------------Page (18) Break----------------\r\nAnd we had in our neighborhood, we had our grocery \r\nstores, we could go to the market and stuff like that.  It \r\nwasn’t, uh, economics.  And it was, but it was socially, \r\nand I think if you had listened carefully to what you were \r\nhearing yesterday some of those ladies, they still have \r\nthis little social thing.  For instance, where I’m living \r\nnow, this is a Jewish neighborhood.  And if you come over \r\nhere on Fridays you don’t see anything but people going to \r\nchurch.  Friday and Saturday, whole street, all up and down \r\npark everywhere I lived, and we the only, this side is \r\nblack; in back’s a big Jewish home, across the street \r\nthey’re all Jewish Rabbis.  So downtown where I lived, um, \r\nthey weren’t, uh, Jewish, they were um, they were \r\nProtestant white.  And but, when the blacks moved in, they \r\nmoved out.  So it’s that kind of prejudice you find here in \r\nBaltimore.   \r\n \r\nDe Mare:  Yeah. \r\n \r\n00:20:45:27------------------------------------------------ \r\n \r\nKelly:    So, um, you were saying that, uh, which I, you \r\nknow I’m not, I’m not from a city or I’m not from \r\n----------------Page (19) Break----------------\r\nBaltimore.  I’m from a farm.  So you were saying that some \r\nof the ladies, yesterday there was still, they still... \r\n \r\nKing:  Yeah. \r\n \r\nKelly:  ...hold on to a social thing? \r\n \r\nKing:  She, she shook her head, she agrees with you, you \r\ncan pick it up, you could...  \r\n \r\nKelly:  How, what do you mean, just so I understand, what \r\ndo you...  just something... \r\n \r\nKing:  Tell us something, there’s something... \r\n \r\nUnseen:  You tell them.   \r\n \r\nKing:  Oh, oh, uh, there’s, there’s some level of... now.  I \r\nmust say, say the Rosie’s are very graceful, gracious to \r\nme.  They have accepted me full and whole-heartedly.  And I \r\ndon’t depict racism in the group as such.  And it wasn’t \r\nthat they invited me, I heard about the group and went \r\ninto- like infiltrating- but there are certain things that \r\nthey could say that you could see that they actually grew \r\n----------------Page (20) Break----------------\r\nup in a kind of racist society.  And of course the lady \r\nyesterday kept referring to Washington- I don’t know what \r\nwas on her mind- and when I told her war was wrong \r\nregardless of who, then she went to quote the bible on me, \r\nthat there be wars and rumors of wars, which meant that she \r\nis not in tune with what’s going on with black America or \r\nany other liberal America today.  And uh, I go on laughing, \r\nand keep on going.   \r\n \r\nDe Mare:  That was a very interesting moment yesterday. \r\n \r\nKing:   It was.  And I, I went to a meeting down on the \r\nport, and the woman had my (BLEEP)... I shouldn’t call her a \r\nname but anyway...  \r\n \r\nDe Mare:  We’ll take it back... \r\n \r\nKing:  But she had our table set up and when I walked up \r\nand said, “I’m Susan King” she looked over my shoulder, she \r\nsaid, “Mrs. King?”  I said, “Yes.” “Oh, I did not know.”  \r\nAnd I said, “Sure, you did not know that they had black \r\nRosies at Eastern Aircraft, did ya?.”  And she just turned \r\nred and kept on going.  But I’m sure she expected Susan \r\nKing coming from Zone Fifteen to be anything other than \r\n----------------Page (21) Break----------------\r\nblack.  But they’re usually very gracious when I do show \r\nup, and uh, we’ve been to many things.  And, uh, we’ve \r\nalways been embraced very warmly.  But it’s the old \r\nBaltimore spirit.   \r\n \r\n00:23:20:00------------------------------------------------ \r\n \r\nDe Mare:  Do you feel like... Can you talk a little bit about \r\nafter the war, um, you know after... when you worked at \r\nEastern, you were working alongside everyone: men, women, \r\nblack, white, you were, you know, the effort was for the, \r\nyou know, to build the aircraft, and yet you left before \r\nthe end of the war... \r\n \r\nKing:  Yeah. \r\n \r\nDe Mare:  ‘Cause you wanted to go to nursing school.  But \r\ndo you remember what the... did you feel like after the war... \r\nwere the relations between working men and working women, \r\nblack and white, were they the same as...?  Can you talk to \r\nthe change after the war, when that need, do you understand \r\nwhat I’m asking, I’m trying to get a handle on, you may not \r\nbe the right person to ask ‘cause you were not still in the \r\nfactories, but I’m just wondering if you, ‘cause you have \r\n----------------Page (22) Break----------------\r\nyour pulse on what the energy in Baltimore was like.  Did \r\nsegregation become worse after the war?  Was there an \r\nintroduction that it got a little better after the war?  \r\nBecause people had been working together?  Can you just \r\nspeak to that at all? \r\n \r\nKing:  Uh, after the war I actually did not go into the \r\nlaboring force.  My, my pursuit after the war was to get \r\ninto a, an intellectual force.  We had our own separate s... \r\nss..., uh, schools and whatever, I’ve told you that, but as \r\nfar as the work force... \r\nI think my father still, when the war was over and the \r\nshipyard was over, he found a job as a repairman, at \r\nWestern Auto.  The social thing in Baltimore remained the \r\nsame.  Uh, you could hear soldiers of color coming back \r\nsaying the experience that they had had in the southern \r\nstates when they got back home... In Baltimore, they could \r\nnot find any job.  But many of them after World War II did \r\ngo get The Educational Grant and went on to college. \r\nSo I don’t know at, that anything really got any \r\nbetter until nineteen and fifty-four. See, we were coming \r\nout of the Depression, we went through, been through \r\nRoosevelt, and we were seeing Kennedy, but it was 1954 when \r\nwe actually started fighting for integration.  I guess \r\n----------------Page (23) Break----------------\r\nthings began to look up all over.  For Baltimore still \r\nseemed a little sleepy town doing what it could do, and \r\npeople that had real jobs here, teach- teaching, social \r\nsecurity, um, the Chevrolet Plant, and Martins.  Martins \r\ncontinued working and hiring lots- and Westing House.  So, \r\nI don’t know whether it was... jobs just open up.   \r\n \r\n00:26:02:24------------------------------------------------ \r\n \r\nDe Mare:  Can you talk a little bit about how you think \r\nyour experience working as a young woman, and also working \r\nin a defense plant on such important work, how did that \r\nkind of inform the rest of your life?  Do you think that \r\nthat time gave you something special or, or taught you \r\nsomething that you took on later in life?  ‘Cause you \r\ndidn’t do that same kind of work, you didn’t stay in that \r\nwork at all.   But can you talk to what that meant to you?   \r\n \r\nKing:  I really had no, uh, afterthoughts about working in \r\nthe defense plant.  That to me was a means to- to an end.  \r\nIt wasn’t something that I wanted to do.  If I’d wanted to \r\nI probably could have stayed there and made more money than \r\nI made after I left.  But that- that was just a part of my \r\nlife that was finished and gone, and the only reason I’m \r\n----------------Page (24) Break----------------\r\npicking up with it now because I became a part of Rosie the \r\nRiveter and there’s ladies, uh, bringing back to my mind \r\nthings that I’d never even thought about doing.   \r\n \r\nKelly:  Like what? \r\n \r\nKing:  Like I... just... to me, working in the defense plant, \r\nand sitting home taking care of children, wasn’t what I was \r\nall about.  They’re probably better off, richer and \r\neverything else than I am, but that wasn’t what I wanted.  \r\nI wanted to serve society in a different way.  I’d rather, \r\nuh, be in church group, or rather to be playing cards, or \r\nrather to be visiting the sick and that kind of thing.  \r\nThat, that’s what I was all about.  I wasn’t about a house \r\nfull of children.  I accept the two that I had and tried to \r\ngive them the best education that I could.  And when I \r\nbecame a grandmother I tried hard to take care of them and \r\nguide them in some directions.  \r\n \r\n00:27:53:08------------------------------------------------  \r\n \r\nDe Mare:  Can you talk about the work that you did go on to \r\ndo?  Can you talk about your work teaching?  Can you, can \r\nyou tell me the story of kind of your, your life after you \r\n----------------Page (25) Break----------------\r\nwent to college and you had gotten the education and where \r\nyou took your life? \r\n \r\nKing:  Well, when I... aft... I went to college, um, and I of \r\ncourse, stayed out some years when my sister died.  When I \r\nwent back the second time, I would smile, I’d say, “Now \r\nwhat is it that I want to do?  Where am I going to meet \r\nthis man with more money and more education than I have?”   \r\n So, I went on in to college and sure enough this young \r\nbachelor, and I had no idea that he was actually lookin’ at \r\nme, but, uh, one of his friends one night came, called my \r\nnumber and said, “What are you doing?”  I said, “Nothing, \r\nreally.”  So he said, uh, “Would you like to come to an \r\nafter foot game... football party?  I have an interesting \r\nperson who wants to meet you.”   \r\n I said, “Oh, come... Ok, I’ll come.”  So I went to this \r\nparty and who should be sitting there, waiting for me to \r\ncome in, would be one of my professors.  I said, “Wow.”  So \r\nwe started dating.  That was in 1954.  In 1953 he had \r\ntaught me ‘52 and ‘53 first year biology.  We had gone to a \r\nhomecoming dance- not with him, but he... I knew he was \r\nalways there.  And, uh, then we started dating.  I was a \r\nstudent, getting ready to graduate, but there was nothing \r\nanybody could do because on lunch hour we would go and have \r\n----------------Page (26) Break----------------\r\nlunch together and he’d always bring me pretty gifts and \r\nwhatever, and the, the dates went on and on and on until \r\n1956.  We got married.  Back when, I graduated in ‘54.   \r\nTwo years after, uh, we got married, and I was a \r\nhousekeeper.  And I had two children, and I decided, “Let \r\nme go back and do something else.”  So I went on to get a, \r\nearn a, what they call an advanced degree in elementary \r\neducation.  And I tried teaching elementary education for a \r\nyear, but those little biddies gave me the griefs.  And, \r\nuh, I decided this isn’t what I want.   \r\n \r\n00:30:24:00------------------------------------------------ \r\n \r\nKing:  So I went back and took classes in science \r\neducation, so I could, uh, go on and teach a field that I \r\nwas really interested in.  And from science education as a \r\nteacher I said, “Oh, no, this is not what I really want, \r\neither.”  So I really wanted to be a counselor.  So I went \r\non to Johns Hopkins, took some more classes, took thirty- \r\nanother thirty hours, and became a counselor in the \r\nBaltimore City Public Schools and stayed there for the next \r\ntwenty-two years.  And within, uh, within those... marriage, \r\nsome... somewhere within this twenty-two years, my husband, \r\nas a professor, came down with a kidney infection, and \r\n----------------Page (27) Break----------------\r\ndied, uh, shortly after the kidney machine.  We’d been \r\nmarried twenty years. \r\n  I had two children, no grandchildren, so uh, one week \r\nafter his death, the first grandchild was born.  Uh, the, \r\nmy second daughter is Camille, you’ve met her, went away to \r\ncollege.  Meantime, my oldest daughter who was pursuing a \r\ncareer as a dance teacher and an owner of a dance school, \r\ndeveloped what they call “Sankofa Dance Theatre” and her \r\nand her four children developed a dance company.  Her \r\nhusband, her second husband, was the African drumming \r\nteacher and the two boys and two girls were the core of her \r\ndance company and this company has gone on now for about \r\ntwenty-one years.  They dance all over.  We’ve been to \r\nRotterdam, Africa about four or five times, we’ve been all \r\nover America dancing, uh, for the past twenty years.  The \r\ntwenty years has brought her marriages of her children to \r\npeople of, girls of like interests.  One of my grandsons \r\nknows a businessperson... and I guess that’s where we are \r\nnow.   \r\nUh, Camille’s children- one is still in col... in \r\ncollege, in engineering.  The first one has finished in \r\nelementary education.  The little boy’s an artist. So I \r\nguess that’s where I am.  So I’m grandmother, great-\r\ngrandmother and mother.  Certainly enjoying the senior \r\n----------------Page (28) Break----------------\r\nyears, I guess, happily.  I never remarried.  I didn’t have \r\ntime to remarry.   \r\n \r\n00:33:10:14------------------------------------------------ \r\n \r\nKelly:    Can any of the, the work that you did, er, fill \r\nany sort of gender struggles, I guess is... \r\n \r\nKing:  No, because in teaching- is a female, it’s a female \r\nfield.  So there was not really any gender... it was gender, \r\nperhaps, if I were trying to advance to maybe an assistant \r\nprincipal back in the day, or a department head back in the \r\nday.  I’m sure I saw it there.  I saw where a principal \r\nwould come in, a man I had trained to teach science, these \r\nmen would be the first people... not black, white, red or \r\nyellow because by the time I started teaching, schools \r\nsystems were integrated. \r\nSo, I had as many, um, uh, other- race men, or if they \r\nwere, uh, looking to me for help in the classroom, but they \r\nwould be the first people, actually, since you asked this \r\nquestion, put up for a promotion.  Many of them stayed the \r\nsame twenty-two years I did.  And where I sidetracked into \r\nguidance, where it was actually female dominated, they went \r\nup the corporate ladder as department head, assistant \r\n----------------Page (29) Break----------------\r\nprincipal, management and the big whole scheme of \r\neducation.  Many of my friends, most of them have retired \r\nnow, but many of them came out as principals, top leaders \r\nin education, if that’s what you want to hear.   \r\n \r\nDe Mare:  That’s interesting.  But you didn’t have an \r\ninterest in going that route.   \r\n \r\nKing:  No.  No, I didn’t. \r\n \r\nDe Mare:  It wasn’t that you didn’t feel it was open, you \r\njust didn’t, you just didn’t want to go that route. \r\n \r\nKing:  No, I didn’t. \r\n \r\nDe Mare:  Ok. \r\n \r\nKelly:  (unintelligible) \r\n \r\n00:34:58:14------------------------------------------------ \r\n \r\nKing:  Glen L. Martin, in the early forties, as I see this \r\nsign, did not hire black workers.  So... but in 1942 we were \r\nalready working at Eastern Aircraft.  So as a defense \r\n----------------Page (30) Break----------------\r\nworker we were picketing Glen L. Martin, Martin, to hire \r\nblack people.  I don’t, uh, they said there’d be oh, seven \r\nhundred jobs that negro women and men could have if they \r\nwere to be hired at Glen L. Martin.  But I am to believe as \r\na Baltimorian, when Glen L. Martin did open up, there was \r\nwholesale hiring.  And what then, uh, what Eastern Aircraft \r\ndid as soon as the war was over, your job was over.  I’m \r\nsure the ladies told you that yesterday.  The day the war \r\nwas over- you had to hand over your jobs. \r\nPeople continued to work at Glen L. Martin’s, so the \r\nuh, segregation was a sign of the time because in the army, \r\nthere was segregation.  Black men weren’t able to go to the \r\nfront line.  Black men stayed behind as cooks and some kind \r\nof desk jobs while the whites went out until the army/navy \r\nwas integrated, I think that was under Truman, when they \r\nsaid that there was all of integration of army/navy.  That \r\ncame before the civil rights integration of 1954.   \r\n \r\nDe Mare:  If you think back to yourself as a young woman at \r\nthat time, kind of, you know, your, during the war, can you \r\ntalk back to what it was like?  How you felt about the war \r\nitself at that time while you were working?  Did you, um, \r\ndid you know anyone or have any family in the service?  Did \r\nyou remember what it was like to be... can you just talk a \r\n----------------Page (31) Break----------------\r\nlittle bit about that time?  And how being alive and living \r\nduring the war was different than it is now?   \r\n \r\nKing:  During World War II, most things you can remember is \r\neverything was rationed.  You couldn’t buy up so many pairs \r\nof shoes, you couldn’t buy so many pounds of sugar.  You \r\ncouldn’t buy so much of eggs.  But, coming out of a family \r\nof five, we never really ff... and not having an excessive \r\namount of money, we never felt the rationing until we \r\nwanted to go out in the car.  Gasoline coupons- gas was \r\nrationed.  You couldn’t, uh, have the tires for your car.  \r\nThey had to be re-treaded because tires were rationed.  You \r\ndidn’t have, uh, too many silk stockings because everything \r\nwas rationed. \r\nYou was standing on line for every thing.  And as a \r\nyoung woman it would be kind of funny.  You’d go downtown \r\nand you’d see a line, so you’d stand in another line \r\nbecause you figured at the end of the line there must be \r\nsomething you needed.  So that was, uh, being young and not \r\nto have to take care of anybody... because we had enough to \r\neat.  We weren’t hungry back home on Kerry Street. \r\nNow, uh, how the war actually affected me, we didn’t... \r\nwe never... we were a family of girls.  As you look around \r\nand uh, I had the one brother who had a heart condition so \r\n----------------Page (32) Break----------------\r\nhe never went to the war, I had the one uncle who went to \r\nthe war at an older age and he would come back and tell us \r\nstories.  Never was anything good about how mean folk were \r\nto him in Georgia and Arizona and Texas.  And, uh, we back \r\nhome would always feel, “Why, we’re, we’re fighting for \r\nAmerica.  How can we fight for America when they don’t even \r\ntreat you like a human being?” \r\nWe were always told stories of how they brought the \r\nprisoners of war here, and let them eat at the counters \r\ndown south but wouldn’t let the black service men eat in \r\ncount... in counters down south.  But since that wasn’t the \r\nMaryland thing, we probably did not see it and feel it as \r\nmuch as the southerners did.  But during the war, and there \r\nwere many, many black men who would rather be conscientious \r\nobjectors than to go to fight for a war because they did \r\nnot have any kind of equality back at home.  And we’re not \r\ntalking about equality in education; we’re talking about in \r\njobs, we’re talking about walking on one side of the street \r\nor the other. \r\nSo that’s where, uh, we were with integration back in \r\nthe day, and that went on through much of my college life.  \r\nThe year that I finished college in nineteen and fifty-four \r\nwas the year that, uh, schools were supposed to integrate \r\nall the way through.  So when I ride to Virginia soon after \r\n----------------Page (33) Break----------------\r\nthat, all the schools were integrated without too much \r\ninci... incident in Virginia.  I’ve never really traveled in \r\nthe deep south.  I been there, but I’ve never really \r\ntraveled to learn the culture and how the war really im... \r\nimposed on those people, the people in the south.  What I, \r\nwhat I see is what I read about. \r\nBut in Virginia the whites who did not want to send \r\ntheir kids to integrated school opened up academies.  You \r\nhad little academies up and down the highway.  And the, \r\nthose boys and girls when they got to be fifteen, sixteen \r\ndropped out of school; rather than to go to schools with \r\nblack students.  But as today, I don’t see anything. \r\n \r\n00:40:44:03------------------------------------------------ \r\n \r\nDe Mare:  When you see how things have shifted, um, I know \r\nlast, yesterday, with the ladies that are of a certain age \r\nthere was a, there was an energy... How do you... when you look \r\nat, like, your grandchildren, your great grandchildren, and \r\nthe world that they’re in now, I’m just curious how you \r\nfeel... how you feel with things that have changed as much as \r\nthey have and also not having changed in certain ways.  If \r\nyou can just, you know, what do you wish for them, um, when \r\nit comes to, uh, racial situations here in Baltimore and \r\n----------------Page (34) Break----------------\r\nalso in this country... I’m just curious because you have a \r\nperspective that I don’t have.   \r\n \r\nKing:  Uh, as for my great-grandchildren, I do wish to see \r\nan integrated, uh, Maryland.  Uh, schools now are just as \r\nsegregated, more segregated because in the black \r\nneighborhoods, black children go to school.  The whites \r\nhave particularly moved out of Baltimore City.  Those who \r\nmove back do not have children of school age or they’re \r\nrich enough to send their children to private school.  So \r\nwhen I go to the school around the corner I might see \r\nAsians, Hispanics, very few whites. \r\nAnd uh, as I said, I lived in a Jewish community and \r\nI, when I worked up the street not too far away from here, \r\nand that high school I didn’t see maybe three Jewish people \r\nout of two thousand people, because they send their \r\nchildren all to the Jewish schools up and down Park \r\nHeights. \r\nSo I would wish that when they talk about integration \r\nthat we would really have integration.  I don’t know when \r\nwe’ll ever get it, as long as the city stays as it is.  \r\nWhere the blacks were, all run down, nobody occupying \r\nthose.  And as the blacks move out, they’re not having \r\nbabies to put into the schools.  As the whites come back, \r\n----------------Page (35) Break----------------\r\nthey’re young professional.  For instance, uh, uh, what’s \r\nthe... president, uh, last president’s, now you know I’ve \r\ngotten so... the last president’s daughter does live in \r\nBaltimore and she is a teacher.  And uh, I’m sure, she \r\ndoesn’t have any babies to put back in to the system.  And \r\nI see her on... Bush.  Bush’s daughter.  She moved here to \r\nBaltimore, and she’s a teacher, and she’s young, and she \r\nwould live in an integrated community. \r\nSo they’re the people that are moving back and I don’t \r\nknow where, where we’re going with this.  While our schools \r\nare integrated staff-wise, because we’ve got, we’ve got \r\nTeach-for-America, and we’ve got the Filipinos, and we’ve \r\ngot some real well-meaning, young, uh, uh, white and \r\nHispanic teachers coming in to teach the blacks, but the \r\nstudents are not integrated; teachers are integrated.   \r\n \r\n00:43:51:15------------------------------------------------ \r\n \r\nKelly: How do you, um, in terms of your, you know, being \r\nsuch an important part of World War II, and coming to this \r\ntime of your life when we have a war, what are your, what \r\nare your feelings about the differences, or, in the... how \r\npeople were feeling about the war then, and how people are \r\nfeeling about, you know, how we’re looking at war now? \r\n----------------Page (36) Break----------------\r\n \r\nKing:  In. in World War II, we did not have the, the press, \r\nthe TV and the radio to keep any American abreast how \r\nterrible it was.  We did not know until days later how many \r\nmen had been slaughtered in the behalf of peace.  I feel \r\nvery badly about war.  I think there is no such thing as \r\nfighting a war for peace.  I think there’s no such thing as \r\nfighting a war so they could, we can live free.  You’re \r\nkilling too many people for what?  To live free?  No, I \r\nthink there should be some other ways. \r\nAnd when they say World War II, with all of the men \r\nthey slaughtered on the beach my uncle tells me about, uh, \r\nwhat was really, what really came of it?  All of the people \r\nthat was killed when they dropped the first atomic bomb, \r\nI’m completely against it.  If I had to talk to the \r\npresident, “You’re wrong!”  Sure, the Japs... Japanese \r\nsneaked in and bombed Pearl Harbor.  Well, we could’ve been \r\nfighting Japan.  I, I cannot, I haven’t been able to fathom \r\nour European involvement.  I never, I will not be able to \r\nfathom our involvement in war today. \r\nRegardless of who says it’s right or who says it’s \r\nwrong, I think there would’ve been another way around.  We \r\nonly are interested in American’s casualties, but look at \r\nhow many Americans are maimed; will come back blind, deaf, \r\n----------------Page (37) Break----------------\r\ndumb and become a burden to themselves and our society.  \r\nLook at all the innocent people we’ve killed in the Gulf \r\nWar, and in Afghanistan.  It doesn’t make sense.  There has \r\nto be another way out. \r\nI just feel very badly about wars, and as my good \r\nfriend yesterday said, quoted the bible about wars and \r\nrumors of wars, it does not make it right.  And I could \r\nhardly understand the people who quote the bible so glibly, \r\ndon’t even understand why they’re quoting it.  I mean, she \r\ndoesn’t really understand the depths of that passage.  And \r\nit would’ve made for a good argument, but I just smiled \r\nbecause I figured well, you don’t, you really even know \r\nwhat we talked about.  You can’t compare biblical time with \r\ntoday.  So I guess that’s it.   \r\n \r\n00:46:56:12------------------------------------------------ \r\n \r\nDe Mare:  Well, thank you for that.  It’s important because \r\nI think that there is such a sentimentality about the \r\nsecond world war... \r\n \r\nKing:  Mm-hm. \r\n \r\n----------------Page (38) Break----------------\r\nDe Mare:  Um, a lot of people like to remember it as the \r\nbest war, the good war, the greatest generation, and...  \r\n \r\nKing:  That’s a sin. \r\n \r\nDe Mare:  I think it’s important that, that the voices that \r\nhad a, that had a different perspective and a different \r\nexperience are still heard ‘cause they’re getting written \r\nout of history. \r\n \r\nKing:  Mm-hm. \r\n \r\nDe Mare: Um, so thank you for saying that.  Um, um, if you, \r\nif you think back to your life, your time as, as a Rosie \r\nthe Riveter, obviously you achieved your goal, you saved \r\nfor college, you got yourself the education that you \r\nwanted.  But is there anything that you would say to that \r\nyoung woman now, kind of with what you know in your life, \r\nif you look back, if you could say anything to yourself \r\nwhen you were eighteen and, and working so hard to, to, to \r\nget the money for college, is there anything you would like \r\nto tell her?   \r\n \r\n----------------Page (39) Break----------------\r\nKing:  If I were to compare, um, the Rosies of yesterday, \r\nit’d do, it was just as far fetched for us to do what we’re \r\ndoing as the first woman to go up in space.  What are they \r\nlooking back?  You look back and say, “I’ve done this.  \r\nWhat have I added to the society of people?  The planes \r\nthat I helped to build were used for destructing a \r\nsociety.”  It never has said that we built any planes or \r\ndid anything for the peace of the world.  Now the woman up \r\nin space, it’ll be years before she understands why she \r\nwent in space.  And I guess we’re somewhere up there.  \r\nRosies actually did not know what they were doing and why \r\nthey were doing it.  They were doin’ it, most of them were \r\ndoin’ it because of an income.  And that’s why I had not \r\nlooked back and thought too much about it, but if I could \r\ncompare us, I guess we were out there in space.  We didn’t \r\nknow what we were doin’, but we did it.  \r\nAnd I really would like to see the Rosies get as much, \r\num, com, comment, what’s the word?  Much, uh, admiration \r\nfor what they did as The Wax and The Waves.  And now even \r\nthough we might have been menial at the day because Rosies \r\nwere not educated; The Wax and The Waves were and uh, when \r\nthey talk about acknowledging people at the White House, I \r\nthink somewhere in the agenda that the Rosies should be \r\n----------------Page (40) Break----------------\r\nacknowledged.  And for the very fact that most of the, uh, \r\nsome of the Rosies today don’t know what to say. \r\nBut uh, the President’s own grandmother was a Rosie.  \r\nAnd uh, maybe that should be brought to this, this new day \r\nwith new people in the White House.  Then uh, Mrs. Obama \r\nand President Obama, to let them know that his grandmother \r\nwas an important part in the history and he is a Rivet, and \r\nhis children are Rosebuds.  And maybe he might acknowledge \r\nthe few Rosies that live.  ‘Cause there aren’t too many of \r\nus around.  And I had a letter that someone wrote from our \r\nchapter but it never got mailed, I think to George... to \r\nPresident Obama, explaining to him why we probably should \r\nbe acknowledged along with the 99 Squadron and The Wax and \r\nThe Waves at the White House.  So that’s where we are. \r\n \r\n00:50:26:18------------------------------------------------ \r\n \r\nKelly:  Um, do you have any favorite story, or little,  \r\nfavorite memory about that time? A little funny story, or \r\nit could be a heart... you know... just any anecdote that you... \r\nyou know... that you remember as like... you get a chuckle out \r\nof.  So just... \r\n \r\n----------------Page (41) Break----------------\r\nKing:  I, sometimes I get a chuckle out of: on Friday \r\nevenings, my girlfriends and I would get dressed, put on \r\nour little socks and our saddle shoes, and go up on Gold \r\nStreet to the USO.  So my mother would say, “Why are y’all \r\ngoin’ up there?  You don’t know...”- and she used to call \r\nthe, anybody out of Maryland or Virginia she’d call “the \r\nforeign boys”- “Y’all don’t need to be goin’ up and d... \r\ndancing with those foreign soldiers.  You, you be- next \r\nthing you know you’ll be coming back saying you’re gonna’ \r\nmarry one of them.”  “No, Ma, we’re just goin’ to have some \r\nfun.”  ‘Cause there was a USO on Gold Street and that’s \r\nwhere we went. \r\n \r\nKelly:  And what was the, um, were, was it a lot of couples \r\ndancing?  Like, what was the dancing like that you...?   \r\n \r\nKing:  They bring, they bring in soldiers from, uh, Fort \r\nMeade and around the army camps.  And the dance was the \r\nJitterbug.  Most of the time we would do, uh, not line \r\ndancing, was... the Lindy Hop and Jitterbug and Slow Dance.  \r\nAnd just listen to music, and listen to find out where the \r\nboys were from.  And being young and in Maryland and never \r\ntraveled anywhere, if they said they were from Jamaica we’d \r\nhave to wonder where in the world Jamaica was.  “Why are \r\n----------------Page (42) Break----------------\r\nyou in America fighting?”  Not knowing that they might have \r\nbeen born in New York but their parents were Jamaican.  And \r\nwe would go along with the stories, so...  My girlfriend’s \r\nactually married to... those who went to work as Rosies with \r\nme actually married guys they had met at the USO.   \r\n \r\nKelly:  That’s great.  That’s a really good story. \r\n \r\nDe Mare:  That’s a good story. \r\n \r\n \r\n----------------Page (43) Break----------------\r\n"}