[{"type":"add","id":"arkie-huffman","fields":{"identifier":"ROSIE_INTERVIEW_020","url":"/interviews/arkie-huffman","label":"Arkie  Huffman","description":"Arkie Huffman was small enough to crawl into the fuselage and buck rivets while she worked at Boeing.  ","image":"/images/ROSIE_INTERVIEW_020-interview-thumbnail.jpg","content":" 1 \r\nArkie Huffman \r\nThe Real Rosie the Riveter Project \r\nInterview 20 \r\n \r\n \r\n \r\nInterview Conducted by  \r\nAnne De Mare \r\nJune 26, 2010 \r\nNashville, Tennessee  \r\n \r\n \r\n \r\nFor The \r\nFor the Tamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n----------------Page (0) Break----------------\r\n 2 \r\nInterview: Arkie Huffman \r\nInterviewers: Anne De Mare \r\nDate: June 26, 2010 \r\nPlace: Nashville, Tennessee \r\n \r\nHuffman: I was born in Harrison, Arkansas. A little town in \r\nArkansas in the Ozarks. And my parents named me Arkie. It’s \r\nvery unusual no one (has it), you know- what’s your real \r\nname? That’s it. It’s on my birth certificate. And I was \r\nonly ten years old and went to Kansas with my parents. Uh I \r\nwas in high school, graduated and went to Wichita at \r\nChristmas time to uh have a vacation with my brother and \r\nfamily.  And I went roller-skating, which was a big deal \r\nthen and I- you didn’t wear slacks then, you know.  You \r\nwore dresses and I had a sailor dress on and a sailor asked \r\nme-he said, “hey sailor,” and I said, “well, hi sailor.” So \r\nhe asked me to skate and he was a fabulous skater.  And we \r\nwent from the rink to the movie and he’s little sister went \r\nalong. I was only 18 and I thought, he’s pretty safe, you \r\nknow, because his sister was along. And uh after- oh it was \r\nbeautiful. The snow was falling, a nice feathery snow. It \r\nwas very romantic and he ended up being home on leave. And \r\nI was due to go back to my little hometown of Pratt, Kansas \r\nto a job that I was hi- a telephone operator. 40 cents an \r\n----------------Page (1) Break----------------\r\n 3 \r\nhour. It was a good job you know for a little town. And so \r\nbecause I didn’t want to go home, I went to Boeing and \r\napplied for a job and I was hired.  And as a result, I \r\nbecame a Rosie the Riveter and I said because I fell in \r\nlove, I became a Rosie.  But uh, I didn’t work there too \r\nlong at at Boeing but long enough that it was very \r\ninteresting.  I um was smaller then in size and I could \r\nclimb into the Fuse Lodge and buck rivets so I was assigned \r\nto the final assembly and uh this is an interesting subject \r\nto me that I’d like to mention.  The lady who drove the \r\nrivets that I bucked, they called it bucking, was black.  \r\nAnd it- we had lunch together, we you know...I can’t remember \r\nher name now at all but I’ve always thought- and this is \r\n1943 and it was an introduction to me to accept and and I \r\nhad always been very accepting but uh I don’t think enough \r\npeople realize how these service jobs that women did \r\nintroduced a lot of things, like slacks, and um and working \r\nconditions. And one of the uh I had uh always very friendly \r\nwith everyone and I really had a lot of fun working ‘cause \r\nI was young, ready to learn and uh we were married shortly.  \r\nI didn’t work at Boeing too long but he was stationed in \r\nNew Orleans and uh so we went to New Orleans and Higgens \r\nAircraft was brand new uh building that our company- \r\nHiggens Boat Yards decided they’d build a plane and because \r\n----------------Page (2) Break----------------\r\n 4 \r\nI had experience as a riveter, I was hired immediately and \r\nso there again I had all this experience working with uh \r\npeople from Louisiana and I made friends with this one lady \r\nimmediate and uh joined the Marines and then she came home \r\non leave you know and we got together again, but um I got \r\nlonely  in New Orleans without my family so I returned to \r\nWichita. Well Wichita, Kansas is called the Air Capital of \r\nthe World- of the United States because they had Cessna, \r\nBoeing, uh all and Beach Craft and my brother worked at \r\nBeach Craft for over 30 years before he retired and all the \r\nsmaller companies had parts uh uh what do you call it? \r\nContracts- with big companies and there was Northwestern \r\nuh, I think it was Northwestern in Kansas City had a \r\ncontract with Coleman’s Stove and Lamp. So I applied there \r\nand at time I worked 10 hours a day, night. I always chose \r\nto work nights because you made more money and I didn’t \r\nhave any children. I didn’t have responsibilities so I-my \r\nidea was to make money. \r\n \r\n06:26:02------------------------------------------------- \r\n \r\nHuffman: And um, they were very good to me.  My husband was \r\non convoy duty in the Atlantic Ocean and when he came home, \r\nI I got to go see him, while he was in the country. So I \r\n----------------Page (3) Break----------------\r\n 5 \r\ngot to go to New York twice and once to Boston in this \r\nperiod of time I was working at Coleman.  And I was a good \r\nworker because I was always a tomboy following my father \r\naround.  And so I was very apt to the work I had to do and \r\nthey always let me go because they knew I was going to come \r\nback. And Coleman, it was a very great place to work. And I \r\nthat’s that’s about the end of my- I finally- he came home \r\nwith- I mean for good. He was shore duty.  Well of course I \r\nwas going to join him. So we moved to Connecticut and that \r\nwas the end of my work as a riveter or with an aircraft \r\nfactory.  And I became a mother after about uh nine months. \r\nThat’s all it took but we had been married three years. We \r\nhad our third anniversary in the hospital room with my \r\nfirst child. So she was- I’ve had five since. She was born, \r\nI had four more.  And I felt like uh I was accomplishing \r\nsomething. I was filling in for men.  The men that worked \r\nwith were always the supervisors you know, the managers or \r\nyour foremen.  But they treated you very good and we had a \r\nlot of fun and you know, there was a lot of respect. \r\n \r\n08:32:07----------------------------------------------- \r\n \r\nDe Mare:  Do you remember, because I know you said that you \r\nworked for 40 cents an hour as a telephone operator- \r\n----------------Page (4) Break----------------\r\n 6 \r\n \r\nHuffman: Oh! \r\n \r\nDe Mare: Do you remember how much you made as- \r\n \r\nHuffman: I started at 65 cents an hour so that sure I \r\ndidn’t want to go home. I called my mother and said, “I \r\nhave a job here.  I’m staying in Wichita.” And I was lucky \r\nenough to stay with my brother and then you had um, nobody \r\nhad a car except certain people and when they did they used \r\nit very economically so it wasn’t long before I had a group \r\nin a carpool that I rode to work with and that was \r\ninteresting.  Made friends there and we all had the same \r\nthing in common and one thing that I heard uh some stories \r\nby coming to the Rosie Conventions of things that happened \r\nto people and I would go home from work and here’s this \r\nhuge big hanger that had to be big enough to hold a B-29, \r\nwhich was one of the biggest bombers that was built and you \r\nthink about it but I eyes would always bother me.  They \r\nwere sore.  Well I had to go to the doctor and I had \r\naluminum dust poisoning in my eyes so as soon as I left \r\nwork I would have to use a eye wash to clean my eyes. Now, \r\nI almost forgot about that. Sometime or another I was \r\nthinking about it.  I’ve had cataract surgery now. I’m 86- \r\n----------------Page (5) Break----------------\r\n 7 \r\n85, I will be 86 and so I was thinking that’s something I \r\nhaven’t heard mentioned uh a problem with the aluminum \r\ndust. You don’t think about it but here, that’s what we \r\nwere using, you know aluminum so... \r\n \r\nNaides:  Did they give you any type of protective gear when \r\nyou were doing this? \r\n \r\nHuffman:  Eyes. You’re supposed to wear just safety glasses \r\nbut it wasn’t like a mask or anything. It was just glasses. \r\n \r\n11:11:22-------------------------------------------------- \r\n \r\nDe Mare:  So the dust would get in. Do you remember when- \r\nbecause 65 cents and hour at that time was a lot of money \r\nand you were not living at home at the time? You- were you \r\nliving with your brother? Or were you- \r\n \r\nHuffman: I lived with my brother. \r\n \r\nDe Mare: Do you remmber what you did having your own money \r\nfor the first time? What that was like for you? Do you \r\nremember?  \r\n \r\n----------------Page (6) Break----------------\r\n 8 \r\nHuffman: Oh yes. \r\n \r\nDe Mare: Can you talk a little bit about that? \r\n \r\nHuffman: Well, uh, before I was married, um, see the reason \r\nI went to work was because I met my husband. Okay, I had \r\ntwo brothers, eight and ten years older than I so I had no \r\nsisters. And I grew up all by myself in a pla- bouncing a \r\nball against a wall or just playing with dolls. So I just \r\nthought it would be wonderful to have family when I grew \r\nolder. Well, here he was the oldest of six- nine children.  \r\nHe had six sisters and then he had two little brothers so I \r\ngot every weekend, I’d go to their house. Nine children-\r\nthey weren’t- they needed things so I buy socks and pants \r\nand little underwear. I remember I bought two of the little \r\nsisters coats. I was so proud I could buy these coats for \r\nthem. And I always bought treats, toys, but I always saved \r\ntoo. And my brother had a little girl that today I \r\ninfluence to become a Rosie too. She still lives in Wichita \r\nand she uses the Rosie theme a lot in the things she does \r\nwith her church. So um I did save and it helped because \r\nwhen I went to New Orleans we needed rent money and a a \r\nsailor at that time, I don’t remember what his salary was \r\nbut it wasn’t very much a month so I was able to- I had it \r\n----------------Page (7) Break----------------\r\n 9 \r\nin savings because I remember my mother sending money, you \r\nknow when I’d ask and then uh when I went back to Wichita I \r\nworked these 10 hours and by this time my pay was a lot \r\nmore that 65 cents. I don’t remember exactly but I was able \r\nto save.  I didn’t do anything but work. I rode my bicycle \r\nto work. I got an apartment that close and um so I would- \r\nwhen I got the chance to go to New York and Boston, of \r\ncourse we didn’t fly we took a train but it was great you \r\nknow. I could always do it. \r\n \r\n14:27:20--------------------------------------------------- \r\n \r\nDe Mare: Can you talk just a little bit about because you \r\nsaid something so interesting about all the different \r\npeople that you met that you worked with someone who was a \r\ndifferent race than you. Can you talk a little bit more \r\nabout- can you just explain a little more how the service \r\njobs really opened up that kind of connection? Like were \r\nthere men and women working together in ways that they \r\nhadn’t worked together and can you just talk about the make \r\nup of the plant? About how many- you said the men were \r\nmostly supervisors- can you just talk a little more about \r\nthat because I think it’s a really interesting point that a \r\nlot of people don’t understand. \r\n----------------Page (8) Break----------------\r\n 10 \r\n \r\nHuffman: Well uh it seemed like the only women I worked \r\nwith, I mean the only people I really worked with were \r\nwomen. You know, but they- men would come and explain what \r\nwe were expected to do and they would be the inspectors and \r\nthey would be our foremen and uh I didn’t really in Kansas \r\nat Boeing, I didn’t really become too connected with \r\npeople. I think I I- just working with them yes but I \r\ndidn’t go out later with them on a weekend or anything. All \r\nI did was work actually and sleep. And I spent time with my \r\nown family but I did go to a blue print class when I had \r\ntime and it was a t high school that I would take a blue \r\nprint class to learn how to read them you know because that \r\nalways helped.  And that did help when I went to New \r\nOrleans then. \r\n \r\nDe Mare: Do you think that the work that you did as a \r\nRosie, do you think it changed you in someway? \r\n \r\nHuffman: Sure \r\n \r\nDe Mare: Can you talk a little bit about that? \r\n \r\n----------------Page (9) Break----------------\r\n 11 \r\nHuffman: Well I just like- I felt, gosh here I was making \r\nmoney you know. That to me that was really a lot and I was \r\nable to take care of myself.  I mean I didn’t have to call \r\nmy mother and dad for stuff, you know. And yes, I think it \r\nhelped uh all of the women.  One of the best friends I had \r\nin my little town, she had worked there also and she was \r\nable to help- she was from a very large family, and she was \r\nable to help he younger sisters go through trade schools \r\nand she helped her brothers go through trade schools, to \r\nlearn uh- a trade that they could make- She always kept \r\ntrack and they would pay her back eventually when they got \r\nthrough their schooling and got a job, they would pay he \r\nback.  And I just- see I didn’t have any little brothers or \r\nsisters and I just admired her. And she’s a Rosie also from \r\nKansas but in New Orleans like I said, I worked with \r\ndifferent nationalities than me, you know.  I remember an \r\nItalian girl that I just thought was so neat and we worked \r\nwith her, together. And it was- all of this is different \r\ncoming from a very small community, a little town you know \r\nand not having a lot of education.  I had a high school \r\neducation where a lot of my friends who I graduated with \r\nwent on to college and that was what my brothers and mother \r\nexpected of me but I decided to get married instead. I \r\ndon’t know is that enough? \r\n----------------Page (10) Break----------------\r\n 12 \r\nDe Mare: I think that’s enough.  That’s lovely.  Thank you \r\nso much.  It was really a pleasure to talk to you. \r\n \r\nHuffman: Well thank you, Anne. \r\n \r\nDe Mare: Now I’m going to have to look and see if I ever \r\nmeet another Arkie.  I’m definitely going to have to do \r\nthat... \r\n \r\nThe End. \r\n----------------Page (11) Break----------------\r\n"}}]