[{"type":"add","id":"arlene-crary","fields":{"identifier":"ROSIE_INTERVIEW_024","url":"/interviews/arlene-crary","label":"Arlene  Crary","description":"When her husband was drafted, Arlene Crary found a babysitter and got a job at Boeing Aircraft. ","image":"/images/ROSIE_INTERVIEW_024-interview-thumbnail.jpg","content":" 1 \r\nArlene Crary \r\n \r\nThe Real Rosie the Riveter Project \r\nInterview 24 \r\n \r\n \r\n \r\nInterview Conducted by  \r\nKirsten Kelly \r\nJune 26, 2010 \r\nNashville, Tennessee  \r\n \r\n \r\n \r\nFor The \r\nFor the Tamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n----------------Page (0) Break----------------\r\n 2 \r\nInterview: Arlene Crary \r\nInterviewers: Kirsten Kelly  \r\nDate: June 26, 2010 \r\nPlace: Nashville, Tennessee \r\n \r\nCrary: My name is Arlene Crary. I uh am from Madison, \r\nWisconsin and I am 86 and half years old.  I uh left \r\nMadison, Wisconsin in 1943. It aw in September and I had \r\ntwo youngsters, two daughters at the time. I left to go on \r\na troop train to go to Seattle, Washington because my \r\nhusband was there working in the shipyards. He had left a \r\nmonth a head of me because he wanted to find a place to \r\nlive by a brother who was already working in the shipyards \r\nin Seattle. So uh after he found a place it was a month \r\nthat I joined him.  And that was a long trip on a troop \r\ntrain, 2,800 miles. The only stop was in Denver, Colorado \r\nso me and the little ones got used to eating cold \r\nsandwiches and sleeping in uh the seats that were \r\navailable. I forgot how many hours it took us now but it \r\nseemed like a long time. Well then we did join my husband \r\nin Seattle in uh we lived wait out on the outskirts near \r\nMount Rainier. And uh I, we got settled, the girls and I \r\ngot settled in the place my husband found. And then he told \r\nme that he heard they were hiring at Boeing Aircraft.  And \r\n----------------Page (1) Break----------------\r\n 3 \r\nI said, “but I have to find a babysitter.”  And I did. I \r\nfound a nice babysitter. And then uh I went and applied for \r\nthe job.  Of course, I had to take some training first and \r\nthey hired me because of my size to work on the wings of \r\nthe B-17s and the B-29s and uh I was taught how to do \r\nbucking and also riveting and uh I worked six days a week, \r\neight hours a day and of course well when I come home I was \r\nexhausted because I had to take bus all the way so a big \r\ndouble-decker bus that would take me back to when I lived. \r\nAnd of course in the mornings when I would leave for work, \r\nI would have to take a flashlight because it was dark when \r\nI left and that was the only way they could see me to get \r\non on the bus.  Well, anyway, I worked for Boeing for well- \r\nI will first tell you that my husband got his draft papers \r\nwhen we were there six months and he had to go into \r\nservices.  Well that was ok. I thought well I’ll stay here \r\nbecause I need the money even though I knew I would get \r\nmoney from the government. I stayed and I worked another \r\nyear. Well he didn’t get out of service until well after I \r\na ye- my oldest daughter was uh old enough to start \r\nkindergarten.  Well I said I must leave and get back to \r\nMadison, Wisconsin where my family was so again I made \r\narrangements to get on a troop train and went back to my \r\nfamily in Madison, Wisconsin and of course they were very \r\n----------------Page (2) Break----------------\r\n 4 \r\nhappy to have me back.  And I thought perhaps I should keep \r\noccupied other than with my two children. So my father \r\nsaid, “Well mom will take care of the children.  You do \r\nwhatever you want to do. So I went to work as a waitress \r\nand I made quiet good money doing that. And then it was six \r\nmonths after I was home, he got out of service so- then of \r\ncourse uh...I- what a change though in a man because he, he \r\nhad been in Okinawa and he had he had a drinking problem \r\nquiet bad when he came back so...within about six months \r\nafter being home we separated so uh and \r\n \r\nKelly: (inaudible) hard time. \r\n \r\n05:33:09---------------------------------------------- \r\n \r\nCrary: it wasn’t easy but I managed, I managed.  At the \r\ntime he he uh he said, “I want to get a defense job, I \r\ndon’t want to go into service right away yet.”  And I said, \r\n“Well I have these two little ones” Well, it’s up to you. \r\nYou either stay here and work- I worked in a grocery store \r\nat the time but of course having the two children, I had to \r\ngive up my job. So then that’s when I thought well I would \r\ndo the best I could so I followed him, which I guess was a \r\nmistake but I don’t regret it. I don’t regret it because I \r\n----------------Page (3) Break----------------\r\n 5 \r\nsaid I was very proud and I even put in a garden while I \r\nwas there in Seattle too.  We had a little space when put \r\nin what they called at the time, Victory Gardens. So- \r\n \r\nKelly:  Why did they call them victory gardens? \r\n \r\nCrary: I think it was because of uh the the farm boys were \r\ninducted and food was in demand, fresh vegetables so I \r\nthink that’s why they called them victory gardens so \r\nbecause it was the time during the war. \r\n \r\nKelly: Not a lot of the women who were Rosies had children \r\nat the time so what was it like balancing those two worlds? \r\n \r\nCrary: Yes it was two worlds. Two worlds. The facilities \r\nwere not the greatest. We lived was a hotel that was turned \r\ninto living quarters for for people. I cooked out of a wood \r\nstove. We had no cars so as far as laundry facilities there \r\nwas a laundry mat but I couldn’t get there because there \r\nwas no car so I had to scrub board. You can tell my hands.  \r\nI did laundry by a scrub board.  \r\n \r\n07:45:03------------------------------------------------- \r\n \r\n----------------Page (4) Break----------------\r\n 6 \r\nKelly: So- you know, how old were your girls when you were \r\na Rosie? What did they- \r\n \r\nCrary: When I was a Rosie? My oldest one was uh two and a \r\nhalf and my other one was 11 months old but she was walking \r\nalready. (laugh). \r\n \r\nKelly: Wow. \r\n \r\nCrary: But that was no problem when I applied for a job \r\nbecause you know they asked and wanted to know about your \r\nfamily about you and I told them I about the two youngsters \r\nand I had an excellent babysitter. And uh didn’t have to \r\npay her a lot of money. A lot of them would say, doesn’t \r\nthat eat up your wages and I said, “no.”  \r\n \r\nKelly: What- what did you have to pay her? And then what \r\ndid you make as a Rosie? \r\n \r\nCrary: Uh uh I only had to pay her $10 a week for the two \r\nchildren. Of course she didn’t she didn’t feed them. I \r\nalways had lunch- had prepared lunch a head of time for \r\nthem for her to give. And that was all because they ate \r\nbreakfast before I left and uh the evening meal of course, \r\n----------------Page (5) Break----------------\r\n 7 \r\nI fixed when I got home. My wages when I finally left uh \r\nBoeing Aircraft, I was making $1.48 an hour and I thought \r\nthat was a good- \r\n \r\nKelly: And do you remember what you saved for? Or what you \r\nspent your money on? \r\n \r\nCrary: I bought bonds. I bought bonds and uh which was \r\nalmost a must. They would have you buy a bond, at least one \r\nbond a month. And of course then I saved some money to \r\npurchase some property when I got back to Wisconsin.  I \r\nwanted to start my own home so I did. My father knew a lot \r\nabout real estate and helped me there as far as buying some \r\nproperty and uh I purchased a nice lot and of course, \r\nhopefully I thought my husband did get out of service, we \r\ncold start a home. In those days, people started from the \r\nbasement. Where I’m from, with cement blocks. Well anyway \r\nuh during the time we were together, he was stilling on his \r\nmustering out pay. He hadn’t gone back to work yet.  And I \r\nsaid, “Well now is the time for you to start with our \r\nhome.” Well, I would proceed to the cement blocks and have \r\nthem delivered and the mortar. And a friend of mine lived \r\nclose by to where I had purchased this lot and uh he happen \r\nto be over there one day watching my hubby use the mortar \r\n----------------Page (6) Break----------------\r\n 8 \r\nwith getting the blocks and he leaned up against some of \r\nthem and they all toppled- So he knew me and he called me \r\nand said, “Arlene,” he said, “are you getting the right \r\nkind of mortar.” He said, “something’s going on there.” He \r\nsaid, “I was over there talking to your hubby and leaned up \r\nagainst the blocks and they toppled over.”  Well he had \r\nbeen drinking. He wasn’t putting the blocks together like \r\nthey should have been so uh I gave him and ultimatum.  I \r\nsaid, “either you straighten up or this is it. I can’t go \r\non like this.  I saved this money for this lot and to get \r\nour home started.  Well, he wouldn’t listen so- when you \r\nhave children back where I’m from they ask you to go to a \r\ndivorce counselor before you they even let you think of \r\ngetting a divorce so I tried to talk him into going with me \r\nbecause that’s the way they wanted and he wouldn’t go. So I \r\nI just called it quits then.  I couldn’t take it anymore. \r\n \r\n12:00:00------------------------------------------------ \r\n \r\nKelly: It’s a hard thing at the time when a divorce wasn’t- \r\nwhat was that like? Just thank goodness you had your \r\nfamily. \r\n \r\n----------------Page (7) Break----------------\r\n 9 \r\nCrary: Well like I said, what a foolish girl the way I was \r\nbecause I right- I was only out of high school six months \r\nwhen I got married. I mean, that’s too young. I had I had \r\nto grow up fast. My mother died when I was 7 and my father \r\nremarried a woman 15 years younger than him.  Well, here I \r\nmean, she was only 15 years- put it this way- no she was 17 \r\nand I was 7.  She was only 10 years older than me so it was \r\njust like having a big kid sister, you know? So I never \r\nthen then after I got married whatnot of course my \r\ngrandmother was really the one who helped me more than \r\nanyone. So I said the stepmother was not that- she was too \r\nmuch of a kid.  I was more grown up than she was. \r\n \r\nKelly: You had probably been through more. \r\n \r\nCrary: Yes I have. Yes I have. \r\n \r\nKelly: Yea \r\n \r\nCrary: Yes I have but I said uh I’ve always been a very \r\npatriotic person and to this day whatever apartment or home \r\nI’ve lived in I’ve always had the American flag. I said, \r\nright now, they are in Sun City I had a beautiful post put \r\nin with a light. So the flag is out there all the time with \r\n----------------Page (8) Break----------------\r\n 10 \r\nthe light at night so I said...uh so my two girls are that \r\nway too, very patriotic. \r\n \r\nKelly: Why do you think that is?  Why do you love this \r\ncountry? \r\n \r\nCrary: I love really everything about my country.  I think \r\nI’ve been very fortunate to be an American. Uh I think we \r\nhave a lot of freedom here compared to a lot of country. We \r\nhave so much freedom of speech and uh freedom of many many \r\nthings. We’re allowed to go to whatever church we want to \r\ngo to. I’m not a religious fanatic but I was brought up in \r\na Lutheran home. And of course through the years uh I ended \r\nup changing to be a Methodist now where I’m at. So I said, \r\nIt doesn’t matter, it doesn’t really, they are so much \r\nalike.  \r\n \r\n15:00:22------------------------------------------------ \r\n \r\nKelly: What do you think you learned being Rosie that \r\nhelped you the rest of your life? \r\n \r\nCrary: What have I learned? I’ve learned that there are \r\nmany times that I wish I had someone to really love me and \r\n----------------Page (9) Break----------------\r\n 11 \r\nsupport me and I had found someone now but he’s a a- lost \r\nhis wife, uh about the same time- well I didn’t tell you I \r\nremarried- I had remarried and uh of course he passed away- \r\nhow long ago was it- seven years ago. And then I met Bob at \r\nthe Methodist church and we’ve been dating but I can’t get \r\nmarried because of my passed husband’s pension.  He was a \r\npoliceman back in Madison, Wisconsin and Bob has come to \r\nlive with me now because he’s had five bypasses. Recently, \r\nhe had bladder cancer and different ones said, “Well why do \r\nyou take care of him.”  I said, “He’s a good companion.”  \r\nWe have a lot of things that we like to do together. He \r\nlikes to travel.  He likes to gamble a little bit. He likes \r\nto play bingo.  And I said, “These are things that in my \r\nyounger years, I never really did. And with my second \r\nmarriage, Ray wasn’t much for gambling or playing bingo.” \r\nSo...my girls do like him very much. But but as far as- I’ve \r\nalways felt it was nice to be a care giver and Hilda is, I \r\ndo take care of a lot.  I am an instructor of water \r\naerobics and I pick her up twice a week and there in the \r\nbeing, I’d always wait for her to shower then I’d think \r\nwell I’ll shower when I get home but now it’s gotten so...I \r\nmight as well go in there and shower too rather than sit \r\naround waiting for her. \r\n \r\n----------------Page (10) Break----------------\r\n 12 \r\nKelly: Do you think it’s a Rosie bond? Between the two of \r\nyou? \r\n \r\nCrary: Yes, yes, yes. And then before I had Hilda there was \r\nanother little lady that I always kind of helped too. Her \r\nfamily was back in Chicago and she was out here, in Sun \r\nCity alone and of course I’d always take her to the bank \r\nand take her out to eat once and while so I don’t know, \r\nthat’s just me.  If I can help- I said, someday I may need \r\nsome help. \r\n \r\n18:05:07--------------------------------------------------- \r\n \r\nCrary: How have I changed? \r\n \r\nKelly: From that moment you walked into that factory to the \r\nmoment you stopped working as a Rosie? \r\n \r\nCrary: I got to be more open minded about things. I mean \r\nand and believe you not before that I was a rather shy \r\nperson. I got over that. (laughs) And then I always thought \r\nif there is anyway I could help somebody especially when \r\nyou’re working in a factory and you see maybe someone is \r\nhaving a little problems. I was there to help them and uh \r\n----------------Page (11) Break----------------\r\n 13 \r\nit was teamwork. I learned teamwork. And teamwork is \r\nimportant in everything, even in a marriage. So I think \r\nthat’s what I learned lots. Being a Good Samaritan and \r\nteamwork. \r\n \r\nKelly: How many people worked in the- \r\n \r\nCrary: Oh my goodness. It was in the thousands.  \r\n \r\nKelly: So you got meet a lot different types of people? \r\n \r\nCrary: Wilma Reese, who was with us today and her twin \r\nsister. They worked there and I didn’t even know them. And \r\nthink they worked the same shift I did. So but Wilma didn’t \r\nstay there that long. I think they were only there for \r\nabout 4 months I believe, something like that so- \r\n \r\nKelly: And how- what was the relationship with ah some of \r\nthe men? \r\n \r\nCrary: The men?  I was a tiny, petite little thing and they \r\nalways used to call me “Little One.”  “What are you up to \r\nLittle One?” I only weighed 98 pounds. \r\n \r\n----------------Page (12) Break----------------\r\n 14 \r\nKelly: And they wanted your size for- \r\n \r\nCrary: Oh yes for, cause the wing. \r\n \r\nKelly: What did you do? Climb up in there? \r\n \r\nCrary: (nodding) In the wing, in the wing. \r\n \r\nKelly: So you crawl up in the wing and then rivet and buck? \r\n \r\nCrary: Um hum buck, buck. \r\n \r\nKelly: Oh wow, was it hot or what was it? \r\n \r\nCrary: It was hot but in Seattle of course it’s not like \r\nhere or Arizona. \r\n \r\nKelly: Right. A little cooler. Oh this was wonderful.  \r\nThank you. I’m so happy you stopped by. \r\n \r\nCrary: You’re welcome. \r\n \r\nThe End. \r\n----------------Page (13) Break----------------\r\n"}}]