[{"type":"add","id":"carters","fields":{"identifier":"ROSIE_INTERVIEW_015","url":"/interviews/carters","label":"The Carters","description":"Frances and John Carter discuss her defense work and his time as a paratrooper during the war.  ","image":"/images/ROSIE_INTERVIEW_015-interview-thumbnail.jpg","content":" \r\n \r\n \r\n \r\nFrances & John Carter \r\n \r\nThe Real Rosie The Riveter Project \r\n \r\nInterview 15 \r\n \r\n \r\n \r\n \r\n \r\n \r\nInterview Conducted by \r\n \r\nKirsten Kelly \r\n \r\nJune 27, 2010 \r\n \r\nARRA Convention, Nashville, Tennessee \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\nFor The \r\n \r\nTamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n----------------Page (0) Break----------------\r\n \r\nInterview: Frances & John Carter \r\n \r\nInterviewers: Kirsten Kelly \r\n \r\nDate:  June 27, 2010 \r\n \r\nPlace:  ARRA Convention, Nashville, Tennessee \r\n \r\n \r\n \r\nJohn: My name is John Carter and I am now 88 years old. We \r\nboth were World War II vintage. I was a paratrooper in \r\nEurope and she was, worked on B-29 Bombers in Birmingham, \r\nAlabama. Now Frances... \r\n \r\nFrances: And I'm Frances Tunell Carter. I was not married \r\nwhen I was working as a riveter. And I planned to be a \r\nschoolteacher, but I did this during the war. And John was, \r\nwe're the same age, I'm 88 also, but I'm six months older, \r\nso half the year we're both 88, and... \r\n \r\nJohn: You're six months younger than I. \r\n \r\nFrances: Younger, younger. And we really felt like we ought \r\nto do something to try to help the men. Then I got to \r\nrealizing that John was, he was not, he volunteered, but it \r\nwas supposed to be volunteered, and then later Roosevelt \r\nsaid, “When we need you, we'll call you.” And then I got to \r\n----------------Page (1) Break----------------\r\nthinking, since we are the same age, that actually I would \r\nhave been drafted if I had been a boy. So that's why I \r\nwanted to go into the work. And my mother told me, she, we \r\nlived in rural Mississippi, and she told me that I could go \r\nas far away from home as Birmingham, and so I got a job in \r\nthe sheet metal department. \r\n \r\nJohn: Well now, she was a schoolteacher. She was teaching \r\nin her first year of school. \r\n \r\nFrances: Well, two years of education... \r\n \r\nJohn: She completed one year. \r\n \r\nFrances: ...and I was teaching on a defense certificate, \r\nwhich may be a thing of interest to you all. It's a... back \r\nin, during the war, so many of the men were called out and \r\nthey just needed a body in every classroom, and so we, if \r\nwe had two years of college work, and if we had enough \r\neducation courses – I had to go and take two more courses \r\nthe summer after I finished junior college – and then I \r\ntaught for one year and then I went to Birmingham to get \r\nthe job. \r\n \r\n----------------Page (2) Break----------------\r\n00:02:15:15------------------------------------------------ \r\n \r\nKelly: So what were you teaching then right? And then can \r\nyou talk about how became, how you became a Rosie? \r\n \r\nFrances: I was teaching first, kindergarteners, first \r\ngraders and second graders all in the same room. In rural \r\nMississippi in 1943 - I had finished Junior College in '42 \r\n– in 1943 we didn't have real strict rules in rural areas \r\nabout the children waiting 'til five, 'til six 'til they go \r\nto school. And so I had four year olders and five year \r\nolders and they would be in one table. And I had first \r\ngraders in another two tables and then I had seats along \r\nthe wall, desks, for the second graders. \r\n \r\nJohn: How many? \r\n \r\nFrances: Fifty-two. And I was eighteen, nineteen maybe, \r\nwhen I started. 'Cause I taught... it was an eight month \r\nschool. And after the school was over I went to work over \r\nthere in Birmingham. But I got fifty-six dollars a month \r\nfor fifty-two children. That's not nearly babysitting. \r\n But we had such a good thing. And we didn't really \r\ncall it too much a victory garden – we should have – but we \r\n----------------Page (3) Break----------------\r\ndidn't have any playground equipment and I had to get out \r\nand play with them during, and we had an hour for lunch, \r\nand they could eat their sandwiches, because we didn't have \r\ncafeterias, they could eat in fifteen minutes and you had \r\nto do something with them for the next 45 minutes so we \r\nplayed games, old-timey games, group games, and then we'd, \r\nI got on the idea of having a victory garden. It didn't do \r\nso well, but we enjoyed going out there and hoeing and so \r\nforth during the class period. Then they'd all get on the \r\nschool bus and ride home. \r\n \r\nKelly: And so how did you hear about becoming a Rosie and \r\nhow did that all, how did that all happen? \r\n \r\nFrances: Well... \r\n \r\nKelly: To get to Birmingham. \r\n \r\nFrances: Even out there in those rural areas, we got the \r\nword that they were needing women. And so, and I don't \r\nremember how much I got, but I think I started at 30¢ an \r\nhour. But I had been on an NYA scholarship at the Junior \r\nCollege, and had worked my way completely through the two \r\nyears by working the summer and then three or four hours \r\n----------------Page (4) Break----------------\r\nduring the winter, the fall semesters, and it, I think it \r\nwas 10¢ an hour I got for that. It was called NYA. \r\n \r\nJohn: That's National Youth Administration. \r\n \r\nFrances: You worked on that too, didn't you. \r\n \r\nJohn: Yes, I was in another community college, or junior \r\ncollege. \r\n \r\nFrances: Did you get 10¢ too? \r\n \r\nJohn: I got eleven and a half cents an hour for the work we \r\ndid. I think it's what you got. \r\n \r\nFrances: That’s the difference in the men and women, I \r\nguess. \r\n \r\nJohn: I think that was just standard wages, that much. \r\n \r\nFrances: But it never came to us. We didn't know exactly \r\nhow much we got because it was deposited at the school. And \r\nit was, it took care of my tuition and bo... Well, I guess \r\nit took care of books, I think it did. Everything... I had \r\n----------------Page (5) Break----------------\r\nto work for fees, special fees, to pay for that. I had to \r\nwork during Thanksgiving holidays and Christmas holidays. \r\n \r\nJohn: You might want to tell them how much money you had \r\nwhen you reached the college. \r\n \r\nFrances: Yeah. \r\n \r\nKelly: Hang on just one second. \r\n \r\n00:05:36:17------------------------------------------------ \r\n \r\nKelly: Go ahead. \r\n \r\nFrances: How much money I had when I reached junior \r\ncollege, Wood College, in Mathiston Mississippi. And my \r\ndaddy gave me, he was a small time farmer, and he gave me \r\n$1.86. And I rode the train to this school and it took \r\n$1.50 to get my train ticket. So I had 36¢ left when I got \r\nthere. And they didn't give us any cash for our work, so it \r\nwas... \r\n \r\nJohn: She worked her way, all the way through the two \r\nyears. \r\n----------------Page (6) Break----------------\r\n \r\nKelly: And then what, do you remember your first day as a \r\nRosie? \r\n \r\nFrances: Yes, it was really interesting. My mother said you \r\ncan go only to that, to Birmingham. And I had a brother who \r\nwas turned down, what'd you call it, what do we call them  \r\nwhen they don't have, have health problems? \r\n \r\nJohn: Oh, that was a 4-F classification. \r\n \r\nFrances. 4-F classification. Had a heart murmur and they \r\nturned him down. But of course he was married and had two \r\nchildren also. And so he was working there and she felt \r\ncomfortable with my doing that. I was also living part of \r\nthe time with my aunt and part of the time with my brother \r\nand his wife and so they seemed to be interested in that. \r\n And when I went over to get the job I went in to apply \r\nand this friend, cousin on my uncle's side, and he and his \r\nwife and the men went to take me up there and I went in \r\nthough alone. They were going to sit in the car and let me \r\ngo apply for the job. And they said – “We'll send you to \r\nFlorida, but we can't, we just don't have an opening here.” \r\n So I went back and told them and I had to do this \r\n----------------Page (7) Break----------------\r\ntraining, that was training, I went back and told them and \r\nthis Claude's wife said, “Give me that emblem of yours,” \r\nyou know her pass to get in, said, “I'm going to go in \r\nthere and tell them there's a place vacant right beside me \r\nwhere I work.” And so she did and they said, “Well if you \r\nhave a vacant place, she can have it.” And so that was \r\ninteresting. \r\n But then later – I didn't work all that long, about a \r\nyear, but 'cause they were going to send me to Florida. \r\nThey wanted to transfer you around, and my mother was ill \r\nwith bronchitis, and so forth we called it. I guess we call \r\nit emphysema now. And so she, and I was the younger child, \r\nyoungest child. And so she just didn't want me going away. \r\nAnd so then that's when I went back. \r\n My sister got a job teaching high school english and \r\nthe principal said, “I need a first grade teacher. Let me \r\nhire you both.” So I did get out then and go to teaching \r\nbut didn't, I would go during the summers to school and I \r\ntaught some more during some of the times. \r\n \r\nKelly: Now how did you two meet? \r\n \r\nJohn: Well the first time we ever... \r\n \r\n----------------Page (8) Break----------------\r\nKelly: Hang on. \r\n \r\nOff Camera: That was scary. Thank you. \r\n \r\nJohn: The first time, first time we ever did sort of meet \r\nwas, I was going to one junior college, she was going to \r\nanother, in Mississippi, and I was on the basketball team. \r\nAnd so I went up to, with our team to play basketball. And \r\nshe was waiting on the table... \r\n \r\nFrances: It was part of my work. For that work I was going \r\nto get paid my tuition and so forth. \r\n \r\nJohn: So I remember her. She doesn't remember me. \r\n \r\nFrances: Well, it was a lot of boys at the table, and I was \r\njust trying to get them served and be efficient with my \r\nwork. \r\n \r\nJohn: So we discussed her, I mean among the teams, how we \r\nwished she had come down to Clark college where I was. But, \r\nnevertheless, we thought, I never thought I'd see her \r\nagain. It was just a pleasant diversion. And the next \r\nsummer, though, when she had finished junior college, and I \r\n----------------Page (9) Break----------------\r\nhad too, and she had to go back to school to get a couple \r\nof courses in order to be qualified to teach. \r\n \r\nFrances: As a defense teacher. \r\n \r\nJohn: And in the little town of Blue Mountain, Mississippi \r\nthey had a college where she was, my grandfather and \r\ngrand... had had a dairy farm, large farm there. And he had \r\ndied and my grandmother had asked me if I would come up and \r\noperate the farm. I had been working for them during the \r\nsummers ever since I was thirteen years old I would go and \r\nhelp them make a crop and so forth. But after my \r\ngrandfather died I worked for my grandmother until, \r\nactually, I went to the army. \r\n And it just so happened that we saw each other at \r\nchurch one night, and recognized each other. Well, I \r\nthought she was, oh before then, we had met at her college \r\nbecause we were both Baptist denomination, and I had been \r\nasked to go up and help them to organize a Baptist student \r\nunion. And the pastor, Baptist pastor of the church, had \r\nselected two or three of their students up there to sort of \r\nbe the key people and had, Frances was the one that was \r\nhandling their part of it. \r\n \r\n----------------Page (10) Break----------------\r\nFrances: So these three boys came up and I got them all \r\ndates with girls. \r\n \r\nJohn: And she was engaged to one of the boys on the campus. \r\nAnd so I figured she was gone, I mean, spoken for. That \r\nsummer though, at Blue Mountain College we would see each \r\nother occasionally, mostly just at church at night, because \r\nI was too busy on the farm to do anything else much. \r\n And but she wrote me a little card, and about, a \r\nlittle postal card. Then you could write them for one \r\npenny. And it was about the name John, sort of a sarcastic \r\nlittle poem that she had found in her children's literature \r\ncourse she was taking there. And when, she didn't sign it \r\nbut I knew it must have been from her. So when I asked her \r\nabout it, she said yes, I thought, my sis... said her \r\nsister told her that she ought to send that to a John she \r\nused to know. “Well,” I said, “Gee if I was a John that,” I \r\nknew the other guy that she was going with was named J.W. \r\nand was, his real name was John. I said, “Gee, if it was a \r\nJohn she used to know that must mean the coast is clear.” \r\nAnd she had told me that he was in the navy by then, so I \r\nwas, by the time we left, I had decided that I was going to \r\nmake a try for her. \r\n \r\n----------------Page (11) Break----------------\r\nKelly: And it worked. \r\n \r\nJohn: It worked. But the first time that I went to see her \r\nand of course, when school started she went that way and in \r\nthe mean time I had joined the army but was not called to \r\nactive duty. They said “go ahead and go back to school,” so \r\nI went to Mississippi State University and they called me \r\nout during the year. But I went up to see her one weekend. \r\nShe had come back home, she had come home on the weekends \r\nto the little farm where her parents lived. I hitch hiked \r\nup to [Pontauk?] Mississippi and she lived oh, six or eight \r\nmiles out. I caught a taxi and asked a taxi driver if he \r\nknew where the, the Tunell's lived out on that highway, he \r\nsaid, “Yes,” said, “I just carried a sailor out there.” \r\n \r\nFrances: Yesterday, I think that... \r\n \r\nJohn: No, last week. He said, “I just carried a sailor out \r\nthere last week.” So, I decided, well, maybe I wasn't \r\nreally, had jumped to the wrong conclusion. Well, sure \r\nenough I had jumped to the wrong conclusions. They were \r\nstill, I guess you'd say still engaged. But never the \r\nless... \r\n \r\n----------------Page (12) Break----------------\r\nFrances: Well, in a manner of speaking. \r\n \r\nJohn: Well, by the time, I come to find out that the John \r\nshe was talking about really, was another John. \r\n \r\nFrances: Everybody I went with was a, named John. \r\n \r\nJohn: I was the third John. \r\n \r\nFrances: Well, not everybody. \r\n \r\nJohn: On the list. Well, there were three of us Johns. But \r\nat any rate, when we got overs... all of us got over seas I \r\ncould write a better letter than they could. And she [would \r\nhave better learned...] \r\n \r\nFrances: We ta... figured up about a week ago that we \r\nreally saw each other about thirteen different occasions. \r\nNow, I went up to his home and visited and met his parents \r\nand so forth and he came to my home and met my parents. And \r\nthat was a longer, more like an overnight sort of thing. \r\nBut we, then he was called into service and stayed in \r\nFrance and Europe and Africa for twenty months and so... \r\n \r\n----------------Page (13) Break----------------\r\nJohn: So we really did never live close enough to, we never \r\nhad a date where I took her out anywhere until after we \r\nwere married. But I can shoot a pretty good line through \r\nthe mail and by the time I got home we had been, we had \r\nbecome engaged. I had sent enough money to a jewelry store \r\nfor her to go down and select her, her engagement ring, and \r\nso it was official. \r\n But if I can tell another little incident that \r\nhappened when she was a riveter here in Birmingham, when \r\nshe first come over, I was in school, not in school, I was \r\nin camp, in basic training, at Fort McClellan, Alabama. And \r\nwhen I found out she was in Birmingham, it was only, oh, \r\nit's only about an hour and a half away. But then everybody \r\nhitch hiked and it took me a little longer. But anyway, I \r\ngot a pass and came in to see her one weekend and she was \r\ngoing to show me the handiwork that she did as a riveter. \r\nShe had riveted together a little ash tray. And so she \r\nhanded it to me, the thing fell apart. I said, “Lord help \r\nus, if that's the way these airplanes are put together, \r\nthen, if I ever get up in one of them, the safest thing I \r\ncan do would be jump out of it.” \r\n \r\nFrances: So that's my claim to fame. I recruited a \r\nparatrooper. \r\n----------------Page (14) Break----------------\r\n \r\nKelly: That's a great story. \r\n \r\nFrances: And another thing, though. Finally he was off over \r\nthere and I got the ring. And I went down and picked it \r\nout. The jewelry store had picked out three for the amount \r\nof money he had sent, and so I chose it, I've worn it out \r\nthough, and so, I didn't, after that I took it home and I \r\ndidn't tell anybody. And I had my own little ceremony to \r\nmyself you know, and meditation time about it and put it on \r\nand then all of the sudden I was showing my ring, and they \r\nsaid, “Where did you get it?” And I said, “The jewelry \r\nstore yesterday.” But... \r\n \r\nJohn: By then she had left the ri... the defense plant, and \r\nwas back in school at University of Southern Mississippi. \r\n \r\nFrances: Yeah, when they wanted to send me to Florida and \r\nI, my mother would be unhappy for me to go. Of course I was \r\ntwenty years old and had worked a year, but she still, the \r\nyoungest child, she just thought we couldn't get away and \r\nsince she was sick, we wanted to stay close by. And we, we \r\nreally didn't really remember though much about each other, \r\nnot dating very much, and then when I was, I would go to \r\n----------------Page (15) Break----------------\r\nschool a while and then I would go back and teach another \r\nyear or something. And so, when we got back to the school \r\nthe last time, in '45, John called and he said, “I'm, I've \r\ncome in to New York,” I guess.  \r\n \r\nJohn: Yeah, it was. \r\n \r\nFrances: But he said, “I've ridden a troop train then to \r\nShel... Camp Shelby,” which is thirteen miles from the \r\nUniversity of Hattiesburg campus, where I was in school and \r\nworking on a bachelors. And he said, “I've caught a ride in \r\nto the Greyhound bus station, come meet me.” \r\n Well, it was nearly midnight, and I had stayed over, \r\nafter Christmas holidays began, just waiting for that troop \r\ntrain to get there, and I, it was the funniest feeling \r\nthough, I didn't know whether I'd recognize him. I hadn't \r\nseen him much before he left and then... \r\n \r\nJohn: Twenty-two months, that was awful. \r\n \r\nFrances: Twenty-one, twenty-two months he was there. And I \r\nwent down, thinking he would be the only one standing there \r\nat the Greyhound bus station. But when I got down there \r\nthey were, there were soldiers all over, just wall to wall, \r\n----------------Page (16) Break----------------\r\nand I was running around through them and they saw me and \r\nthought I was a loose woman, and then I told John I believe \r\nI could have gotten a hundred dates that night. But we \r\nfound each other and recognized each other and then I went \r\non home that very night, because... \r\n \r\nJohn: Her mother was sick and she needed to go home. \r\n \r\nFrances: Yeah, and she wanted me to come on home for \r\nChristmas and get the house fixed and everything. \r\n \r\nJohn: So we married in March then, after that. \r\n \r\nFrances: After, that was in March, 1946, so we've been \r\nmarried forty, sixty-eight, sixty-four years. \r\n \r\n00:18:44:00------------------------------------------------ \r\n \r\nFrances:  Well, we went back to school first, if you want \r\nto go back that far. We both had to get... \r\n \r\nJohn: I had a lot of G.I. time coming, to go to sch... \r\neducational work, so... \r\n \r\n----------------Page (17) Break----------------\r\nFrances: We got our bachelors after I was, I lacked one \r\nquarter, and he lacked about a year and a half, 'cause they \r\npulled him out his junior year, and then we went to get our \r\nmasters and got it in the same ceremony, and got our \r\ndoctorates in the same ceremony. \r\n And then we quit going to school, and then well, we \r\nhad had one child when John had got the G.I. Bill, and the \r\nG.I. Bill was, when we found out about it, says you must \r\nget in school by next July, and that was about, oh when was \r\nit, anyway we had to get in, we got in when the semester \r\nbegan in January, with a fourteen months old baby. And \r\nuh... \r\n \r\nJohn: Went to the University of Illinois. And so it took... \r\n \r\nKelly: What did you study? \r\n \r\nJohn: It took us about three or four years there because we \r\nhad to come back and teach a little while and then, and \r\nthen go back to school. \r\n \r\nKelly: And what did you study, or what did you get your \r\nPhDs in? \r\n \r\n----------------Page (18) Break----------------\r\nJohn: Well, mine was in agriculture. I was in agricultural \r\neducation there for a while. And hers was in home economics \r\neducation, both of us were in education, and both of us in \r\nfields that have sort of gone by the boards since then. \r\n \r\nFrances: But we, we took a, it was a doctorate of \r\neducation. School teacher doctorate is what we called it, \r\nand they persuaded us to do that instead of of a PhD - \r\nthat's what we meant to work for, and they said we had the \r\nbest school system in the world, really, 'cause we mass \r\neducate every, all our people, and there's not enough \r\nwritten in other countries. You have to have two languages \r\nfor a PhD and we took twice as much course work, sixteen \r\nhours, of hour... \r\n \r\nJohn: Rather than passing the German and French, or \r\nwhatever two languages we might have took. \r\n \r\nFrances: And so we took twice as much course work. \r\n \r\nJohn: So rather than getting a PhD, it turned out to be \r\nwhat they called an EdD, doctor of education. \r\n \r\nFrances: And so then that gave us, with the doctor of \r\n----------------Page (19) Break----------------\r\neducation, we went to Samford University, and that's not \r\nStanford, it's Sam, S A M F O R D. It's a Baptist School in \r\nBirmingham. Well, we taught at Clark College first, and \r\nthat's where John had graduated from. And then we taught at \r\nWood Junior College, where I had graduated. And then, that \r\nwas home economics and the educa...  agriculture. \r\n \r\nJohn: Agriculture. \r\n \r\nFrances: But then we went to, when we went to Illinois we \r\ngot education, so we put education, and got us the doctor \r\ndegree too, and went to Samford to teach in education and \r\npsychology. \r\n \r\nKelly: So you've really stayed with education your whole \r\nlife then? \r\n \r\nJohn: Yes, we have. \r\n \r\nKelly: How, so tell me how the idea to work together to \r\ntalk about Rosie and the war and kind of tour to classes \r\nnow, how did that all come about? \r\n \r\nJohn: As it came about, when the, about the 50\r\nth\r\n anniversary \r\n----------------Page (20) Break----------------\r\nof World War II there was a renewed interest in it, and \r\nthey, when they, back to how she got into the Rosie the \r\nRiveter Association, there was a notice in the Birmingham \r\nnewspaper that over at Warm Springs, Georgia one Saturday, \r\nthey were going to have a special Rosie the Riveter \r\nprogram, honoring the Rosies, and they were trying to get \r\nas many as they could to come over there. Well, one of our \r\nfriends saw it and told us, so we drove over. It so \r\nhappened there weren't very many other Rosies there. \r\n \r\nFrances: Four, three, there were four of us that went. \r\n \r\nJohn: Well, there were more than that, all told, only four \r\ncame to the little meeting that you had, I think. \r\n \r\nFrances: Well, maybe so. \r\n \r\nJohn: But, they, because of the program that they had, and \r\nthis lady that was presenting the program, Frances decided, \r\nwell, we ought to have an organization about us. So the \r\nnext year, they did that once a year over here, so the next \r\nyear we went back also, and she had told them, at the  \r\nLittle White House, that she would like to have a meeting \r\nof all of the Rosies and see if they wanted to organize. \r\n----------------Page (21) Break----------------\r\nAnd so that's how it got started. And after it did get \r\nstarted, she went back and wrote the bylaws to it, and \r\nLittle White, you know Roosevelt's Little White House in \r\nWarm Springs, Georgia. \r\n \r\nFrances: Where he went for his water therapy for polio,  \r\n \r\nJohn: He had a little, what they call a Little White House \r\nwhere his office was set up while he was down here while he \r\nwas president. And so they helped to get the officers for \r\nthe first year and asked her to be the president the first \r\nyear. \r\n \r\nFrances: And then we had three other officers, we have four \r\nmain officers. \r\n \r\nKelly: And what are, as this started to grow, how many \r\nyears has this been? \r\n \r\nFrances: It was in, December 1998 that we call it the \r\nfounding day, December 1. And the reason was, well when we \r\nmet, there were two Rosies there, and the two husbands, not \r\nanother had, no one had come that I had contacted, and \r\nexpected to come. Of course they had had to come from \r\n----------------Page (22) Break----------------\r\nAlabama and they just didn't show up. And they all agreed \r\nthat it just wouldn't work. \r\n And John thought that I just wanted to do a little \r\nlocal club. And my idea was to do something on a national \r\nlevel. But I didn't know how to start. I had never really \r\nfounded anything, but I knew... \r\n Well we went home and I was very dejected 'cause they \r\nsaid, “Look, there's no interest. Nobody's here.” And John \r\nsaid, “We'll have to wait 'til another year or never. \r\nProbably never get any interest.” And so I was so \r\ndisappointed and I went home and I couldn't get it out of \r\nmy system and I decided I'd start writing the bylaws. And I \r\nwould write and John would re-write. That's the way we do. \r\n \r\nJohn: Well, she contacted Little White House though, over \r\nthere, and they said, “Yeah, go for it.” \r\n \r\nFrances: And I said, “Now if we should get an organization \r\nstarted, would you let us be on your Rosie day?” They had a \r\nRosie day. They have, in Little White House they have a \r\npatriotic emphasis every month. And in June they had Rosie. \r\nSometime they had Theodore and Eleanor, not Theodore, but \r\nFranklin D. Roosevelt and Eleanor and people impersonating \r\nthem. And so we got in on that. \r\n----------------Page (23) Break----------------\r\n But the lady that was making the speech, her mother \r\nhad been a Rosie, but she was a drama teacher and she just \r\nhatched her up a program and told five, she had to \r\nimpersonate five people. She had a bus driver, she had a \r\nfilling station operator and she had a riveter and two or \r\nthree others. \r\n And flex time I guess we started because she had a \r\nlittle doll up there for her, for her thing she was looking \r\nat, and the, she joggled the little baby, you know, while \r\nshe was talking and said, “My sister and I, I keep the \r\nbabies,” both had a baby. And said, “I keep them for two \r\ndays a week and she goes to work and then she keeps them \r\nand I go to work.” So I guess you call that flex time and \r\nthat's what we started there. And... \r\n \r\nJohn: But at any rate after, after she did get this \r\nstarted, and it floundered for a few months, but then it \r\ncaught on, and they had their first convention back at Warm \r\nSprings, Georgia, and I believe there were about forty, \r\nthirty-five or forty people showed up. \r\n \r\nFrances: Thirty-five, and we just had one day and we had a \r\nlittle business meeting and elected the officers and the \r\nstaff. \r\n----------------Page (24) Break----------------\r\n \r\nJohn: Decided where they would meet the next year, and then \r\nit has grown from that so that now they have, getting up \r\nclose to four thousand. \r\n \r\nFrances: The first year from December the first, I joined \r\nfor my daughter, our daughter, and granddaughter.  \r\n \r\nJohn: As Rosebuds, you know. \r\n \r\nFrances: I have, we have two granddaughters and they were \r\nRosebuds. And then there was another lady that joined, and \r\nthat was the five. We opened a bank account with twenty \r\nfive dollars. \r\n And we only charge ten dollars for a lifetime \r\nmembership fee, and then, we do that because we want the \r\nRosie's to join for the Rosebuds, 'cause if a teenager has \r\nten dollars she doesn't want to spend it on genealogy, and \r\nso that's why we keep it low and so we operate on a \r\nshoestring. But eventually we're going to have to have \r\ndues, but we don't have right now enough I say woman power, \r\nnot manpower but woman power, to collect dues and so forth \r\nand so we just, when they qualify they're in it for life, \r\n'cause that's what they did. \r\n----------------Page (25) Break----------------\r\n  And there's no records on us. And there were on the \r\nveterans, I mean the soldiers all through the, back... \r\n \r\nJohn: But the women that worked of course, when the war was \r\nover, most of them were just dismissed and went home \r\nwithout no records, they're just having to find them. But \r\nit's gratifying to see how it is working now. This is, Dawn \r\nLean is the first Rosebud that has been elected as the \r\nnational president. And now, let's see, she lives in \r\nMichigan, the vice president is a Rosie that lives in \r\nOregon, the secretary is a Rosebud, lives in Texas, and the \r\ntreasurer is a Rosie. So they're half, she lives in \r\nAlabama. But the, two of the national officers are Rosebuds \r\nand two are Rosies. \r\n \r\nKelly: So the breath, so the range of where your members \r\nare and your officers is huge. \r\n \r\nJohn: It's huge. \r\n \r\nFrances: Well, we wanted it to be that way. We did not want \r\nit to be a regional thing. \r\n \r\nJohn: There are members in every state. And local chapters \r\n----------------Page (26) Break----------------\r\nscattered throughout the country. \r\n \r\nKelly: And what is.. \r\n \r\nOff Camera: Sorry, I want to stop you before you ask a \r\nquestion because we only have five minutes of battery. \r\n \r\n00:29:00:18------------------------------------------------ \r\n \r\nKelly: So we're going to. What is, what is your favorite \r\nthing, when you meet up with...? \r\n \r\nFrances: When you meet a Rosie? I guess it's, as John and I \r\nwere talking just now, I guess I could say that it's when \r\nthe Rosies seem so appreciative that we have an \r\nassociation. And as I said, this morning, I think you all \r\nwere in there, that three of them cried during this last \r\ntime when they published that article and we had such an \r\ninflux of new members. But it's very gratifying. Nobody has \r\never really paid much attention to the Rosies. And since \r\nthere were no records on it, they just hadn't, actually the \r\n50\r\nth\r\n anniversary helped us though, and in the memorial at \r\nWashington D.C. we do, we have several Rosie friezes I \r\nguess you'd call them, between the columns that stand for \r\n----------------Page (27) Break----------------\r\nevery state. \r\n \r\nJohn: That's in the World War II Memorial. \r\n \r\nFrances: Yeah. \r\n \r\nJohn: Incidentally, she was asked to come to the dedication \r\nof the World War II Memorial and be on the program and CNN \r\nalso helped her there at the dedication. \r\n \r\nKelly: So you're getting your, you're getting your Rosie \r\nout in the world, after... \r\n \r\nFrances: Yeah well, it's slow, but, with now, I'm hoping \r\nwith the officers working, one thing, we said that the, \r\nwhen we've transitioned to the Rosebuds, and we're doing \r\nhalf and half now, and a few more years it will be all \r\nRosebuds, and they do it honoring their mother's work. And \r\nit just seems like we need to teach them the jobs and I \r\nhadn't realized that in working you won't have as much time \r\nto do as when you're retired. Not even to be home to answer \r\nthe telephone when they call. \r\n \r\nKelly: So if you, if you were go, to look back to the girl \r\n----------------Page (28) Break----------------\r\nyou were when you were a Rosie the Riveter, what, what \r\nwould you say to that girl now? If you could look back at \r\nyourself at that age? \r\n \r\nFrances: Well, maybe there again, appreciate it. Because I \r\nknew such a little bit. I was real happy then that I was \r\nable to do the work, but you know, I didn't really realize \r\nhow much we had to learn, how much we didn't know, and then \r\nwhat we did. \r\n Time Magazine said that what we women had done was a \r\nmiracle when they found out how many ships we'd built and \r\nhow many welders. But we want to say, though, there were a \r\nfew good men there and most of our men were, beginning when \r\nwe were in school, in training, they were people who had \r\nexpertise and skills and they were probably exempted from \r\nthe military to stay home and teach women. But they had to \r\ndo it. \r\n I noticed one thing the way we worked. When we went up \r\non a problem, we women would immediately go and ask how to \r\nget out of it, how to do it and so forth. And the few men \r\nwho were turned down because of various reasons, health and \r\notherwise, maybe too old, too many children dependent, and, \r\nor maybe farmers, or had the skill that they got exempt, \r\nand they would just sit there and puzzle and puzzle and \r\n----------------Page (29) Break----------------\r\nwork it out. But we had no background for that. And so we \r\ndidn't know anything to do but just try to learn it. And I \r\nguess, as I look back I'm wondering how we all, how we did \r\nit, because they, there were 88,000 ships that were built. \r\n \r\nJohn: One of the things that I'd like to point out when we \r\ndo get an opportunity to go and talk. Which, incidentally \r\nthey've asked us to come to Washington D.C. twice, and out \r\nto San Antonio and Salt Lake City and so forth, because \r\nthere's not too many of us left that will make talks on \r\nthat. \r\n \r\nFrances: Well, we... \r\n \r\nJohn: But one of the things that I'd like to emphasize is \r\nthat our air force was able to bomb the German factories \r\npretty well out of existence, so that they couldn’t make \r\nairplanes, or tanks. If we shot down an airplane, they \r\ncouldn't replace it. But it was different with us. Our \r\nfactories kept operating. And I think the one main \r\ndifference that made it possible for us to win was the fact \r\nthat we had stuff to fight with the enemy didn't have, was \r\nlimited near the end of the war. \r\n \r\n----------------Page (30) Break----------------\r\n00:33:31:50------------------------------------------------ \r\n \r\nJohn: Most of the men were called away to go to the armed, \r\ngo to the military, but the women came in and made the \r\nplanes and made the tanks and made the ammunition. And that \r\nwas the reason, I think the one key factor that allowed us \r\nto win, was the fact that we, that they provided to us what \r\nwe needed whereas our air force was able to eliminate the, \r\nto a large extent the Japanese production, but even more so \r\nthe German production. \r\n \r\nKelly: One of the things that, as someone from the younger \r\ngeneration, after I've talked to so many Rosies, is that \r\nthere, is learning how many Rosies went to work. For the \r\nfirst time in America, this is, you know, a huge amount of \r\nwomen that were working for the first time, and it really \r\nopened doors for the next generations. What do you, what do \r\nyou think about that? \r\n \r\nFrances: Well, I think it was wonderful. We, I don't know \r\nwhether you were there this morning when I talked a little \r\nbit about this. We, we want to do the association for the \r\nlegacy that we want to create it to the women. And then we \r\ndid open the doors for the women to go to work. Now, \r\n----------------Page (31) Break----------------\r\nsometimes men don't care too much about that, so we don't \r\nwant to over emphasize it. But we did things that we didn't \r\nknow we could do. And then actually, then we changed \r\nfashions, about the pants suits and so forth. \r\n But in our speaking, John, he tells a little bit about \r\nhis work as a paratrooper. And paratroopers are different \r\nnow, because they, they're just about extinct because, you \r\njump, don't jump behind the lines. The war we're fighting \r\nnow, we don't know who the enemy is, might be the next door \r\nperson, and so he talks just a little bit about that, and \r\nthey he gives a tribute to these Rosies and then I tell a \r\nlittle bit about it. And there were about, we don't know \r\nfor sure, but over six million women who worked for pay and \r\nthen another three million or more, depending on what... \r\nFord Motor Company had upwards toward ten million at one \r\ntime just on some big thing they were doing and we don't \r\nknow the exact numbers about that. \r\n \r\n00:36:02:13------------------------------------------------ \r\n \r\nKelly: Now can you, you were talking a little bit today, \r\njust so people understand, you were talking about the Rosie \r\nthe Riveter Day and Memorial Day. Can you explain a little \r\nbit about that so future generations can understand what \r\n----------------Page (32) Break----------------\r\nyou mean? \r\n \r\nFrances: About Rosie Day? \r\n \r\nKelly: Rosie Day and Memorial Day and how, what you feel \r\nabout that? \r\n \r\nFrances: Well, it's getting formulated pretty much now. \r\nAbout the Memorial Day, which is giving tribute to those \r\nwho lost their lives, paid the supreme sacrifice, in, it \r\ndoesn't do so much about the World War One, I don't think, \r\nbut it certainly about World War II and the rest of, \r\nVietnam and so forth. And I was just maybe, I didn't want \r\nto, I hated to say it, but I, maybe I'm a little extreme \r\nabout that, but I didn't want us to have a good time. Some \r\nof the chapters have been saying “Oh, have a picnic. Have a \r\nparty.” And so forth and then the ladies said today, they \r\nplanted a tree to honor a Rosie. But that's not what, we \r\nneed to be honoring the dead. Or I thought that... \r\n \r\nJohn: Well, I think it, Dawn Lean sort of made it clear \r\nthat she was recommending that how the Saturday before \r\nMemorial Day as emphasis on Rosie, and that wouldn't really \r\ntake away, I think, from the... \r\n----------------Page (33) Break----------------\r\n \r\nFrances: No, except that's the reason she wanted it, so we \r\ncould always know when it is, just remember the Saturday \r\nbefore Memorial Day, so our Rosie Day and Memorial Day are \r\nintertwined there. But I think we can work that out and \r\nrealize, you know, what, as our daughter said, nobody in \r\nfuture years is going to be patriotic very much at all, it \r\nseems. \r\n \r\nJohn: Well... \r\n \r\nKelly: And you were talking the difference between \r\npatriotism and political today a little bit too for the \r\nassociation. What did you mean? \r\n \r\nFrances: Well, what I didn't tell in full, but, in our \r\nhistory project, and we have kids from fourth grade writing \r\nhistory projects and we've had two dissertations, and I \r\nheard of one today, in progress. Doctoral dissertations, \r\nand so that's one of our projects, is to carry on the \r\nhistory, but we are historical, patriotic, and what's my \r\nother one? Historic, educational. \r\n \r\nJohn: Educational. \r\n----------------Page (34) Break----------------\r\n \r\nFrances: Educational. We're helping these young children \r\nwrite pro... things and... \r\n \r\nJohn: I think she primarily wants to emphasize they're not \r\nwomen's libbers. That they are not the feminist movement. \r\nThat sure they did open the door for women to do work that \r\nthey hadn't done previously. But they didn't do that on \r\npurpose. I mean, it took, it just worked out that they did \r\nopen the door, and when they proved that they could do the \r\nsame kind of work that men had done, but she wants to \r\nemphasize that that's not their purpose. They are not \r\ntrying to push for women's rights. The women did it, not to \r\nget their rights, but to help win the war and get it over \r\nwith. \r\n \r\nFrances: Get the boys home so we could marry them and have \r\nchildren and get on with our lives. And so that's very \r\nimportant to me, that... \r\n \r\nJohn: Some of the kids that write, that write her questions \r\nin order to write their term papers and so forth want to \r\nemphasize, by asking her, did she get paid as much as the \r\nmen did. And they probably didn't. \r\n----------------Page (35) Break----------------\r\n \r\nFrances: Did I get harassed, or harassed, whichever you \r\nwant to call that word. You can tell that some teachers are \r\nfeeding that into those little minds. \r\n \r\nJohn: There was, well, there was a certain amount of \r\nharassment, I'm sure. \r\n \r\nFrances: Oh, yeah. \r\n \r\nJohn: She didn't experience it, she said. \r\n \r\nFrances: No, I didn't, but you know, the men might have \r\nfelt we were trying to take over. And some things we could \r\ndo better than a man, because we had been used to knitting \r\nand crocheting, we had dexterity in our fingers, working \r\nwith those rivets that the men didn't have. And then also \r\nwe had been used to doing things and, some of the ladies \r\nwere little and they could get into the nose cone and do \r\nrivets down in that and the men didn't want to. They were \r\nbigger, you see, and they didn't want to do that. So in \r\nsome ways we did better. \r\n But during the war they wanted, they kept, had been \r\nposters. “Come to work. Come to work.” And they raised the \r\n----------------Page (36) Break----------------\r\nage on up 'til finally they said if you could move at all, \r\ncome on. \r\n We had blind people working, and they could sort \r\nrivets very well because they could use just the feel, \r\ntouch. And so it was just really everybody working. The \r\nnative americans worked and black people, we called them \r\ncolored people then, they got to work, and they had never \r\ndone anything except domestic work and so this was a real, \r\nreal thing for them. \r\n Some of them wanted to keep working, and some of them \r\ncould keep on working, but, as I said this morning, they, \r\nwe didn't need that many ships and planes after we won the \r\nwar, so that's why we were cut off. But the, and the men \r\nshould get their jobs back, too, but some people didn't get \r\nto come back that got killed. And so there were some jobs \r\nand some people stayed on working. But I wanted to go back \r\nto school and finish school. And teaching was what I wanted \r\nto do. \r\n \r\nKelly: Well, you did keep working. \r\n \r\nFrances: Yeah. \r\n \r\nKelly: You did keep working. \r\n----------------Page (37) Break----------------\r\n \r\nFrances: All in all, I guess we worked about forty-seven \r\nyears. We worked at, he worked thirty-one at Samford and \r\ncame from Associate Professor to Dean of the School of \r\nEducation. And then I worked, I was Assistant Professor and \r\ngot up to Professor and worked at early childhood and \r\nelementary education, and that was all right, in \r\npsychology, in the school of education, until he got to be \r\nmy boss. And so they said, “We've got to do something with \r\nFrances, Fran.” \r\n \r\nJohn: And so I fired her the first. \r\n \r\nFrances: When they called him in and told him they wanted \r\nhim to be the dean, the dean was retiring, and so he, they \r\nsaid, “We want you to be the dean, but we don't know what \r\nto do with Fran.” And so John said, a good thing he said, \r\n“I'll ask her.” \r\n And so he came home and I said, “Oh, I'm so happy \r\nthey've offered it to you and I'll just flip down there \r\ntomorrow and tell them if they'll pay you enough, I will, \r\nI'm not that ambitious. I'll quit working.” So that's what \r\nI did. I went down and I said, “If you'll pay him enough, \r\nthat we can live on one school teacher's salary, then I \r\n----------------Page (38) Break----------------\r\nwill just quit working.” And they said, “No, we want you to \r\nkeep working, but maybe we'll have a job half time for \r\nyou.” \r\n And so a home economics teacher, I had two majors, \r\nearly childhood and elementary education and home \r\neconomics, and so a teacher retired or moved away or got \r\nmarried or something, and I got the job half time, and then \r\npretty soon I got back to full time, 'cause they needed me \r\nin education. \r\n Back in those days Samford didn't have enough money to \r\nhire people with doctorates, and so they used anybody that \r\nhad a doctorate, and so I'm sure I got to go back in the \r\nschool of education and work part time in that, and home \r\neconomics was in the school of liberal arts so I had a \r\ndifferent dean. But that would not, I can see why that was \r\ngood. John would help with the schedules and he, somebody \r\nmight say I had 9:30 class that was always better then the \r\n8:00, you know. And then also when I went off on a \r\nprofessional meeting I'd have to ask the dean and that \r\nwould be John, and we usually got a little money from the \r\nschool, and then we would go to that, and they might say, \r\n“Well he's giving her more time and more money,” and so \r\nforth. So I could see why it worked out. \r\n But when I went back, full time half home economics \r\n----------------Page (39) Break----------------\r\nand half education, I never did go to his staff meetings. I \r\nwent to the department of home economics. \r\n \r\nJohn: Then you should be running the place. \r\n \r\nFrances: Well, we've worked together in different schools \r\nall the time. And we've been two individuals, \r\nprofessionals. When we first went to Samford, somebody came \r\naround to me and said, “When, are you on a temporary basis, \r\nor long term?” And I said, “Well I guess I'm permanently \r\nhired. I'll just go in to  see.” So I flipped down there \r\nagain and talked to the dean of the school, I mean of the \r\nwhole university, and he said, “No, you were hired for full \r\ntime for, on a definite long term basis.” \r\n \r\n00:44:58:04------------------------------------------------ \r\n \r\nKelly: Well that was unusual, well I mean, that was unusual \r\nfor women at the time, right? \r\n \r\nFrances: Yeah, it could have problems. \r\n \r\nJohn: And that school was unusual for a husband and wife to \r\nhave both of us. \r\n----------------Page (40) Break----------------\r\n \r\nKelly: Yeah, but as a woman it was unusual to keep working \r\nthe whole... \r\n \r\nFrances: Yeah, yeah. \r\n \r\nKelly: The whole time that you were raising... And you had \r\na daughter or a son? \r\n \r\nJohn: We had both, a son and a daughter. \r\n \r\nFrances: A son and a daughter. Our son is, Wayne Carter, \r\nJohn Wayne Carter. In, since, people came over from Europe, \r\nthe old world, the first son in every generation has been \r\nJohn, and John's daddy is John Franklin and he's John \r\nThomas, and then our son was, we was just getting a name \r\npretty, we didn't even know John Wayne, and I'm not sure he \r\nwas a famous movie star when he was born. \r\n \r\nJohn: Yes, he was, but we didn't realize that we were \r\nnaming him after a movie star. \r\n \r\nFrances: And then our daughter is a librarian at an \r\nelementary school and she's a Rosebud and does the \r\n----------------Page (41) Break----------------\r\nnewspaper. \r\n \r\nKelly: Oh yeah, we talked, we yeah. \r\n \r\nFrances: Named Mail Call. \r\n \r\nKelly: Yeah, yeah, and she, so she worked, and so, in a way \r\nthe Rosies kind of did open a door for a lot of women to \r\nthink about their lives differently. And it was the first \r\ntime in history that they were really really getting their \r\nown money, too and it was... \r\n \r\nFrances: Since we've retired we have gone to third world \r\ncountries and have taught. And we've both, John's daddy \r\ntaught 'til he was eighty-nine, and so John wanted to stop \r\nat sixty-five. He said between sixty-five and seventy-five \r\nthere's a window of opportunity that we could travel and do \r\nthings. So we don't take vacations just for the fun of it. \r\nWell, when we had young children we'd go to the beach, but \r\nwe just, we're too much workaholics and so we just did that \r\n'til we, 'til we were about eighty. And we may go overseas \r\nagain you have to die somewhere, I guess. \r\n \r\nKelly: Well, is there any last favorite memory, or favorite \r\n----------------Page (42) Break----------------\r\nlittle story that you have that you haven't shared with us \r\nthat you'd like to tell before we send you off to dinner. \r\n \r\nFrances: I'll let John go first. \r\n \r\nJohn: Well, I think we have covered most everything that I \r\ncan think of at this point. We are grateful for people and \r\nmovements like yours, that's taking an interest now in \r\ntrying to preserve the legacy that the women, Rosie the \r\nRiveters, left and give them the recognition that we think \r\nis due them. So we appreciate what you all are doing to do \r\npreserve that. \r\n \r\nFrances: And the reason I asked you this morning to get it \r\nstraight about New York City College because we, the \r\nlibrary of congress is doing this also and we've done it \r\nfrom Alabama and Mississippi and, I believe Louisiana. \r\n \r\nJohn: Now, but I believe you said this is New York \r\nUniversity, now, isn't it? \r\n \r\nKelly: Yes. \r\n \r\nJohn: Not City College? \r\n----------------Page (43) Break----------------\r\n \r\nKelly: No, it's New York University. Yeah, it's quite a big \r\ndeal. \r\n \r\nOff Camera: It's a private university. It's a private \r\nuniversity. \r\n \r\nFrances: Is that right? Good. \r\n \r\nOff Camera: I have a question. \r\n \r\nFrances: Ok. \r\n \r\nKelly: Oh, good. \r\n \r\nOff Camera: You're wonderful educators, you've educated me. \r\nI want to know the definition of a woman's libber. \r\n \r\nFrances & John both laugh. \r\n \r\nFrances: Well that was a word... \r\n \r\nJohn: It depends on who’s giving it. \r\n \r\n----------------Page (44) Break----------------\r\nFrances: That was a word... \r\n \r\nOff Camera: What's your definition, when you say you're \r\nnot, I just, I want to know what you, because you're so \r\nmany wonderful things to me. \r\n \r\nFrances: Well, I guess you're familiar with when they tried \r\nto get the constitutional amendment passed. \r\n \r\nJohn: ERA \r\n \r\nFrances: Which failed. \r\n \r\nJohn: Get the, get that amendment, women's rights \r\namendment, what was that amendment to the constitution that \r\nthey lacked one state getting? Here several years ago? \r\nEqual rights, ERA, equal rights amendment. \r\n \r\nKelly: Well that's equal rights... \r\n \r\nFrances: But in layman's terms, I guess I would say that a \r\nwomen's libber is a coined expression, it may be in the \r\ndictionary, the new dictionaries, I don't know, but I would \r\nthink its women fighting for their rights, equal pay, equal \r\n----------------Page (45) Break----------------\r\nwork and so forth. \r\n \r\nJohn: She's not against that. \r\n \r\nFrances: I'm not against it. \r\n \r\nJohn: It's just that this organization is not... \r\n \r\nFrances: What we say is we are, we want equality of \r\ngenders, not you know, fighting above and so forth. And I \r\nhave belonged to a B & PW club and... \r\n \r\nOff Camera: What's that? \r\n \r\nFrances: Business and Professional Women, and they were \r\ncomplaining, there were some kindergarten teachers at a \r\nconvention I went to and they said women don't help each \r\nother. When some of them make it to the top, they don't \r\nturn around and help the women. And so I'm for equality and \r\nso forth. \r\n There is one thing, though, when we worked full time \r\nat Samford, we, being two individuals, the first thing that \r\nhit us was somebody had died and we were going to send \r\nflowers from the department, and they said each one would \r\n----------------Page (46) Break----------------\r\npay an amount. And they gave us the same amount as a \r\ncouple. And we said, “No, we'll take two total.” There were \r\nfive people in the department when we went there, and we \r\nsaid we'll pay for two of them. We're two individuals. And \r\nwe tried to do that. And we worked together, all of our \r\nmarried lives, in fact, he's got a job. I was in debt when \r\nI got through college and he came home from the service, \r\nand he'd saved a little bit. You see you get fifty dollars \r\na month back then, a month. But you got room and board, of \r\ncourse, and then... \r\n \r\nJohn: I got more than that. I started out with that. \r\n \r\nFrances: As a private, as a private. But then he got to be \r\nparatrooper and that doubled his pay. But it was... \r\n \r\nKelly: It was more dangerous? \r\n \r\nFrances: Uh huh. \r\n \r\nJohn: And, and then... \r\n \r\nFrances: But does that help? Did I answer her question? \r\n \r\n----------------Page (47) Break----------------\r\nOff Camera: There was someone at the door. Sorry. Yes, you \r\nanswered it perfectly. Hello? \r\n \r\nJohn: I think, I think... \r\n \r\nKelly: Come on in. We're just about done. \r\n \r\nOff Camera: Ok, we can wait. Do you want to have it? No, we \r\nhave too many people, we'll wait. Ok. \r\n \r\nJohn: I think... \r\n \r\nOff Camera: You sound more 'liberated' than anybody I ever \r\nmet. \r\n \r\nJohn: I think I was the one... \r\n \r\nFrances: Well, I tell you, that answered the question. \r\n \r\nOff Camera: 'Cause you sound liberated and equal. \r\n \r\nJohn: I think I was the one that used the term 'women's \r\nlibber,' anyway. And I think both of us may consider it if \r\nthat if that is the main purpose of somebody, that's their \r\n----------------Page (48) Break----------------\r\nwork, that' s their emphasis is to make sure that women are \r\nraised. That's not the purpose of this organization, to be \r\nalthough they were instrumental in doing it, that wasn't \r\ntheir purpose, and it's not the purpose today, I think is \r\nwhat, what I thought she meant. \r\n \r\nFrances: And we have to really, do merit rather than \r\npushing just for, you know, rights. And another way we \r\ntried to do at Samford, we had two babies and so they, one \r\nwas two, in the second grade, and one was fourteen months \r\nwhen we went to Samford and we decided then, we had night \r\nclasses. And he said, I will, I will tend to the children \r\nand you take your night classes just like a single person. \r\n  And that's what I'm thinking of is, is but, it's a \r\ncoined word, and it sort of has a, a really, a bad \r\nconnotation. But on the other hand I would like to say its \r\njust women getting their deserves, getting paid as much. \r\nAnd its still not equal in the pay. But then we women, \r\nsometimes do have to, when we're having babies, we have to \r\nask for exceptions because of our family more than the men. \r\nAnd that's the way we worked it out. Of course we had \r\nhealthy babies, and that makes a difference. So I don't \r\nknow if that answers your question or not. \r\n \r\n----------------Page (49) Break----------------\r\nKelly: Wonderful. Yes, we kept you a little over. \r\n \r\nJohn: But I mean, I expect, we're, if we're going to go to \r\ndinner. Are you all coming to dinner? \r\n----------------Page (50) Break----------------\r\n"}}]