[{"type":"add","id":"dorice-dorine-hamilton","fields":{"identifier":"ROSIE_INTERVIEW_014","url":"/interviews/dorice-dorine-hamilton","label":"Dorice Dorine Hamilton","description":"Dorice Dorine Hamilton was trained as a welder but found a job as a riveter for Boeing in Wichita, Kansas. ","image":"/images/ROSIE_INTERVIEW_014-interview-thumbnail.jpg","content":"Dorice Dorine Hamilton \r\n \r\n \r\nThe Real Rosie the Riveter Project \r\nInterview 14 \r\n \r\n \r\n \r\nInterview Conducted by  \r\nAnne de Mare  \r\nJune 27, 2010 \r\nNashville, Tennessee  \r\n \r\n \r\n \r\nFor The \r\nFor the Tamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n----------------Page (0) Break----------------\r\nInterview: Dorice Dorine Hamilton \r\nInterviewers: Anne de Mare  \r\nDate: June 27, 2010 \r\nPlace: Nashville, Tennessee \r\n \r\nHamilton: That’s just an old age thing if you uh talking to \r\nsomeone as old as I am, they have one conversation.  How do \r\nthey feel? How well are they- what have they been doing? \r\nAnd they’ve been going to the doctor. Fortunately for me, I \r\nstill drive so I can drive myself to the doctor in Wichita, \r\nKansas. \r\n \r\nDe Mare: Fantastic.  So can you do me a favor and can you \r\nintroduce yourself to me and tell me where and when you \r\nwere born? \r\n \r\nDorice:  Well I guess we need to talk about uh not so much \r\nthe the birth but that the- the name.  I’m Dorice Dorine \r\nHamilton.  Now uh my father wanted to name me Deloris and \r\nmy mother didn’t like Deloris. And so my name ended up- two \r\nnames with only one letter difference in ‘em.  It’s Doris \r\nspelled funny D-O-R-I-C-E and Doreen spelled not like \r\neveryone wants to spell it but D-O-R-I-N-E. So I was born \r\nin Willington, Kansas August 18, 1919. Uh Willington Kansas \r\n----------------Page (1) Break----------------\r\nis a town where they had the first railroad. Where they \r\nstocked the cars and made changes for the railroad cars. \r\nAnd so they had what was the first strike in in the United \r\nStates and so the people that went back to work, possibly \r\neveryone knows, they called them Scabs.  My father did not \r\nwant to be a Scab so he would not go back to work, which he \r\nwould have been much better off if he had gone back to work \r\nbecause he ended up with asthma but we ended up on a farm, \r\nwhich was a bad place for him to be but it was a fun place \r\nto grow up.  I had been in Willington up to the age of 4 \r\nand so for then on I was in Greenwood County, Kansas on a \r\nfarm- on a farm-160 acre farm.  I had said I had never seen \r\na colored person until I went to work in Wichita uh after \r\nhigh school graduation. The- it was a total community where \r\neveryone knew everyone else. And uh for sport they they \r\ncleared out the dinning room- the living room area and had \r\na fiddle and a guitar and danced. Square dances. Uh my \r\nfather did the fiddling and my boyfriend did the guitar \r\nplayer so he got to play the guitar and watch me dance with \r\nall the other fellas. Now what else would you like to know?  \r\nWhat do I go on from there?  \r\n \r\n03:24:19-------------------------------------------------- \r\n \r\n----------------Page (2) Break----------------\r\nDe Mare: I would like- I would love to know the story about \r\nhow you got the job as a Rosie and exactly what you did? \r\n \r\nHamilton: Oh we’re going to get now to Rosies.  We’d like \r\nto just talk about Rosies.  I- my husband and I were \r\nmarried in June and in October he was drafted so in Wichita \r\nthey had a training- government training that was teaching \r\nriveting. So I went to riveting class. Now uh, there was \r\nsomething about the riveter. The riveting gun was heavy and \r\nI didn’t think I did a very good job of riveting. So I took \r\nthe first job Boeing offered cause you know you you were in \r\nthe class because Boeing wanted ‘em. And they wanted them \r\nfast. So the minute they offered me a job, I took it.  I \r\ndidn’t know what it was or anything and my uh instructor \r\nwas disturbed because he was teaching me riveting and I \r\nshould become a riveter. But I didn’t really think I was \r\nstrong enough. Uh, they offered me a job at a bench so \r\ntherefore I spent from a the time he went to service in \r\nOctober of ’42. It would be ’42 because that was the year \r\nwe were married.  And so...then interesting was part not that \r\nI worked at a work bench and worked on parts for 10 hours- \r\na 7 days- 6 days a week because I would not work on Sundays \r\nso the fellas were just really happy they got to work my \r\nSunday. \r\n----------------Page (3) Break----------------\r\n \r\n05:37:18----------------------------------------------- \r\n \r\nHamilton: The temperature was 120° in the building. I was \r\nparts from a hydro press and it’s one of those things that \r\ndrops down on forms and uh, the metal is straight but it \r\ndrops down of the forms and makes parts. But it doesn’t do \r\na good job so you had to do what the called hand forming.  \r\nSo you banged out a lot of the little wrinkles and that \r\nsort of thing. So that was what I was doing. A lot of them- \r\nthey had the parts the- they used on the hydro press but \r\nthen they had some that when you’d hammer them into the \r\nright a a form they were usable. And they were lightweight \r\naluminum and normally they had to go to what they called- \r\nwhere they cooked them and made them firm.  Where they \r\ncould be heat-treating that’s the right word.  \r\n \r\nDe Mare:  And now did you go- did you go- did you travel to \r\nWichita specifically to work at Boeing to get that job? \r\n \r\nHamilton: Oh no. I was I was a high school graduate and my \r\nmy sister wanted me to come to Wichita so I just took \r\nwhatever was handy, which was- happens to be the job of \r\ntaking two little girls uh uh who worked for- I mean who \r\n----------------Page (4) Break----------------\r\nwere the daughters of a lawyer and a Bridget playing mother \r\nand so we had a good time when they were gone. But because \r\ntheir parents were gone so much they became you know demons \r\nwhen the parents arrived. \r\n \r\n7:29:14-------------------------------------------------- \r\n \r\nDe Mare:  I know what you mean. So so you were working \r\ntaking care of those children? \r\n \r\nHamilton: Yea- yes and then we got married. \r\n \r\nDe Mare: And then you got married... \r\n \r\nHamilton: And he went to the service and I went to the \r\ntraining school. \r\n \r\nDe Mare: And now- \r\n \r\nHamilton: And then I went to Boeing and the first job that \r\nthey offered me. \r\n \r\nDe Mare:  And was this the fiddle-playing boyfriend? Was \r\nit- Did you marry- \r\n----------------Page (5) Break----------------\r\n \r\nHamilton: No. My father did the fiddling.  He did the \r\nguitar. \r\n \r\nDe Mare:  The guitar.  That’s right. \r\n \r\nHamilton:  Yes. \r\n \r\nDe Mare: But it was the guitar-playing boyfriend? \r\n \r\nHamilton: And it was western music and it was square \r\ndancing. Uh, I don’t think they do all that much square \r\ndancing but it Wichita now they have special time everybody \r\nwho does square dancing comes to town and really has a good \r\ntime.  Square dancing. \r\n \r\nDe Mare: So do you remember when you were younger how much \r\nmoney you earned when you started working in the- at Boeing \r\nand what that did you change your life? \r\n \r\nHamilton: Well you see that’s why the instructor was \r\nunhappy that I didn’t wait for welding because it was \r\nhigher paid than standing at that bench. Now I uh, I have a \r\nyounger sister and she came out of high school and I \r\n----------------Page (6) Break----------------\r\nencouraged her to come out and apply at Boeing and she she \r\nwould uh go out there, and it was the same uh person that \r\ninterviewed her and they would say you’re too little. And \r\nand I said, ‘you just keep going back.’  And finally she \r\nsays, ‘I’m tired of seeing you.’ And she got a job as a \r\nriveter.  She’s a really happy Rosie but she’s down in \r\nFlorida and not at this convention. But she is the one that \r\nthat got all the our people- myself and our family into the \r\nRosies because she’s the a thoroughly enthusiastic person \r\nabout her job at Boeing because she riveted the floor in \r\nthe Captain’s cabin. And so we’ve been to the area in \r\nDayton where we could walk through the shell. And I know \r\nshe thought that was great and wonderful to stand once \r\nagain on on the floor of the cabins- of the Captain’s \r\ncabin.  \r\n \r\n09:52:16------------------------------------------------ \r\n \r\nDe Mare: Now you are the historian for the society, right? \r\n \r\nHamilton:  Yes, but then that’s because I worked for the \r\nFederal Government for 38 years. And uh uh so, government \r\nis strict with regulations and all of this.  And I started \r\nas a clerk typist and so you know it was from the ground up \r\n----------------Page (7) Break----------------\r\nand consequently I ended up doing historians for the Rosies \r\nbecause you know I have a library.  Uh, I started taking \r\npictures at age 18 and I’m 90.  \r\n \r\nDe Mare: You must have a lot of photographs.  \r\n \r\nHamilton:  Two very big libraries built by a friend. Uh, \r\nthey’re gorgeous you know and they go to the ceiling.  \r\n \r\nDe Mare: What what is one of your favorite stories and it \r\ndoesn’t even have to be one of your story because you’re \r\nthe historian. But what are some of the stories about Rosie \r\nthat you wish people would know? \r\n \r\nHamilton: Well the the one I didn’t say about Boeing was my \r\nhusband was in the Army and it was the 13\r\nth\r\n armored division \r\nuh the Army. So he told be that 13 was lucky. And he uh- \r\nhis group was in the Battle of the Bulge and they sent him \r\nhome- they were going to train him for the next war we were \r\nabout to get into. So he- the war ended and everybody you \r\nknow just walked out the- And so I didn’t have that \r\nexperience because he was on furlough so I was on leave \r\nfrom Boeing so I like to impress everybody that uh, I \r\n----------------Page (8) Break----------------\r\nworked at Boeing until September you know so they think I’m \r\na real wheel because I didn’t go out with the group \r\n \r\n11:56:15----------------------------------------------- \r\n \r\nDe Mare: What um- did you enjoy the work that you did? I \r\nmean you talk about- \r\n \r\nHamilton: Oh heavens no. \r\n \r\nDe Mare: Yea. \r\n \r\nHamilton: You know all I did was bang this metal down to \r\nthe the fitting of the form and and uh pray that my husband \r\nwould get home from the service and hope I’d have a letter \r\nwhen I got home. And that’s what I did when I got home.  I \r\nwrote him a letter. I wrote a letter to him everyday. \r\n \r\nDe Mare:  Everyday... \r\n \r\nHamilton: But you see the way the mail is it would have to \r\ncatch up with him and so he’d get a pack of letters and \r\nthat’s like about the way they came because he was a good \r\nbut then he was a very conscientious Army person and they \r\n----------------Page (9) Break----------------\r\nwould black out if they said something you know that was \r\ninformation that they wouldn’t want him- so he never got a \r\nblacked out letter because he just says, ‘I love you.’ And \r\nyou know good stuff like that.  \r\n \r\n12:54:08------------------------------------------------- \r\n \r\nDe Mare: Uh when you were in Wichita working at Boeing, \r\nwhere were you living? Were you living at ho- where- \r\n \r\nHamilton: I was working at- living uh a few blocks off of \r\nuh Central in uh two-storey house that had been built into \r\ncompart- to apartments and it had four on the top floor and \r\nfour below and so uh basically they had a bedroom, a \r\nkitchen, dining, living area and that’s about all it had in \r\nit and the two on one side and the two on the other had to \r\nshare a bathroom and a hall and uh- \r\n \r\nDe Mare: Was it mostly- \r\n \r\nHamilton:  And at one time I and my relatives had all of \r\nthem but one. So you know it it was an apartment and not a \r\ngreat place to live and I had a second storey one so I \r\n----------------Page (10) Break----------------\r\nsuppose that might have kept me in good shape walking \r\nstairs.  \r\n \r\nDe Mare: Um, was there any- anything that happened to you \r\nduring that time that you think that is a funny story or a \r\nchallenging story or something that you’d like to share \r\nwith us?  \r\n \r\nHamilton: Um uh, no the only thing that I think about that \r\nwas really nice was was I and one other lady were the only \r\nladies in our group and those fellas were very nice to us. \r\nI mean they really- they didn’t you know act, hey you don’t \r\nknow anything or you’re not doing your job good enough or \r\nsomething they they uh some of them were really not that \r\nold so they were excused no doubt from the service because \r\nthey were working about Boeing. \r\n \r\n14:48:00--------------------------------------------------- \r\n \r\nDe Mare: And what did you- what was being built at Boeing \r\nat that time? \r\n \r\nHamilton: The B29 parts uh we had a really really fun thing \r\nthat I don’t remember now whether was a uh the hundredth \r\n----------------Page (11) Break----------------\r\none that rolled out or what it was but they rolled it out \r\non the flight line and everyone got to go out and get their \r\npicture taken.  And so I’m still looking for that picture \r\nbecause I know where I was standing and I know they could \r\nsee me and when I move and have to throw all this stuff \r\naway, I hope I find it.  \r\n \r\nDe Mare:  I hope you do too. \r\n \r\nMimi:  How dangerous was your job?  Were there any \r\naccidents? \r\n \r\nHamilton:  Well I’m wearing a hearing aid and when the \r\nhydro press came down, he came- it came down with a \r\nterribly big bang.  So I always say they took my hearing.  \r\nThat’s my excuse I’m really 90. \r\n \r\nDe Mare:  That’s terrific.  Thank you so much. \r\n \r\nHamilton:  Well we love attention.  Old people love \r\nattention you know.  Uh uh, I think that’s one thing about \r\nbeing old, learning how sweet people can be.  But uh last \r\nyear our convention at Las Vegas and we had to go through \r\nthe wild area you know. Every time- it was nice we had a \r\n----------------Page (12) Break----------------\r\nmeeting room with a dining room area next to it but but but \r\nI was at that time just beginning to have a bad knee so so \r\nmy niece had been taking me.  Well hey I finally had to \r\nhave her go first and follow her or they were just going to \r\nknock me flat. So I didn’t really think it was a great \r\nplace to have- but I suppose people who like that \r\natmosphere thought it was great. But then I’m a historian \r\nand so we had to you know get the register and get the \r\npictures and the like and so because we were all there we \r\narrived at the same time which you know like here you take \r\ncare of them when they arrive.  I bet you know something \r\nabout trying to get together and have the time right and \r\nget the attention and get the time and you know doing a \r\ngood job. \r\n \r\nDe Mare: Yea...thank you so much, Dorine.  It was a lovely to \r\nmeet you. Really lovely to meet you. \r\n \r\nHamilton:  Well I wish you uh a good experience with your \r\njob.  You all seem very enthusiastic.  \r\n----------------Page (13) Break----------------\r\n"}}]