[{"type":"add","id":"esther-horne","fields":{"identifier":"ROSIE_INTERVIEW_002","url":"/interviews/esther-horne","label":"Esther Horne","description":"The death of Esther's father left her once middle-class family destitute.  She worked defense jobs during the war. ","image":"/images/ROSIE_INTERVIEW_002-interview-thumbnail.jpg","content":" \r\n \r\n \r\n \r\n \r\n \r\n  \r\nEsther Horne \r\n \r\nThe Real Rosie The Riveter Project \r\n \r\nInterview 2 \r\n \r\n \r\n \r\n \r\n \r\n \r\nInterview Conducted by \r\n \r\nAnne de Mare & Kirsten Kelly \r\n \r\nFebruary 19, 2010 \r\n \r\nNew York, New York \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\nFor The \r\n \r\nTamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n \r\n \r\n----------------Page (0) Break----------------\r\n \r\n \r\n \r\nInterview: Esther Horn \r\n \r\nInterviewers: Anne de Mare & Kirsten Kelly \r\n \r\nDate:  February 17, 2010 \r\n \r\nPlace:  New York, New York \r\n \r\n \r\nDe Mare:  To begin, can you tell me your name?  Can you \r\nintroduce yourself and tell me how old you are? \r\n \r\nHorne: Sure. I’m Ester Horne, and next Wednesday, I’ll be \r\n87 years old. \r\n \r\nDe Mare:  And where were you born? \r\n \r\nHorne: I was born in New York City in 1922. \r\n \r\nDe Mare: And...um... could you just describe your childhood a \r\nlittle bit?  Um...where you lived? Um...your experiences as a \r\nyoung girl? Were there...what kind of hopes and dreams you \r\nmight have had for yourself, for your future, if you can \r\nremember? Um...any anecdote that you might want to tell me \r\nabout your early life before, you know, when you were a \r\nchild that really, y’know, stands up in your mind? \r\n \r\n----------------Page (1) Break----------------\r\nHorne: Well, a lot stands up in my mind from my early \r\nyears.  Uh, I was born in Harlem, and um... we lived there... \r\nUm, my father had his office...he was a chiropractor...his \r\noffice was on One Hundred and Eleventh Street, between \r\nLennox and Seventh Avenue, and we lived at, uh, Two West \r\nOne Hundred and Twentieth Street, which is right at Fifth \r\nAvenue and across from what is...what was then known as Mount \r\nMorris Park.  Today it’s Marcus Garvey Park.   \r\nAnd, um, I have many memories connected with our using \r\nthat park.  I remember it has a hill in it, with a bell \r\ntower.  And I believe the bell tower was from many many \r\ngenerations prior to the a 1920’s.  It was used as a fire \r\nalarm, I think.  And, um, my brother and sister thought it \r\nwas hilarious recalling incidents that took place in the \r\npark.  My brother is twelve years older than I.  My sister \r\npassed away when she was 92.  But they could still giggle \r\nabout pushing Esther in the carriage down the hill while \r\nthey was on skates, and, uh, the carriage crashing into a \r\ntree.  It was hilarious. To them.  To this day, I have a \r\ndread of moving through space without control.  I can’t...the \r\nthought of jumping from a plane with...even with a \r\nparachute...I’d have to be knocked on the head first.  So \r\nthat was one memory.   \r\n \r\n----------------Page (2) Break----------------\r\n00:02:56:21-------------------------------------- \r\n \r\nUm, I also remember my grandmother coming to stay with \r\nus for awhile and her taking me to the playground in Mount \r\nMorris Park. And I was on the monkey climb, and uh, the \r\nvery top – I don’t know what I was trying to do – but I, I \r\nfell straight down on my head.  And I was afraid to tell \r\nBubba, because she would get hysterical.  So, I didn’t say \r\nanything.  And I just remember, any time she crossed a \r\nstreet, (arms in the air) “Aaah ahhh ahh!!” she would s—-  \r\nso worried about getting run down.  And the traffic was \r\nNOTHING.  We didn’t even have traffic lights, y’know?  But \r\nanyway, um... \r\n \r\nDe Mare:  That’s wonderful. That’s a wonderful story.  \r\nWhere was she from? \r\n \r\nHorne:  From the Ukraine.. \r\n \r\nDe Mare: From the Ukraine... \r\n \r\nHorne: Um ... my...this is too involved maybe, but um, my \r\nfather and mother were childhood sweethearts.  They lived \r\nin the same town.  And, um, my father left - I guess he was \r\n----------------Page (3) Break----------------\r\nin his late teens - and he went to England...I don’t know why \r\nor how.  But uh, he lived there for several years.  And I \r\nhave pictures of him.  He was very natty and a handsome \r\nguy.  But they...they had an arrangement that they didn’t \r\ndiscuss with their relatives.   \r\nAnd when he came to America, he worked on East \r\nBroadway as a jeweler.  And his mother had been in the \r\njewelry trade too, and she never came.  She never saw him \r\nagain.  I’m named for her.  But, uh, he... he was a watch \r\nrepairer and a jeweler.  And after a couple of years, he \r\nand his cousin opened their own store right outside of \r\nLadies’ Mile.  They were on Twenty Seventh Street between \r\nSixth and Seventh Avenue.  Then he wrote to my mother, now, \r\nand uh, she came to America.  And, she had an uncle here.  \r\nShe stayed with him a couple of days, I guess, and then \r\nthey got married. \r\n \r\n00:05:44:11------------------------------------------ \r\n \r\nSo my brother was born on Twenty Seventh.  And uh, \r\nwhen my mother was pregnant with my sister... my brother... my \r\nbrother was about eighteen months old... she went back to the \r\nUkraine.  She said she was homesick.  She missed her \r\nparents... I don’t know the whole story.  At any rate, she \r\n----------------Page (4) Break----------------\r\nwas pregnant and had an 18 month... in her arms.  Um...when she \r\nwent there, she left my father here.  He wasn’t about to go \r\nback.   \r\nSo in the years that they were apart, he moved to the \r\nMidwest, and he went to school at the, um, Chiropractic \r\nInstitute.  I don’t know the full name of it, but it’s in \r\nLombard, outside of, uh, Chicago.  And, um, my mother, with \r\nher two children, was with her extended family, and they \r\nlived through Programmes, the Revolution, Civil War, and a \r\nWorld War.  And in, uh, I guess it was 1920, there was an \r\nexodus from their town, very much like Fiddler on the Roof.  \r\nI picture their town was like Anatevka.  But, uh, they had \r\nadventures coming to America that I grew up hearing about \r\nand...I represent the reunion.  That’s why there’s such an \r\nage gap.   \r\nAnd, um, at any rate...we lived in Harlem, and um, my \r\nfather wanted very much to move to the west Bronx, but my \r\nmother was not interested.  She was into everything she had \r\nlived through.  She never got out of that.  It was really \r\nbad.  But it is kind of cute...um, when my cousins had \r\npostcards, that the uncle living in America wrote to her \r\nfather and grandfather - they corresponded regularly - and \r\nin one of them, that the great grandfather, who ruled \r\neverybody, wrote “We think they have a secret agreement, \r\n----------------Page (5) Break----------------\r\n‘cause whoever we send to her, that the matchmaker brings, \r\nshe finds something wrong, and she won’t say what or where \r\nor when.”  And my mother held out...until I think she was \r\n23, which was practically an old maid.  But that was their \r\nstory, and uh...so she finally got here in 1920. \r\n \r\n00:08:59:08------------------------------------------------ \r\n \r\nAnd then he died suddenly in ‘29.  And, uh, he died \r\nJuly 30\r\nth\r\n.  And then October 13\r\nth\r\n, the market crashed, and \r\nour lives changed dramatically, ‘cause we had a very \r\ncomfortable middle class existence. And my mother was \r\ndistraught.  She never got over him.  And she lived to ‘94.  \r\nThat’s a long time. But uh... \r\n \r\nDe Mare: Can you talk a little bit about what she did for \r\nmoney when your father passed away? \r\n \r\nHorne:  It’s a mystery.  Uh...he had some money.  Uh, he was \r\nmostly invested in the New York School of Chiropracty.  He \r\nwas a dean.  He had a private practice, and he taught...and \r\nhe was an administrator.  So that went down the tubes. But \r\nthere was...there was some money.  And um, I guess we lived \r\non it until it was gone, because when my...my uncle advised \r\n----------------Page (6) Break----------------\r\nmy mother to invest what she had, to buy a store or \r\nsomething, and Lee and Jack, my brother and sister could \r\nhelp out...they were in high school and college...she was so \r\noffended that he...he would bring up a subject like money to \r\nher when she was so grief stricken.  They didn’t speak for \r\nabout five years.  They’re very dramatic people.   \r\nSo, um, my mother’s compatriots advised her to move to \r\nthe East Bronx, to slash her overhead.  My sister was in \r\nhigh school and working in Woolworth’s, after school.  My \r\nbrother was at City College, and he worked, um, for the \r\nsubway news stands.  So, of course they contributed.  And \r\nthen, at some point, probably three or four years later, we \r\nwent on home relief.  And this was, uh, something the \r\nfamily never got over, because we had known another way of \r\nliving, and uh, we were always different from our \r\nneighbors.  I was different from the other kids, because I \r\nremembered the kind of clothes I’d had, and going to the \r\nmovies with my parents, and going to the theatre – Yiddish \r\nTheater - and restaurants, and little trips, and what not.  \r\nAnd suddenly there was nothing.   \r\n \r\n00:12:04:11--------------------------------------------- \r\n \r\n----------------Page (7) Break----------------\r\nMy mother didn’t know how to handle money, and she didn’t \r\ncare.  So that was that.  But, um, it was a very painful \r\ntime for all of us...with our pride.  And, um, our neighbors \r\ndidn’t care much for us, I imagine, ‘cause my mother always \r\nlocked the door.  The neighbors couldn’t float in...in and \r\nout...like they did with each other, for tea, or something, \r\nand a chat.   \r\n \r\nDe Mare:  Do you, um...what was your first job that you had \r\nthen?  Did you go to work as a young girl before you worked \r\nduring the war?  Do you remember what you...can you talk a \r\nlittle about, like, your early work experiences? \r\n \r\nHorne: Sure. Um, in high school, I took an academic track, \r\nbecause I didn’t doubt that I’d go to college.  Y’know, \r\nit’s something a Rubinovich did.  You didn’t discuss it.  \r\nAnd, uh, I graduated in June of 1940, and I had heard that \r\nthe depression was over.  But the news didn’t really reach \r\nme, or a lot of other people.  And, um, I had to get \r\nworking papers, ‘cause I... I was seventeen.  I think the \r\ncut-off date was eighteen at the time.  And, uh, I found I \r\ndidn’t have anything to offer on a job.  I...I...anything I \r\nknew about job hunting I learnt from my pals, my friends.  \r\nSo we used to, uh, answer ads – want ads, in the Journal \r\n----------------Page (8) Break----------------\r\nAmerican.  I don’t know why...all the kids said that was the \r\nplace to look for a job.   \r\nAnd my best friend and I went to, uh, a local high \r\nschool at night to take commercial courses.  I hated \r\nbookkeeping, ‘cause I hated anything to do with numbers.  \r\nAnd, um, I did know typing, ‘cause that was the course in \r\nhigh school that everyone took.  But, the thought of being \r\nan office girl – I mean, it was a little better than a \r\nshopgirl or a factory worker...oh!  However, when I started \r\ntaking job interviews, at seventeen, I looked like twelve.  \r\nAnd I really didn’t have anything to offer. So I took a \r\ntest for WPA, and I earned fifty-two eighty a month. \r\n \r\n00:15:00:04----------------------------------------------- \r\n \r\nAt that point, my brother and sister were out of the \r\nhouse.  They were both married, and each had one child.  \r\nSo, again, it’s something you didn’t discuss.  You had to \r\nhelp out, and Mamma needed help.  She was always sick...she \r\nwas a hypochondriac, but she was sick, certainly \r\nemotionally.   \r\nAnd, um, I worked on WPA...no that wasn’t the first one.  \r\nThe first one, I went to the US Employment Service, and \r\nthey sent me out on a job at a press-clipping bureau.  You \r\n----------------Page (9) Break----------------\r\nhad to sit and scan newspapers for clients’ names.  And, \r\nthey sent me out on a twelve-dollar-a-week job...so I said \r\nfine.  It’s twelve more dollars than I have.  And when I \r\ngot to the place and was interviewed, the boss said “You \r\nwill be an apprentice for the first three months, and that \r\nmeans you’ll earn nine dollars a week.”  I said...I didn’t \r\nhave a choice...I took it.   \r\nAnd it was the kind of job where you couldn’t talk to \r\nanybody.  You just had to sit. And scan.  I remember \r\nlunchtime, I was reading War and Peace, and the boss said \r\n“You’re supposed to be studying the accounts!”  My time...! \r\nBut y’know, first exposure to the work place. Then after \r\nthree months, he called me in, um... ”We’re having a layoff.”  \r\nJust when I would have started earning twelve dollars a \r\nweek.  And I said “Layoff?  What am I going to do?”  He \r\nsays “It’s not my problem.”  So that was lesson number one.   \r\nAnd, uh, I went to another press-clipping bureau after \r\nthat, and I lasted about a week ‘cause I ran my mouth.  And \r\nI think while I was on that nine-dollar-a-week job, I wrote \r\nto the Home Relief, and said “Thank you for your help, but \r\nI’m working now.”  And I cut us off.  Didn’t ask anyone – I \r\njust did it.  And I went back to the US Employment Service \r\nwhen I was laid-off, and the interviewer yelled at me, and \r\nhe says “Do you realize that you scabbed?”  And I said \r\n----------------Page (10) Break----------------\r\n“What?! I’m not a scab!”  He said “You are! We told you it \r\nwas a twelve-dollar-a-week job!  Why did you accept nine?”  \r\nI said, “I didn’t know!”  Lesson number two.   \r\n \r\n00:18:03:00----------------------------------------------- \r\n \r\nThen...then it was, um, WPA.  I worked on a fertility \r\nstudy...in the 1880s.  I was assigned to the 1880s.  I was \r\ncalled a junior clerk, because of my age, but I was doing \r\nthe same work as the clerks for fifty two eighty a month. \r\nThey were getting sixty five or seventy...I don’t know what.  \r\nAnd somehow we lived on that, and um, we were vitamin \r\ndeficient, needless to say.  \r\nAnd I don’t know who told me about it, but there was a \r\nunion, Local 65 - the wholesale and retail workers union.  \r\nAnd they were down on 9\r\nth\r\n St., and they moved to Astor \r\nPlace.  So they had a hiring hall.  And they...they had \r\nfactory work.  “What am I going to do – factory work?”  But \r\nI couldn’t do anything else, which is too bad.  So...I \r\nstarted working in factories.  And factory jobs ran a few \r\nmonths each.  There’d be a layoff, and then you’d go to the \r\nnext one...and the next one... So one, um, one job was in a \r\nsuspender factory, and it was nasty.  The atmosphere was \r\nnasty.  The workers were nasty to each other. It was awful.  \r\n----------------Page (11) Break----------------\r\nAnd, uh, so I was glad when I was laid off, ‘cause I never \r\ndreamed of quitting anything.   \r\nAnd then I got a job at Parfum Lorelei – putting \r\nlabels on perfume bottles, and filling bottles, and \r\nchanging labels.  When, uh, the female products got old... \r\nthey got too dark...we put male names on, like Fisher’s \r\nStream and ...y’know...um... And that was a good union shop, and \r\nbefore long I became Shop Steward. I was 18 by then, \r\nanyway.   \r\nAnd, uh, the workers were very interesting.  They were \r\nmostly refugee women from Germany and Austria who were \r\nupper middle class in Europe, but here they were in \r\nfactories.  And, uh, one of them was married to a doctor.  \r\nI remember her...she was like a doll, a cute little doll... \r\nnever had worked in her life. But she and her husband \r\nmanaged to get to America.  Her husband was a doctor in \r\nBerlin, and here he... I think he was a cleanup man or \r\nsomething, in a hospital.  Eventually, when he did learn \r\nEnglish...years later, I learned...he took the medical boards, \r\nand he became a licensed doctor here too. \r\n \r\n00:21:20:06--------------------------------------------- \r\n \r\n----------------Page (12) Break----------------\r\nBut there were other people who told me that their \r\nfirst jobs they cleaned houses, and um, I was introduced \r\nthrough some of them to an art historian who was a \r\nhousekeeper.  I saw her years later at MOMA.  She was \r\nleading a group discussion on Art History...very interesting \r\nwoman. \r\n \r\nDe Mare: That’s wonderful.  \r\n \r\nHorne: Yeah. \r\n \r\nDe Mare: That’s wonderful that you ran into her later on. \r\n \r\nHorne: Yeah. And, uh, we were very active, all of us.  \r\nLunchtime, if there was a shop on strike, we’d go help them \r\npicket.  And, uh, it was a very interesting union to be in, \r\nbecause they, um, had thousands of members, and no one had \r\nthought of organizing them before.  So they had, um...they \r\nopened a night club on uh... They bought a building \r\neventually on Astor Place, and the night club was staffed \r\nby union members - the entertainment, the music, the \r\nsinging, the dancing, everything.  And that’s where I hung \r\nout for years, years later.  ‘Cause you could go Saturday \r\nnight, and there was no hard liquor or anything.  And, uh, \r\n----------------Page (13) Break----------------\r\nthere was a show called, uh, North Atlantic, that was a \r\nparody of South Pacific.  And, uh, it was just great.  We \r\nwere all young, and very politically aware.  \r\nNow I remember going to a big meeting at Madison \r\nSquare Garden, and they launched a program called Seven and \r\nSeven [InterNatural].  They were going to organize seven \r\nthousand workers in seven months.  And they did.  For all I \r\nknow, they’re still a union...I don’t know for sure, but... \r\n \r\nDe Mare: What year would that have been...what time frame is \r\nthat? \r\n \r\nHorne: Oh, I would say about ’41.  Something like \r\nthat...1941.  \r\n \r\n00:23:48:03------------------------------------------------ \r\n \r\nAnd then...um...December 7\r\nth\r\n happened.  I was engaged that day -  \r\nwe didn’t know about Pearl Harbor until the evening. And it \r\n... not that we didn’t have a big party or anything...I \r\ndidn’t get a ring...but that was the day I met my boyfriend’s \r\nfamily.  So we said “We’re engaged.”  And then we found out \r\nabout Pearl Harbor.  And we married three weeks later.  I \r\nwas 19.  That was not Bill Horn.  No comparison. \r\n----------------Page (14) Break----------------\r\n So, um, at that time...uh, I guess workers were harder \r\nto get, because the aircraft plants way out on the island \r\nwere building planes for a long time before we entered the \r\nwar.  They had contracts, and some people were getting very \r\nrich.  And it helped workers very much...out on the island.  \r\nAnd I remember there was an arsenal in New Jersey, \r\nPicatinny Arsenal.  People came up from the South because \r\nthey knew they could get work.  And, uh, so on my level, in \r\nNew York City, there were more factory jobs available.  And \r\nwomen always worked...uh, we took it for granted that we \r\nwould work, because no one had money, and young couples who \r\ngot married understood they would both work and try to save \r\nagainst the time when a child would be born.   \r\nSo...so it was through...I guess from Local 65, yeah, I \r\ngot a job at the All Craft Manufacturing Company on Hudson \r\nStreet.  I think it was Hudson and Leroy or something.  And \r\nwe made parachute suspenders and pistol belts for the \r\nmilitary.  And I...my job was on, um, I think it was a kick \r\npress.  We put the metal lining that comes around...um...where \r\nyou put your shoelaces in?  Well, the parachute suspenders \r\nhad those too...I forgot what you call them.  But that was my \r\njob.  And people were assembling and stuff like that.   \r\n \r\n00:26:52:17----------------------------------------------- \r\n----------------Page (15) Break----------------\r\n \r\nThe workers were very interesting to me.  It was \r\nalways very, uh, diverse population, ethnically.  And it \r\nmade it interesting.  The work was boring.  Factory work is \r\nalways boring.  It’s the most boring thing you can imagine.  \r\nSo you get to talk to people, and that...that what’s so \r\nimportant.   \r\nSo, I worked at All Craft and then...I don’t think I \r\nquit it...they could have had the end of a contract or \r\nsomething where they had too many workers...I heard about a \r\njob, probably through my union, in Long Island City, and \r\nthat was Gussack’s Machine Products.  Um, it was Local 1227 \r\nof the United Electrical Workers Union.  So, that...I spent \r\ntwo years there. And, uh, it was a big education.  I not \r\nonly became a machine operator, but I met some wonderful \r\npeople.  And the kind of people who came out to work in \r\nfactories were intellectuals as well as not completely \r\neducated people – all kinds of backgrounds.  Some young \r\npeople who were waiting to be conscripted, but didn’t \r\nvolunteer.  And, uh, I grew a lot.  I felt I grew \r\nintellectually, and socially, in that period.  Um, my \r\nhusband, my then husband, went into the service 6 months \r\nafter Pearl Harbor.  And many of the young women at \r\n----------------Page (16) Break----------------\r\nGussack’s were in the same position – their husbands were \r\nin some branch of the military.   \r\nSo when I first went in, I hated it.  First of all, I \r\nhad to travel.  I lived in Washington Heights, and uh, I \r\nthink fare was still not a dime...uh, not nickel.  Many have \r\ngone to a dime somewhere along the line.  And I had the \r\ntrip every day to Long Island City.  I took the A train \r\nfrom a Hundred and Seventy Fifth Street to Forty Second, \r\nand there I took the Astoria line – it was the BMT, as I \r\nrecall – to Forty Fifth Road and Court House Square.  It’s \r\nprobably some other line now, the F train or...or the G.  I \r\ndon’t know...I don’t know at all. \r\n \r\n00:29:59:11------------------------------------------------ \r\n \r\nBut um...the whole area...I don’t know what it’s like \r\nnow...was factories and uh, cold water houses.  Poor...poor.  \r\nBut um... the first apartment I was sent into was smelly and \r\ndirty, and the work was terrible.  I stood at a kick press.  \r\nA kick press is something you kick, and something comes \r\ndown.  You know it’s like the games we play now.  But \r\num...after a couple of months I went to the boss and said, \r\num, I want to be released.  ‘Cause you had to be released.  \r\nThe man power commission had control over the number of \r\n----------------Page (17) Break----------------\r\nworkers who could come and go or something...I don’t remember \r\nthe fine details.  But the boss said, “You’re doing \r\nsomething for the war effort.”  I said, “But surely I can \r\nfind something else to do,”  because it was terrible.  They \r\nsaid, “I’ll find another department for you.  Don’t go \r\naway.  You can’t anyway.”  I don’t know if that was true or \r\nnot, but I accepted it.   \r\nI was transferred out of that department into the \r\nmachine shop itself.  And, uh, that was a big change.  \r\nThere were machines here – you felt like you could do \r\nsomething.  Um...I don’t know if you’ve ever been to a \r\nmachine shop, but the uh, drill presses and the lathes and \r\nthe screw machines and the milling machines all had big \r\nbelts with the pulling on the ceiling...flapping...noise.  And, \r\nuh, you worked in a spray of turpentine or something.  You \r\ncleaned yourself with motor oil.  But you felt you were \r\ndoing it for the war, y’know.  So, it was interesting, \r\ncause I didn’t feel very competent in anything, having been \r\nthe baby in my family.  And, I..I kind of grew up feeling \r\nthat my hands didn’t work too well.  Oh I could...I could \r\nfind a drill press...I could solder.   \r\n00:32:47:02------------------------------------------------ \r\nUm, tricks were played on...on newcomers like me.  I’d \r\nbe sent to the tool room – do they call it the tool \r\n----------------Page (18) Break----------------\r\nroom...some name like that...it was like a big cage with all \r\nkinds of tools – to get a left handed hammer or ask for a \r\nbastard file, just to make me blush, y’know?  So, I grew \r\nwith it, but I couldn’t make friends with anybody somehow,  \r\nand I was always a friendly person.  I found out \r\nsubsequently that people found me very aloof.  But I...I met \r\nsome terrific people there from every walk of life, every \r\nlevel of education.  And the...the shop itself had been, uh... \r\nthe bosses were MIT profs who got together and managed to \r\nget some kind of cockamamie contract to form Gussack’s.  \r\nAnd uh...we never knew what we were working on.  It was \r\nalways part of something that was going to be sent \r\nsomewhere else to be.  And um...it was a very wonderful \r\natmosphere.  We were half deaf from the noise.  I was \r\nliving with my sister at the time.  I’d come home from \r\nwork, and she’d say “Number one, you stink.  Go take a \r\nshower.”  My...even your street clothes reeked...your work \r\nclothes certainly.   \r\nBut um...lunch hour, for the longest time, we would sit \r\naround...sit on crates with our...our long work aprons and \r\npants, or whatever.  And one of the bosses, Moe Kammer, \r\nwould read a scene from a film, and we would discuss it.  \r\nRemember the differences in education I saw all around me – \r\n----------------Page (19) Break----------------\r\npeople, some of whom had never finished eighth grade...it’s \r\njust...entranced.  It’s still moving. \r\nAnyway, we all went to see Othello.  And we saw Paul \r\nRobeson, and Uta Hagen, and Jose Ferrer as Iago...for a \r\nfactory!   \r\n00:35:52:21------------------------------------------------ \r\nAnyway, some of the kids were drafted.  Two of the \r\ngirls joined the wax.  I wanted to join the wax in the \r\nworst way, but my husband, who was in the service, wrote \r\nback “No wife of mine is going to be in that traveling \r\nwhore house!”  Now my friends were not whores.  One became \r\na photographer.  They trained her, and she was sent to \r\nIndia.  The other one stayed in the United States and was...I \r\nthink she was on a guard duty, or something, in Florida, of \r\nprisoners of war.  But I thought it was so romantic and \r\nimportant, because we were fighting Fascism.  However, we \r\nwere also fighting Fascism on the homefront.  \r\nSo, I became very active at Gussack’s and made a lot \r\nof friends.  And I was on the Labor Management Committee, \r\nwhich...y’know because we were all pulling in the same \r\ndirection, there were Labor Management Committees that \r\nhandled things like music...because every factory had music \r\nplaying; it was supposed to increase production.  And \r\n----------------Page (20) Break----------------\r\nuh...the union had a grievance committee anyway, side by \r\nside.   \r\nBut we would discuss things like the question of \r\nmusic, as I remember.  We had “Musack” – canned music, and \r\nnobody could stand it.  We found out that one of the young \r\nguy in shipping, in the shipping department, was a music \r\nbuff.  He had a very eclectic taste, so he was put in \r\ncharge of developing a music library.  And, uh, I think the \r\nguards at the door were in charge of putting the records on \r\nand taking ‘em off in different periods.  And I remember \r\nthat was my first exposure to uh...jazz, New Orleans jazz, \r\nbecause I was raised in a home where I wasn’t allowed to \r\nlisten to the make believe ballroom even, and that was pop \r\nmusic.  My mother said “That crap...!”  We listened to the \r\nopera every Saturday afternoon – that was good... and the \r\nJewish news hour, The Lone Ranger, Chandu the Magician... \r\nthings like that. But I couldn’t hear Janis, so... \r\n \r\n00:38:49:07----------------------------------------------- \r\n \r\nI learnt all about New Orleans jazz and stuff, and uh, \r\nI remember when I first heard the one o’clock jump or \r\nsomething, I must have broken a drill... “Play it on...!”  Jazz \r\nis all [up].  But we also heard Broadway musicals and \r\n----------------Page (21) Break----------------\r\nclassical music.  I was exposed to The Rosen Cavalier for \r\nthe first time.  I know I never heard it any other place – \r\nit was new to me.  Richard Strauss was new to me.  And, \r\num...so that was very educational.   \r\nAnd at one point, I um...a member of the management and \r\nI were sent to Washington, DC for a conference on morale in \r\nthe workplace and the war place or whatever.  And uh...I \r\nthink I have a picture of the man I went with.  And that \r\nwas fascinating, because we went in a parlor car, and I had \r\nnever heard of a parlor car before or since.  But there \r\nwere individual swivel seats in the car – not the bench \r\nkind of arrangement – and you could eat there, or drink or \r\nwhatever.  And I talked to some of the, uh, people from \r\nother parts of...factories and so on.  And I remember having \r\na long conversation with an architect. And I still remember \r\nhim making me aware of the fact that in a place like uh... \r\nthe Upper East Side in New York, or the Upper West Side, \r\nwhen buildings were put up, and floors...floor plans were \r\nmade for apartments, the maid’s quarters were always very \r\nsmall and usually attached to a kitchen.  The other rooms \r\nwere huge, or...beh beh beh... I said “Wow!” Because the \r\ntenements weren’t like that – the kitchen was the main \r\nroom, y’know? \r\n \r\n----------------Page (22) Break----------------\r\n00:41:19:14------------------------------------------------ \r\nBut uh...I was learning a lot in a lot of different \r\nways.  And through this period, I also felt inferior to my \r\nbrother and sister because I hadn’t gone to college.  I \r\ncouldn’t figure out how to get there, because I had gotten \r\ninvolved with my union activities.  And uh, that was the \r\nstory for about ten years after high school.  But then I \r\nsaid “Enough”.  I did it at night.  My brother and sister \r\ndid too, so...whatever.  But, uh...as far as Gussack’s was \r\nconcerned, it was a major education.   \r\nHowever, after two years, I was boiling.  I had \r\nstarted working at forty cents an hour.  After two years, I \r\nmade it up to forty five cents and hour, and I was working \r\nside by side with men who were getting seventy five or \r\neighty five cents an hour.  So I went to the shop steward \r\nfirst, and I said “We have to do something about equalizing \r\nthe pay.  It is not fair.”  And he said, “This is not an \r\nissue now.  The war is on.”  I went to the boss, which I \r\ndidn’t plan on doing, and I said “This can’t be.  I know I \r\ncan get a job tomorrow starting at seventy five cents an \r\nhour.”  So he said, “I won’t stop you.”   \r\nSo the next day I was at the Electronic Corporation of \r\nAmerica in Manhattan, and they had a different kind of \r\ncontract.  It was called Cost Plus.  So they had wonderful \r\n----------------Page (23) Break----------------\r\nconditions for the workers.  We had a break where we could \r\nhave tea or coffee or milk that was served – we didn’t have \r\nto buy it.  And the place was light and clean, and I \r\nlearned how to be a radio wireman.  We wired sets for \r\nradios that we used in the tropics in the South Pacific... \r\n \r\n00:44:02:21------------------------------------------------ \r\n \r\n...and we worked many many hours.  Sometimes, we had to make \r\na convoy that going...so there was one period where I worked \r\n21 days without a day off, and I felt like a zombie, \r\nbecause all you could do was go to sleep, eat, go to work.  \r\nAnd we worked overtime, and you got time and a half for \r\novertime and double time for Saturday and Sunday.  It was \r\nreally something, and then... \r\n \r\nDe Mare: When you worked for there, how much did you get \r\npaid, because you left the other...? \r\n \r\nHorne:  We started at seventy five cents an hour.  And \r\nuh...it was just another world.  Then - I don’t know if it’s \r\nbecause the war ended...it ended in August...VJ day was August \r\nof 1945...it must have been that it was the end of the war -  \r\nthe contract ran out.  I got a job at the Electronic \r\n----------------Page (24) Break----------------\r\nDevices Corporation on 26\r\nth\r\n St and 12\r\nth\r\n Avenue.  And uh...at \r\nprobably...still at 75 cents...I don’t know, I can’t remember \r\nthat.  And I stayed there until I left the country.  Went \r\nto work somewhere else. \r\n \r\nDe Mare: Well...And why did you leave the country? \r\n \r\nHorne:  I was...I wanted to travel.  And I grew up hearing \r\nall the wonderful places my family had been to that I \r\nhadn’t.  I felt cheated.  And I met someone who told me you \r\ncan get work overseas, and that’s what I did. \r\n \r\n00:46:10:07------------------------------------------------ \r\n \r\n00:46:10:19------------------------------------------------ \r\n \r\nDe Mare: ...what your experience was actually working side by \r\nside with a man? ...if there was a sense of segregation, or \r\ndiscrimination, or where you...how you felt about that, if \r\nyou can remember?  It doesn’t have...you don’t have to hit \r\nevery single one, but is there...is there an event that you \r\nremember? Um...or was it just the money? \r\n \r\n----------------Page (25) Break----------------\r\nHorne:  It was just the money, because the...uh...atmosphere \r\nwas pretty cooperative, as I recall.  We were all there for \r\nthe same reason, and um...I don’t know... \r\n \r\nDe Mare:  That’s fine. \r\n \r\nHorne:  The uh, the hierarchy...there was a hierarchy.  The \r\ntool and dime makers were at the top.  Um...they, they may \r\nhave been able to design blueprints for us to follow.  I \r\nwas in the middle group that could follow a blueprint and \r\nchange bits on a machine or what not.  And um...then there \r\nwere people who just did the assembly work, y’know.  But \r\nlike I mentioned, we never knew what we were working on, so \r\nit was intriguing.   \r\n \r\nDe Mare: Yeah. \r\n \r\nHorne: But we knew when you...we were on the drill press, you \r\nwere drilling holes into some metal thing...maybe aluminum, \r\nmaybe brass.  And sometimes you had to ream it ... so you \r\nchange the bit...different thing.  And then some you had to \r\nput threads in, so...because screws were going in.  And some, \r\nyou were depressing um...a dye that would dig a serial number \r\ninto ... whatever.  The only time I got hurt was on that.  I \r\n----------------Page (26) Break----------------\r\nwas working and someone called my name insistently, so I \r\nturned around to see ...(hand motion chopping at her other \r\nhand)... and it was the only time in two years in that shop \r\nthat I got hurt.  Um...mostly I was used to take over when \r\nsomeone else got hurt.  I’d be put on the machine.  I think \r\nI, I was very careful.  I wasn’t really fast...I wasn’t the \r\ngreatest production person, but I was a safe one, and uh... \r\n \r\n00:48:53:04---------------------------------------------- \r\n \r\nWe had incentives.  Uh...if you had an idea for \r\nimproving some movement or placement, or whatever, you \r\ncould win a savings bond.  And I, I did have a couple \r\nideas, so I got a...we used to get a war bond for 18.75, and \r\nin 10 years it would be worth 25 dollars.  And it was \r\nreally good.  As a matter of fact, they had uh... a deduction \r\nplan so that you could save toward them on your own \r\nanyway...which we all did.  I think for 37.50, you got a bond \r\nthat, at maturity, was 50 dollars.  So they were good \r\nincentives. \r\n \r\nDe Mare: Now were you...your husband was overseas.  Can you \r\ntalk a little about your home life while you were working \r\n----------------Page (27) Break----------------\r\nin the factory?  Or did...you said you were living with your \r\nsister. \r\n \r\nHorne: Yeah. \r\n \r\nDe Mare: Um... \r\n \r\nHorne:  And her...my sister had two children at the time.  \r\nUh, her husband was in the service too.  And um...I was happy \r\nliving with her.  Actually I was living with her, because \r\nof a crazy thing in my family...I wanted to leave home when I \r\nwas eighteen.  My mother was very very difficult to be \r\nwith, and I had...I was alone with her from age twelve.  My \r\nbrother and sister married and left the same year, and I \r\nfelt totally abandoned because of uh...I don’t know if it was \r\njust generally attitudes towards children in those days, or \r\nit was just my family, but when my father died, nobody took \r\ninto account my feelings.  As a matter of fact, because he \r\ndied in his sleep, everybody was in shock.  But I was \r\ncompletely destroyed, because my...my daddy told me a story \r\nevery night. Every night.  And when he was tired, and he \r\nwould try to say “Once upon a time, there was a little girl \r\nnamed Esther,”  I would howl.  “No! I want a real story, \r\nDaddy!” So I think he read both Bulfinch’s mythology and \r\n----------------Page (28) Break----------------\r\ntold me a myth every night, ‘cause in later years at school \r\nI came across these stories I seemed to know...I didn’t know \r\nhow come.  My brother told me how come.   \r\n \r\n00:51:55:21------------------------------------------------ \r\n \r\nBut um...the...this last night of his life he came home, \r\nand he said, “I want you to sleep with Leah tonight.  I \r\ncan’t tell you a story.  I don’t feel well.”  I said, “But \r\nDaddy...”  That was it.  During the night, he died.  So I \r\nwoke up to hysteria all around me, and um...you know in a \r\nJewish family, the burial takes place before sundown.  So \r\nthis is...he, he died probably at dawn.  And I remember \r\ncrawling all over him trying to force his eyes open, and \r\nwatching his lips turn blue.  I mean, he was still warm \r\nwhen I was there.  And uh...our neighbor came and whisked me \r\naway.  I never saw the interment.  So for years I had \r\nfantasies about hearing a knock at the door, and I would \r\nyell at him “Why did you leave us?!”  But the knock never \r\ncame.   \r\nAnd uh...everybody was grief stricken.  He was a very \r\nwell-loved person, and uh...it was a tremendous funeral.  \r\nThere were hundreds of people in the house.  I mean, it \r\nspread like wildfire, because it was just before his 47\r\nth\r\n \r\n----------------Page (29) Break----------------\r\nbirthday.  He was 46.  And uh... he worked til the last \r\nminute.  But uh... my only support and solace were my sister \r\nand brother, but they were kids.  I mean, I was 6; they \r\nwere 16 and 18.  So... \r\n \r\nDe Mare:  you were ... they were already on their way out \r\nthe...yeah...  So when...so you went to live with your sister, \r\nbecause you were both in the same kind of situation?  Now, \r\nwas she working as well during the war?  She had kids... \r\n \r\nHorne:  She had kids, but they were little.  But uh...no, I \r\nwanted to leave home.  I was living alone with my mother.  \r\nAnd my brother-in-law, who I had known most of my life, \r\n‘cause Lea and Ali met when they were about 12 on the block \r\nin Harlem, um...said “It’s not right.  Esther will be alone.  \r\nYour mother will be alone.  No.  Let’s get a large \r\napartment, and we’ll all live together.”  My sister knew \r\nbetter, but she couldn’t stand up to him.  So, my mother \r\ngave up her home. \r\n \r\n00:55:01:07------------------------------------------------ \r\n \r\nAnd we all moved together, but inside a couple of months, \r\nit did not work.  My brother-in-law drover her...no, she \r\n----------------Page (30) Break----------------\r\ndrove him crazy, and the kids, and everybody else.  I was \r\nin heaven – the load was off my back.   \r\nTo answer your question, I was living with my sister, \r\nand um...she...she wasn’t working at the time.  No, the kids \r\nwere too little.  But uh...she didn’t...she was a \r\nchiropractor...she didn’t get to have her own practice until \r\nher kids were grown.  She worked in between – she had all \r\nkinds of jobs too.  But um...not at that time.  We had an \r\nallowance from the government as wives.  And between that, \r\nand my contribution, we managed.  We managed quite well.  \r\nBut... \r\n \r\nDe Mare:  Do you remember what the allowance was from the \r\ngovernment, for being a...?  And there was...because you \r\nwere...you were the wife of a...of a serviceman. \r\n \r\nHorne:  Yuh.  Um...I know there was a song Twenty One Dollars \r\na Month Once a Year, or something, but it was more than \r\ntwenty one dollars, I’m sure.  However, uh...when I broke up \r\nwith my husband, I gave him the total bank account.  I had \r\nnever touched a penny of that allowance, because he got me \r\nvery angry about it.  Um...he used to ask me for an account \r\nin every other letter, and I felt it wasn’t mine.  So, I \r\n----------------Page (31) Break----------------\r\nthink if I remember correctly, the total after three and a \r\nhalf years was twenty two hundred dollars. \r\n \r\n[Other Voice – Kirsten Kelly]:  You never...you never used \r\nit.  That’s an incredible story. \r\n \r\nHorne: Yeah...because everyone made fun of me for handing him \r\nthe money.  But I wanted no part of him or the money.  I \r\nhaven’t changed in that regard.  I would do it again today. \r\n \r\nDe Mare:  You said something really interesting...um...when you \r\nwere talking about, y’know, feeling as if you were part of \r\nthe effort...that you were...and you said you were fighting \r\nfascism overseas, but we were also fighting fascism at \r\nhome.  Can you talk a little bit about what you mean by \r\nthat?  You said that when you were talking about being in \r\nthe labor union. \r\n \r\n00:58:01:12------------------------------------------------ \r\n \r\nHorne: Well...while most of the country was pulling together \r\nin the war effort – it was the most together we’ve ever \r\nbeen, in my memory – there were dissident elements.  There \r\nwas the...the ________Verein in um... Yorkville, neo-nazis.  It \r\n----------------Page (32) Break----------------\r\nwas a “sports club”, but um... There was Father Coughlin \r\ncoming out of Little Rock...I think it was Little Rock, \r\nArkansas.  He used to have a weekly program spewing hate.  \r\nStuff like that I was very aware of.  And uh...all kinds of \r\nthings were going on in the United States.  And a lot of \r\nstuff happened after the war as well.  And um...there’s \r\nalways been that element, and uh...anti-semitism, anti-\r\nforeigner, anti-black, y’know?  But uh...you knew you \r\ncouldn’t fight alone.  I mean, you handle situations that \r\nhappen to come up, but uh... Something I learned from an \r\nuncle of mine, my mother’s brother who lived to a \r\nhundred...we all adored him...and he told me how he kept his \r\nequanimity when my mother cracked under all the horrible \r\nthings they had lived through in Europe, and their other \r\nsister and brother too had a...anyway, this guy was always \r\ncalm.  And he was fun - he was fun to be with.  And he told \r\nme when I was quite young “I always decided if there was a \r\nproblem in my life, I had to make a decision what...  First \r\nI would think about it: is it my personal problem or is it \r\na social problem, a group problem?  If it’s a group \r\nproblem, I’m not going to agitate.  I’ll do what I can.  If \r\nit’s my own problem, that’s different.”  And I said “Hmmm.  \r\nVery interesting,”  \r\n \r\n----------------Page (33) Break----------------\r\n01:01:01:07------------------------------------------------ \r\n \r\n‘cause my mother, who had a very strong sense of social \r\njustice, didn’t differentiate, y’know?  It was all mixed \r\nup.  And uh...I came across a character like her in Dickens.  \r\nI’m not sure if it was Bleak House or one of ...one of...other \r\nnovel.  There was a woman in it, Mrs. Jelly Belly, who had \r\na whole brood of kids, who were totally neglected, and a \r\nhusband who sat in the corner looking stunned.  But she was \r\na fighter for the people of Africa, the people who lived \r\nalong the river Belanga Manga, or something, and she was \r\nout there fighting all the time, and her family was \r\nso...terrible. \r\n My mother was very interested in social issues, but \r\nshe did give me a good appreciation of different kinds of \r\npeople.  She was very open to meeting people from different \r\ncultures, and even though she was an observant Jew, she \r\nsent me to Presbyterian Sunday School for quite a while.  \r\nThere was...uh...the church was very near us...um...near Mount \r\nMorris Park.  Um...she was friends with the minister and his \r\nwife.  So I went to Sunday School knowing I was a Jewish \r\nkid – I mean, I never had a doubt.  But at the same time, \r\nshe would make me give my toys away that Daddy had given me \r\nto a nursery school that was on the block.  And uh...I had to \r\n----------------Page (34) Break----------------\r\ngo to the school with her to make the donation, and I saw \r\nall these kids, and it looked like they were having a \r\nwonderful time.  And she said, “You see that?  There \r\nmothers go to work, and they have to be there.”  And I \r\nthought, “I wish I were.  I wish I were there.”  I didn’t \r\nwant to give ‘em my toys, but y’know.  They were to be \r\npittied, because their mothers worked.  Anyway... \r\n \r\nDe Mare:  Now when you...you said when you started working, \r\nyou didn’t feel like you could do anything.  You didn’t \r\nfeel like very capable, and through working you got to fe-\r\n...can you talk a little more about that in your life...how y-\r\n...how the experience of working...if it gave you confidence \r\nand if it gave you...what you went on to do?  Can you talk a \r\nlittle bit about ... about that? \r\n \r\n01:04:06:02------------------------------------------------ \r\n \r\nHorne: Well, it...it gave me, um...it gave me an appreciation \r\nof...of the fact that I have something to offer.  And uh...the \r\nguy I married kind of indicated that he was hot stuff, and \r\nuh...I wasn’t sure about that.  And his sisters used to say \r\nlovely things too – I thought they were kidding, so I let \r\nthem pass.  But when my friends heard how they came on, \r\n----------------Page (35) Break----------------\r\nthere were fights, “We always thought he would marry a \r\nbeautiful girl, or a rich girl, and he married you.”  \r\nY’know?  They meant it.  So I didn’t feel particularly \r\nattractive, and uh...the reason I got married is related very \r\nmuch to the war.  Everything got speeded up, meaning you \r\nknew somebody, and maybe he got killed, something terrible \r\nwould happen, and uh...  We were not promiscuous – I didn’t \r\nsleep around or anything.  And no one ever told me this, \r\nbut somehow I understood, you didn’t have sex until you got \r\nmarried, and you didn’t get married unless you were in \r\nlove.  But in high school, two of my best friends once \r\nadmitted that they weren’t virgins, and I thought my head \r\nwould split, because I respected them – they were nice kids \r\nfrom good homes, they weren’t bad girls.  So I said, “Wow.  \r\nIs this possible?”  But I didn’t have sex.  Near.  You \r\nknow, I was with a group of 9 girls from the East Bronx – \r\nwe had our own taboos.  But um...this guy was the first \r\naffair that I ever had.  He was eight years my senior.  I \r\nwas eighteen. And um...my reaction...”What’s all the fuss \r\nabout?” y’know?  I was very sophisticated – didn’t know \r\nanything, but I was very sophisticated.  And um... \r\n \r\n01:06:53:23------------------------------------------------ \r\n \r\n----------------Page (36) Break----------------\r\nLike I said, because of the tensions of the war in Europe, \r\neven before we were in it, everything was speeded up, and \r\nwe were at an age where people start getting married \r\nanyway.  He was 27, I was 19.  And uh...maybe...I have often \r\nthought about this...maybe on a subconscious level, not on \r\nsub, I had to justify my going to bed with him.  That’s why \r\nwe got married.  And I was very emotional about his going, \r\nand stuff like that... but ...alienated pretty soon...pretty \r\nsoon.  ‘Cause, uh, I think he was in the army six weeks \r\nwhen, uh, he invited me to Fort Dix to visit.  And I came \r\nout with a group of other young women – it was in New \r\nJersey – and um, he told me that a group of the guys went \r\ninto the town one night, and he ended up in bed with a \r\nwoman, and he couldn’t do anything ‘cause it wasn’t me.  I \r\n... I was furious.  I said “Would you like a medal?” why, \r\ny’know?  He should not have told me that...and what was my \r\nfeeling?  And then, the business with the accounting...  And \r\nI personally was getting stronger and more appreciative of \r\nmyself as a total individual...that I had a brain - even \r\nthough I didn’t go to college I had many interests.  And \r\nuh...I was very bothered.  And then it was a mess when he \r\ncame home.  I didn’t want to live with him; I had met \r\nsomebody else.  But the reason I met somebody else was that \r\nthis...this was...  But there was such...there was so much, um, \r\n----------------Page (37) Break----------------\r\npropaganda about worrying about the guys overseas: don’t \r\nsend Dear John letters...y’know it’s a terrible thing...you \r\nhurt the guys morale and his feelings, he’s trapped, \r\nthere’s nothing he can do, blah blah blah.  So I never told \r\nhim.  This happened...I met this other guy...I think I was 21 \r\nor 22, and uh...that was another mistake.  That was not Bill \r\nHorne either.  But um... \r\n \r\n01:10:00:00------------------------------------------------ \r\n \r\nHe was furious with me – the first guy.  He said, “If I had \r\nknown that you didn’t want to live with me, I would have \r\nstayed overseas, because I had someone in Australia.”  I \r\nsaid, “That’s nice.”  I thought he was just saying that to \r\nmake himself feel better, or whatever.  He was not in \r\ncombat duty.  He was on the ground crew of the air force, \r\nstationed in New Guinea, and...with frequent furloughs to \r\nAustralia.  And he had met a woman, and he lived with her \r\nfor about...I don’t know how many years.  I just...no \r\nindication to me.   \r\nUh...I got a letter once where he was going on and on \r\nabout Christmas and ... he imagines what it was like, \r\n“remembering last year – the annoyance and the irritation \r\nof trying to choose”.  And I said, “What is he talking \r\n----------------Page (38) Break----------------\r\nabout?  We’re both Jews.  When did we go shopping for \r\nChristmas?”  And then a letter came from this young woman.  \r\nHe told me her name, and a letter came from her.  So I knew \r\nshe existed.  I forwarded it to him.  Of course, he \r\nblackened my name amongst all our friends, or tried to and \r\nthey all backed away from him.  He never told them about \r\nthis other woman, and I didn’t either.  So, he...he’s 95 now.  \r\nI have not seen him for many many many years.  He doesn’t \r\nlive in New York.  And uh...it was part of my growing up, to \r\ngo through that.   \r\nBut when I see how kids act today, I know they’re \r\nright, that I...in my day, you didn’t just live with someone, \r\nunless you were a very revolutionary type of person, which \r\nI wasn’t.  And uh...so you have your affairs, you make your \r\nmistakes, and you grow.  I did it legally, and I was scared \r\nto death of getting married ever again after the second \r\none.  I mean, I got married when I was 19 and when I was \r\n23.  But many years later, I met Bill Horne, and I was 37 \r\nwhen we got married.  Different ball game.  Totally \r\ndifferent.  But on social relationships, I’ve changed so \r\nmuch. \r\n \r\n01:13:05:11------------------------------------------------ \r\n \r\n----------------Page (39) Break----------------\r\nBut I love hearing the branches in Roots and Branches, when \r\nthey...sometimes...not when we’re having an official workshop, \r\nbut y’know, you hear about their exploits and their \r\nconcerns with the opposite sex, and all that.  I love it.  \r\nI absolutely love it. \r\n \r\nDe Mare: Awesome. Um...can we take a little break?  I’ve got \r\na ... what I think we’ll do is I’ll put the... \r\n \r\nHorne:  I feel like I’m talking about someone else.  You \r\nknow it’s so long ago. \r\n \r\nDe Mare: Whenever you want to start.  You on, Kirsten? \r\n \r\nKelly: Yeah. \r\n \r\nHorne:  Okay, you have to tell me.  I can’t really see you. \r\n \r\nKelly:  Action. \r\n \r\nHorne: This picture was taken outside Gussack’s Machine \r\nProducts in Long Island City where I worked.  Um...these are \r\nmy work clothes. \r\n \r\n----------------Page (40) Break----------------\r\n[Break in taped interview] \r\n01:14:19:07------------------------------------------------ \r\n \r\nHorne: I met him in a drama workshop.  I was in a theater \r\ngroup.  The second one was fascinating too – crazy, but \r\nfascinating.  But Bill was the best.  He was my husband. \r\n \r\nHorne:  This picture was taken outside Gussack’s Machine \r\nProducts in Long Island City.  And I’m dressed in my work \r\nclothes, um, without the long, uh, machine shop apron.  \r\nUm...this picture, I was somewhere between 19 and 21 in all \r\nthe pictures.  This was taken by one of the...uh...Gussack’s \r\ncoworkers.  His name was...uh...Paul...no, not Paul, excuse me.  \r\nJoe.  It’s a long Polish name I don’t remember.  He was a \r\nlittle guy, badly hunchbacked, and he was a photographer.  \r\nHe was stunning, and he asked me to model for him.  I was \r\nsurprised that he wanted to take my picture.  Looking back, \r\nI see I was cute.  But at the time, I didn’t...have no notion \r\nof it.  I ... I saw everything that was wrong with every \r\nfeature.  Oh well...  And these were my high heeled shoes I \r\nnever had again.  I wasn’t able to walk, even then.  And \r\nthis is a picture of my husband at the time.  We were \r\nmarried December 31\r\nst\r\n, 1941.  I was 19, and he 27. \r\n \r\n----------------Page (41) Break----------------\r\n01:16:59:04------------------------------------------------ \r\n \r\nAnd this is his kid brother Leon.  And this picture is me \r\nwith his sister.  We were wearing...I think we were wearing \r\npistol belts...could have been wearing parachute \r\nsuspenders...I’m not sure.  But it was part of...um...a parade \r\ncelebrating, uh, the war effort.  Everybody for the war, or \r\nsome...some name like that.  Very inspiring.  Not cynical, \r\ninspiring. \r\n And this is my sister’s husband.  He was the father of \r\ntwo kids when he went into the service.  And this is a \r\nfriend from Gussack’s who went into the Wax, and he was \r\nassigned down South.  And these three French sailors were \r\ninteresting.  The USO used to post, uh, different things \r\nthat were going on around New York City to which servicemen \r\nwere invited for free.  And they came to a union dance that \r\nwe were at, because they were nice kids.  They came from \r\nBrittany, the three of them, from fishermen’s families.  \r\nAnd the fishermen had a very strong union, they said.  So \r\nthey felt at home with union people, even though they \r\ndidn’t know a word of English.  And we all used our high \r\nschool French to the best of our abilities.  My sister made \r\na dinner for them.  And they had a good time and so did we.  \r\n----------------Page (42) Break----------------\r\nWe all had sore jaws from trying to speak.  I don’t \r\nremember their names, but they were very cute. \r\n Oh boy.  This one came off.  These are shots that were \r\ntaken, um, not where we worked, but in the office.  This is \r\nthe, um, several members of the, uh, administration, and \r\nthe shop steward.  And this was the labor management \r\ncommittee.  And this fellow and I were members of the \r\ncommittee. \r\n Let’s see...oh, this man and I, who...I don’t remember his \r\nname anymore...went to Washington together, to the Labor \r\nManagement conference, the National Conference.  And, this \r\nis the shop steward with the two members of the committee.  \r\nOh, heck...I’ll fix this later.  \r\n  \r\n01:20:06:02------------------------------------------------ \r\n \r\nUm...this picture was taken at the union 1227 hall.  I \r\nthink it’s our grievance committee.  These are all workers \r\nfrom our machine shop.  And...this picture is of some of the, \r\nuh, young women who work side by side with me, or could \r\nhave been in another department as well.  This is the union \r\nhall.  Can you see the poster, behind the dancers? \r\n \r\nDe Mare: Can you read it to me? \r\n----------------Page (43) Break----------------\r\n \r\nHorne:  I can’t see it, I’m sorry. \r\n \r\nDe Mare:  It’s okay.  I’m going to try to get...I can’t quite \r\nget in there... It says “Every man, woman, and...something...is a \r\n...” I can’t get that one.  But this one says “Take care!  \r\nIdle hands work for Hitler.”  That’d be great if you could \r\nread that one.  Hold on just a second. \r\n \r\nHorne: This one says “Take care.  Idol hands work for \r\nHitler.”  And I remember another one said “Lose lips sink \r\nships.”  And “If you...if you drive alone, you drive with \r\nHitler.”  Because um, gasoline was rationed.  And these \r\nwere my buddies.  She’s the [Wack], she... Elaine Turr and \r\nMarie LaCapra.  Elaine is dead now, and I can’t find Marie.  \r\nI’d love to...I’d love to see her.  Um...this is the, um, \r\nHalloween party at the union.  These are all people from \r\nthe shop.  And here’s...here’s Joe, the photographer.  Let’s \r\nsee, uh...everybody here was from the shop.  I don’t remember \r\nthe young man’s name at all, but this, this was uh...Roz \r\nEmerine.  Her husband was in the service too.  I think she \r\nmay have worked at a shop nearby. \r\n \r\n01:23:00:02---------------------------------------------- \r\n----------------Page (44) Break----------------\r\nAnd then the rest of the pictures are just socializing with \r\npeople from the shop.  Um, I think first vacation I ever \r\nwent on was with friends from the shop, and we’d have \r\npicnics and what not.  And these were some of the people \r\nwho had listened to uh...scenes from Othello, and gone to see \r\nit.  It never, never would have occurred to them.  \r\n“Shakespeare?  What’s that?”  But proved to be wonderful.  \r\nI don’t know how interesting you’d find these, really.  \r\nThere just young people having fun in a country setting.   \r\nBut...it was such a fertile period.  I think 19 to 21 \r\nprobably is for everybody.  You’re leaving your...you’re \r\nreally leaving your childhood, whether you’re in college or \r\nat work.  Don’t you think?  And, um, every day is kind of \r\nexciting for what you can learn.  When I went to college, I \r\nwas really ready for it, much more so than I would have \r\nbeen at 17. \r\n Oh, this was my friend’s husband.  We kind of grew up \r\ntogether on the East Side.  He was in D Day, and um...he \r\nwrote a poem about his feelings on the beach at Normandy.  \r\nIt was very moving, I remember, and uh...at the time.  I \r\ndon’t know what’s happened to him.  His name is Louis \r\nMiranda.  Um...he was a high school graduate.  He may have \r\ngone on to college under the GI Bill...I don’t know.   \r\n \r\n----------------Page (45) Break----------------\r\n01:25:54:11----------------------------------------------- \r\n \r\nBut that GI Bill was wonderful - it changed the lives of \r\nthe, uh, returning vets.  They were so lucky - much luckier \r\nthan the kids coming out of, uh, Iraq now, and Afghanistan. \r\nAlthough, I understand they’re doing...there’s some talk \r\nabout their having a ... something similar, an education for \r\nthe returning vets.  But... \r\n \r\nKelly: What was the GI Bill exactly? \r\n \r\nHorne:  You were covered...you were supported by the \r\ngovernment while you got an education, a higher education, \r\nand some very dear friends of mine, who were artists, went \r\nto France for the GI Bill.  And uh, a couple with a child... \r\nand uh, the husband was the artist.  He went to study with \r\nLeget, whose work is in the UN.  Y’know, they did things \r\nlike that.  And uh, people who could never have dreamed of \r\ngoing to college - they didn’t have the money, or they \r\ndidn’t live in New York City where they could get a free \r\neducation - doors opened for them.  They also had special \r\nhousing for veterans too – like Levitown,in Pennsylvania.  \r\nLevitown in Long Island.  Affordable housing for the \r\n----------------Page (46) Break----------------\r\nreturning vets, and their families.  It was really very \r\ngood. \r\n \r\nKelly: Esther, what happened when...one thing we didn’t touch \r\non was...when the war ended and the men came back, what was \r\nthe change...what was the change for women like...with the \r\ncircle around you? And for you? \r\n \r\nHorne: I left...that’s when I left.  I went overseas to work, \r\nso I’m not that tuned into it.  I was away for a couple of \r\nyears.  And um...it seems to me that, um, a lot of jobs just \r\nclosed down completely - plants that were ad hoc, so to \r\nspeak, for the war.  So nobody had those jobs, and if some \r\nof the returning vets went to school, it may not have \r\naffected too many office workers.  I’m don’t know what the \r\nsituation was in factories, but I don’t remember that was \r\nany kind of depression, remember hearing anything like that \r\nafter the war.  I think things were pretty good for a long \r\ntime.   \r\n \r\n01:28:59:04----------------------------------------------- \r\n \r\nMaybe that a lot of women wanted to stay home at that \r\npoint. Or...there were some husbands who did not want their \r\n----------------Page (47) Break----------------\r\nwives to work, because it made them less male.  That was a \r\nbig thing with a certain level of society.  Not the upper \r\nclasses, but really the poorest of the poor might have \r\nattitudes like that.  They also didn’t want their kids to \r\nleave home to live on their own...it was not nice.  Nice \r\ngirls and boys stayed home with their parents til they got \r\nmarried...after the war too.   \r\n \r\nKelly:  When you came back, were there differences that \r\nsurprised you in terms of the role of women, and ...? \r\n \r\nHorne:  Well, I went right to work when I came back.  Um, I \r\nwork in a stock brokerage, and I stayed there about 4 \r\nyears.  So, I, I preferred to go to a one, one gal \r\nsituation - I didn’t like office politics.  So I was \r\nunconscious, I think, of what was happening generally.  I \r\ncouldn’t speak.  But I started college on the post war \r\nperiod.  I guess it was about...I started college 1949 or 50, \r\nand um, at that point, I was an executive secretary.  In \r\nbetween, I had picked up skills.  I studied speed writing \r\nand uh, that qualified me as a secretary.  But then, I, I \r\nwent higher up, and um, nothing bored me more.  I mean, at \r\nleast in the factory you could talk to people...about things \r\nthat mattered, y’know?  But um, I was very fortunate.  I \r\n----------------Page (48) Break----------------\r\nworked for an outfit that was walking distance to Hunter \r\nCollege, which I attended for the next 9 years.  It took me \r\n9 years, because I had no reason to rush, and I had many \r\ninterests...looking back.  I didn’t realize it at the time, \r\nbut I was very active socially, and I was painting at the \r\ntime...I indulged everything that I loved to do.  Um, I can’t \r\nspeak to the question of...y’know, I can’t even generalize. \r\n \r\n01:32:19:09------------------------------------------------ \r\n \r\nKirsten:  Right.  No, that’s fine.  I was just wondering \r\nif, y’know what...what your experience was, which is exactly \r\nwhat you told me. \r\n \r\nHorne:  Seems to me none of my friends were...was complaining \r\nabout not having work...didn’t hear that at all.  But that’s \r\njust a microcosm, you know.  But, uh, and also we went into \r\nthe McCarthy period, and union activity plummeted.  White \r\ncollar workers were not organized, or if they were, they \r\ndidn’t get too far because of the attitudes of the workers \r\nthemselves.  You know, the union if for factory people, and \r\nI know in...as a...when I became a teacher, and the union was \r\norganized, a lot of teachers said “I’m not going to be in a \r\ntrade union. I’m a professional.”  Okay.   \r\n----------------Page (49) Break----------------\r\nBut, Bill Horne and I became friends, because he was \r\nvery active in organizing teachers.  I, I  was always \r\nattracted to him as a colleague, but I remember him coming \r\naround with a petition, and I said “What am I ... what are \r\nyou asking me to sign?  Y’know, I don’t sign very easily \r\nwith this McCarthy business.”  We were...there were still \r\nremnants of it around that late.  But...Bill went to school \r\nunder the GI Bill, but down south.  He went to LSU, \r\nLouisiana State University, and he had been in the navy \r\nabout 5 years, from age 18 to 23.  So... \r\n \r\nKelly:  You think of...just when people, y’know, sign up that \r\nyoung.  And even the people who are signing up now, just \r\nhow much at that point in their lives, when their 18, \r\ny’know, how much it affects your whole life. \r\n \r\nHorne: Yeah.  It was really does affect your whole life.   \r\n \r\n01:35:00:19------------------------------------------------ \r\n \r\nI mean, uh, Bill was in the South Pacific, and, um, it \r\ntroubles him to the end of his life...nightmares...the horrors \r\nhe had seen.  And he was a radio man on a destroyer, I \r\nthink.  But, uh, somewhere I have a documentary where he \r\n----------------Page (50) Break----------------\r\nwas interviewed on his war experiences down south.  It’s \r\nright in there somewhere.  But, uh, I don’t think anyone I \r\nknew was unaffected.  But, uh, for the post years, I don’t \r\nknow.  I think a lot of domestic industry started up \r\nagain...luxury stuff, fabric stuff, textile stuff.  And uh, \r\nNew York City, which I understood was more of a trade city \r\nthan an industrial city, still had a big garment center \r\ndown here, furriers...furrier center, the floral center.  \r\nThey were wholesale, and they employed a lot of people.  So \r\nmaybe that’s...I don’t think there was a depression after, I \r\nthink there was a boom.  And a lot of babies were born \r\nthen.  Now I think there’s a bigger boom.  I don’t know \r\nwhat they’re going to do about the school situation with \r\nall the, uh, wartime babies that are being born now...huge, \r\nhuge.  But, I think the 50s, aside from the political \r\narena, y’know, with McCarthy, was a fairly good period.  \r\nUh... Stuyvesant Town, y’know, in Manhattan?  Originally, the \r\nidea was to, uh, make affordable housing for returning \r\nvets, because my friend Blossom, whose picture is here, \r\nsigned up when her husband came back for a one bedroom \r\napartment.  I think it was going to be about 45 dollars, or \r\nsomething, a month.  And when it came to move in - \r\nMetropolitan Life Insurance owned Stuyvesant Town – they \r\n----------------Page (51) Break----------------\r\nraised the rent to 57 dollars, or something, and these kids \r\ncouldn’t afford it.  So they never moved in. \r\n \r\n01:38:07:14------------------------------------------------ \r\n \r\nAnd then there was a question of negro families.  I think \r\nthere was a little discrimination – there was noise about \r\nthat.  Met Life built similar housing to Stuyvesant Town, \r\nin East Harlem, on the banks of the Harlem River.  They \r\ncall it Riverview...?  I’m not sure. \r\n \r\nDe Mare:  That’s exactly what it is. \r\n \r\nHorne: Yeah.  I visited people there, and it looks just \r\nlike Stuyvesant Town.  But that was, that was in our growth \r\nof the post war period.  Um, I was living in the Heights, \r\nWashington Heights, and then I moved down to the Lower East \r\nSide.  I finally found something I could afford, because I \r\nwas still supporting my mother.  Her rent was higher than \r\nmine.  But I lived on Henry Street, between Rutgers and \r\nPike, at a cute little apartment.  Two rooms that were \r\nabout ten by ten each, for 42 dollars a month.  And, um, I \r\nwas working in Yorkville as an executive secretary.  And \r\nthen, I was there 6 years, and then I married Bill, and \r\n----------------Page (52) Break----------------\r\nBill had a darling apartment on 10\r\nth\r\n and Bleeker in the \r\nVillage.  And when I pass that area coming up from a \r\nworkshop downtown, I get a pang.  It was so wonderful \r\nliving in the Village.  I loved it.  But when we had Adam, \r\nour son, it was no place.  It was a walk-up, I think, 2 \r\nflights up.  But we had a duplex apartment.  It was 3 \r\nrooms.  The bedroom and the bath were upstairs.  And uh, I \r\ngo my apartment, house, on 77\r\nth\r\n St, and I feel nothing.  It \r\njust shows to go ya.   \r\n My name is Esther Horne.  Uh, I’m 87 years old, and \r\nduring the Second World War, I worked first at All Craft \r\nManufacturing Company on Hudson Street, um, making \r\nparachute suspenders and pistol belts.  And after that, I \r\nworked at Gussack’s Machine Products in Long Island City as \r\na machine shop operator.  Um, it was a very important and \r\ninteresting time in my life.  \r\n \r\nDe Mare: Great.  Thank you so much, Esther. \r\n \r\nEsther: Thank you. \r\n \r\n[End of Interview] \r\n----------------Page (53) Break----------------\r\n"}}]