[{"type":"add","id":"eva-chenevert","fields":{"identifier":"ROSIE_INTERVIEW_033","url":"/interviews/eva-chenevert","label":"Eva Chenevert","description":"During the war, Eva Chenevert worked as a riveter for Desoto Chrysler. ","image":"/images/ROSIE_INTERVIEW_033-interview-thumbnail.jpg","content":" 1 \r\nEva Chenevert \r\n \r\nThe Real Rosie the Riveter Project \r\nInterview 33 \r\n \r\n \r\n \r\nInterview Conducted by  \r\nAnne De Mare and Kirsten Kelly \r\nJuly 13, 2010 \r\nDetroit, MI \r\n \r\n \r\n \r\nFor The \r\nFor the Tamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n----------------Page (0) Break----------------\r\n 2 \r\nInterview: Eva Chenevert \r\nInterviewers: Anne De Mare and Kirsten Kelly \r\nDate: July 13, 2010 \r\nPlace: Detroit, MI \r\n \r\nChenevert: My name Eva Mase Chenevert and I was born in \r\nDetroit, Michigan, March the 5\r\nth\r\n, 1925. \r\n \r\nDe Mare: And can you tell me a little bit about your \r\nchildhood. \r\n \r\nChenevert: Well, I was one of nine children, three girls \r\nand five boys and I was number five in the family. And uh \r\nwe really enjoyed ourselves coming up as far as that goes \r\n‘cause you never really had to look for company you always \r\nhad company. So we seemed to enjoy one another and we got a \r\nlong quite well. I mean we had our squabbles as most \r\nchildren do but as a whole I mean we were a pretty fine \r\nfamily, I think. We had a wonderful mother and father. And \r\nuh they seemed to have taken very good care of us and we \r\ndid live during the time of the Depression, 1920-early \r\n‘30s. We seemed to survive that very well. I don’t think we \r\never went to bed hungry. I know we didn’t and uh— \r\n \r\n----------------Page (1) Break----------------\r\n 3 \r\nDe Mare: What did your father do for a living? \r\n \r\nChenevert:  My father was a DSR dr—what—motorman for the \r\nDetroit Railways. That’s when they had the streetcars and \r\nmy father so my father, in fact he had that job before he \r\nand my mother were married.   \r\n \r\nDe Mare: Did your mother work when you were growing up? \r\n \r\nChenevert: No, she did very little work.   \r\n \r\nDe Mare: Well she had a lot of kids— \r\n \r\nChenevert: She was there to take care of us and her mother \r\nand father lived in the same building and they were a lot \r\nhelp too helping rear the children. \r\n \r\nDe Mare: Where did you live when you grew up? \r\n \r\nChenevert: We lived on the east side of Detroit. \r\n \r\nDe Mare: What was the east side of Detroit like at that \r\ntime, can you describe it? \r\n \r\n----------------Page (2) Break----------------\r\n 4 \r\nChenevert: Well on the east side of Detroit at that time we \r\nhad a number of nationalities in that particular \r\nneighborhood because we were what they call now the Elmwood \r\nPark, the projects.  Not just he projects but the new \r\nhomes, the new sections they built over there. And uh we uh \r\nso I know there were quite a few Italians living around us. \r\nAnd we all seemed to get along quite well. \r\n \r\nDe Mare: Can you talk a bit about how you found the work \r\nyou did during the war and what you did during the war? \r\n \r\nChenevert: Well we knew there was a going on we all knew \r\nthat at that time. And I was in high school at the time and \r\nuh fourth grade and approaching it.  We found out through \r\ntalking and also through advertising that they were hiring \r\nwomen for war work. Well I finished high school in 1942 at \r\nage 17 and then the next year was when I went out to start \r\nreally looking for work in that field because they wouldn’t \r\nhire you unless you until you were 18. So I had gone to \r\nquite a few places but uh one day—well that wasn’t the \r\nfirst day I had gone to inaudible but that particular day \r\nwhen they hired me and my girlfriend who was with me. \r\n \r\nDe Mare: What were you hired to do?  \r\n----------------Page (3) Break----------------\r\n 5 \r\n04:17:22------------------------------------------------- \r\n \r\nChenevert: I was hired as a riveter. That’s what I started \r\noff with. The first part of the job they would give us—we \r\nhad to drill the well we really made the skins of the \r\nairplanes. And we called them the skins because they were \r\njust sheets of metal and then they were perforated with \r\nholes all around where you would insert the rivets but \r\nbefore you could insert the rivets, we had to drill the \r\nholes. And that that’s the start with well with me and all \r\nthe beginners drilling holes and they had those skins \r\nsitting on things that remind me of easels you that the \r\nartists uses. There were stands like that the skins were \r\non. And uh the drill at first—when I first lift it up, I \r\nsay that how will I do this it was so heavy so heavy at the \r\ntime but after a weeks eventually it wasn’t anything to \r\njust pick it up and work with it. So once all holes were \r\ndrilled we’d go up on a higher table and then it would take \r\ntwo of us. One of us was in the front and one of us was in \r\nthe rear. And when you insert the rivet, and uh one with \r\nthe gun, the rivet gun would shoot the rivet and the one in \r\nthe rear would hold it with like a metal block and if the \r\nrivet would be—would be put in correctly, they would make \r\njust one knock and that would mean that the rivet was put \r\n----------------Page (4) Break----------------\r\n 6 \r\nin fine. And if it were too flat, they would make, you had \r\nto hit, you had knock twice, which would mean to drill it \r\nout. You had to take the drill and drill it out. But then \r\nif it didn’t uh if it were ruined you’d knock three times \r\nand they had to discard some of the skins because you could \r\nruin them that way. \r\n \r\nDe Mare: So that’s how you’d communicate with the bucker \r\nbehind the—was by knocking?  \r\n \r\nChenevert: The way—by knocking. That was the way of \r\ncommunication. \r\n \r\nDe Mare: Wow, so you couldn’t actually see the person you \r\nwere working with? \r\n \r\nChenevert: You couldn’t see them...not unless you went \r\naround and looked that’s true. \r\n \r\nDe Mare: And did you work with the same person all the \r\ntime? \r\n \r\n----------------Page (5) Break----------------\r\n 7 \r\nChenevert: No, you didn’t. You—I worked with the same group \r\nall of the time. But once and a while there were different \r\npeople you’d work with. \r\n \r\nDe Mare: Now, did Chrysler train you to do all the work or \r\nwere you already trained to do the work at that point? \r\n \r\nChenevert: They trained us, after they hired us, of course. \r\nThey trained us and they gave us a short test and asked \r\nwith these questions asking about what I was just \r\nexplaining to you about the knocking and about the county \r\nand if you passed that and other things they considered you \r\nso I was hired. \r\n \r\n07:58:08------------------------------------------------- \r\n \r\nDe Mare: Do you remember—you working on airplane skins, but \r\ndo you remember what plane you were building? \r\n \r\nChenevert: No, I’m not sure. \r\n \r\nDe Mare: Okay. \r\n \r\n----------------Page (6) Break----------------\r\n 8 \r\nChenevert: I probably knew at the time. I can’t remember \r\nnow. \r\n \r\nDe Mare: Do you remember how much money you were paid to do \r\nthis work? \r\n \r\nChenevert: Let me see...I can’t remember the—but it ended \r\nup being $30 to $40 a pay and that was pretty high at that \r\ntime.  But that’s all I really remember about the wages, \r\nyou know. But I know I did start buying b—war bonds, you \r\nknow at the time.  \r\n \r\nDe Mare: And do you remember what else you did with that \r\nmoney as a young girl? \r\n \r\nChenevert: Well uh I did uh well like I said I saved that \r\nand I started—I was hired there in July of 1943. By then I \r\nwas married that same year in December 1943 and then the \r\nfollowing year in February...I meant to say too that my \r\nhusband was in service when I married him.  He went to \r\nservice, he went to service that summer and at the time \r\nwhen I was were he was he was in Boise, Idaho. So I took, I \r\nbought luggage for the trip to go where he was and other \r\nthings, which took care of a fare and I had money to spend.  \r\n----------------Page (7) Break----------------\r\n 9 \r\n \r\nDe Mare: Did you visit him or did you move out to live with \r\nthem when he was in Idaho? \r\n \r\nChenevert: I live—they would allow the soldiers at that \r\ntime where he was to come, if they had their spouse out \r\nthere, they could come wherever they were so he came home \r\nevery night.  \r\n \r\nDe Mare: And how long did you live in Idaho? \r\n \r\nChenevert: I stayed out there six month.  I got a leave of \r\nabsence from my job for two weeks and I told him I was \r\ncoming to visit for two weeks so when I went and when I was \r\nready to come home, he said, “Why would you leave me? I’m \r\nout here alone.” You know and carried on so I remained with \r\nhim.  Of course I’m glad we did. I’m glad I stayed there. \r\nWe really enjoyed it. It was more like a vacation really \r\nbecause it seems to me that out there they had the men \r\nwaiting to enter a school because later he had to radio \r\noperation school.  They sent them out there and I guess \r\nthey had to wait for the op-openings came. \r\n \r\n11:17:14------------------------------------------------ \r\n----------------Page (8) Break----------------\r\n 10 \r\n \r\nDe Mare: So you stayed out there with him for six months, \r\nand then what happened? \r\n \r\nChenevert: Well, I returned home. He—that was about the \r\ntime he went of furlough and his furlough...well anyway \r\nafter the furlough he had to return—he didn’t return to \r\nBoise. They had ordered him to go to New York. I guess it \r\nwas New York and from there they had radio school was \r\nBellville, Illinois. So that’s where he went to school in \r\nBellville, Illinois. \r\n \r\nDe Mare: And where were you at that point? Were you with \r\nhim? Or did you come back— \r\n \r\nChenevert: I I was at ho—when he received his furlough, we \r\ncame home together.  He accompanied me home and he stayed \r\nthere doing his twenty days I guess it was and after that \r\neh went along to... \r\n \r\nDe Mare: Did you go back to work at that point? \r\n \r\nChenevert: No I didn’t return to work. I had planned to \r\nreturn to school. I had enrolled and was going to Wayne \r\n----------------Page (9) Break----------------\r\n 11 \r\nState at the time. I decided, because I was working...yes \r\nby fall but I had done.  When I started working, I was \r\nworking days from six am to therein the afternoon but uh \r\nwhen I enrolled in school, I got on the afternoon shift. \r\n \r\nDe Mare: And where were you working when you went to \r\nschool? \r\n \r\nChenevert: I was working at, I was working at Desoto. \r\n \r\nDe Mare: Chrysler, ok. \r\n \r\nChenevert: Yea because I went to school in the mornings and \r\nstarted the afternoon-shift at three and was off at twelve. \r\n \r\nDe Mare: Ok. Now if you think back to being in the factory \r\nwhen you were doing the riveting work can you think of \r\nanything in particular that happened? \r\n \r\nChenevert: I really can’t think of anything that was \r\nsticking in my mind because because I can say most of my \r\nexperiences were favorable and I enjoyed work and um there \r\nweren’t any complaints. I was working with uh a very great \r\ngroup of girls—women. We had all women in our group. Now if \r\n----------------Page (10) Break----------------\r\n 12 \r\nyou needed men to help with some of this lifting of \r\nanything, and I was going to say I learned the names of \r\nquite a few of the tools. And it was interesting to me so \r\nuh... \r\n \r\nDe Mare: So you’d call the men in if you needed someone to \r\nhelp do the heavy lifting. \r\n \r\nChenevert: That’s right, that’s right. \r\n \r\nDe Mare: Ok. And were all your supervisors’ men or women? \r\n \r\nChenevert: Well the uh men they were both but our—the \r\nsenior supervisor was a man but there was a woman directly \r\nover us and I know she and I got along very well. \r\n \r\nKelly: What was it like between the men and the women in \r\nthe factory? Was there—what was it like going to work and \r\ndid the men think of it? All the Rosies? \r\n \r\nChenevert: Well I can only remember most of the men were \r\nquite accommodating if we ever needed anything because \r\nthere were other ways that they were using rivets.  They \r\nwere working machines and some by feet but that type of \r\n----------------Page (11) Break----------------\r\n 13 \r\nmachine I didn’t work.  But uh they used those and a lot of \r\nthe men did that and but as far as I can remember most the \r\nmen and women, they were getting a long and most them were \r\nrespectful. I can’t remember—that’s why I can’t remember \r\nany incident that stands out in my mind that wasn’t a \r\nfavorable one. \r\n \r\n16:10:12-------------------------------------------------- \r\n \r\nDe Mare: You say that you enjoyed doing the work, you said? \r\n \r\nChenvert: I did say I enjoyed doing the work, yes I did. \r\n \r\nDe Mare: Can you talk a little bit about—the war was going \r\non and you were obviously working to help the war effort— \r\n \r\nChenevert: That’s right. \r\n \r\nDe Mare: Can you talk a little bit about what it was like \r\nto be a young woman and have the war on and have your \r\nhusband be in the service, what that was like for you? \r\n \r\nChenevert: Well of course at the time they were away you \r\nknow you were lonesome. But one thing when you continued to \r\n----------------Page (12) Break----------------\r\n 14 \r\nstay busy, you were occupied and that kept you busy. So it \r\nwas only at the time you’d be alone that you’d be lonely \r\nand think about it. But I would go home every evening and I \r\nwould write to my husband everyday. So on the whole that \r\nwas fine for me. \r\n \r\nKelly: What did you feel about the war at that time? What \r\nwas the feeling, the feelings that about why were fighting \r\nand— \r\n \r\nChenevert: Well of course I don’t think any of us liked the \r\nidea of us being in war and knowing why were there...I can \r\nremember the Sunday when it was announced that the Japanese \r\nhad invaded Pearl Harbor and uh so I mean it was just.  You \r\nknow you were going to feel it because we were at that time \r\nwe were racing for food and other commodities so we felt \r\nthat very cleanly. But we learned to accept things. \r\n \r\nKelly: And what was Detroit like at that time? \r\n \r\nChenevet: Well it certainly was a different Detroit than \r\nwhat it is now. \r\n \r\nDe Mare: Can you talk about that? \r\n----------------Page (13) Break----------------\r\n 15 \r\n \r\nChenevert: Well you know we’ve always had strife in the \r\nworld wherever we are but most—there were so many—well \r\nlater on it seemed to me that happened I had been \r\naway...well away but I guess people were on edge. And then \r\nthere were times when you know because I think I was in \r\nhigh school when they had the first race riot and that \r\nwasn’t—no nobody appreciate that. \r\n \r\nDe Mare: What was that like for you as a young woman? \r\n \r\nChenevert: Oh it was horrifying. \r\n \r\nDe Mare: Can you talk about that a little bit?  \r\n \r\nChenevert: No I could just see so many people running \r\naround to so many different ones lurking but then when the \r\npolice were patrolling the streets, and what do you call \r\nit? The guards...and that was no fun at all to experience \r\nthose things.  You know, we were anxious for the war to end \r\nand I was hoping things could return as they were before.   \r\n \r\n----------------Page (14) Break----------------\r\n 16 \r\nKelly: Did you feel when you went to work or tried to go to \r\nwork, did you feel that there was a segregation with any of \r\nthe companies or any of the people you worked with?  \r\n \r\nChenevert: Well you know, you knew there—I mean, that’s an \r\nindividual thing with people and so naturally I met people \r\nwho were...maybe would want to be segregated and then maybe \r\nI met others who—but like I said the majority of people \r\nreally I got along with people. I was tried to get along \r\nwith people. And see I succeeded. So... \r\n \r\nDe Mare: When you were at Chrysler was the uh was the \r\nworkforce around you integrated or segregated? Did you work \r\nall together or were there black crews and white crews? \r\n \r\nChenevert: Most of the time...it was integrated to a point \r\nand then there were groups that were—there was one near our \r\ngroup that was all black and then I was with an integrated \r\ngroup. But I was the one about two blacks in my group and \r\nthe others and it consisted of about ten of us. And uh but \r\nthen there were groups that were segregated. But sometimes \r\nI think they segregated themselves because you could \r\ninterchange with jobs. \r\n \r\n----------------Page (15) Break----------------\r\n 17 \r\nDe Mare:  What was the social life like at the time for you \r\nas a young person? What did you do in your social life? Did \r\nyou go dancing? Did you go- \r\n \r\nChenevert: No I didn’t go doing a lot of dancing and just \r\nonce and a while I would go to the movies but that wasn’t \r\ntoo often either. You know and so—I, we were a very \r\nreligious family and we certainly believe in prayer and \r\nattending church.  I never missed attending church if I \r\ncould, you know inaudible but on the whole we got along \r\npretty good. \r\n \r\nKelly: And what was it like for your husband in the \r\nservice? What was his experience like? \r\n \r\nChenevert: Well my husband I guess he and I are something \r\nalike as far as dealing with people and he seemed to get a \r\nlong with most everybody. And he he didn’t have, he never \r\nhad too many complaints but of course he experiences \r\nprejudice because of his race. But on the whole he did \r\npretty good and uh so he joined, when he went to radio you \r\nknow radio operations school— \r\n \r\nDe Mare: What branch of the service was he in? \r\n----------------Page (16) Break----------------\r\n 18 \r\n \r\nChenevert: He was in the Air Force. So when he, I I uh \r\nafter I was in inaudible for a while, he was in Bellville, \r\nIllinois, which is right across the river from St. Louis, \r\nMissouri. I went to St. Louis for six months so I could be \r\nnear him there. \r\n \r\nDe Mare: So you traveled quite a bit as a young woman? \r\n \r\nChenevert: Yes.  I’m very glad I went where he was. We \r\nseemed to—well by us getting together early without family \r\nor anything, we seemed to have adjusted very well. So when \r\nhe died we were married for 57 years. \r\n \r\nDe Mare: That’s a long time. \r\n \r\nChenevert: It doesn’t seem like it now but it was a long \r\ntime... \r\n \r\nDe Mare: Were were any other of your brothers and sister \r\ninvolved in the war effort? Did they work on—in the war \r\nindustries or were they in the service? Any of your \r\nbrothers and sisters? \r\n \r\n----------------Page (17) Break----------------\r\n 19 \r\nChenevert: I had—my two older brothers—no my three older \r\nboys. Well I had four brothers who had been in service and \r\nduring World War II I had two brothers in the service.  One \r\nwas in Italy and one was in England. And uh later during \r\nthe other wars...where was inaudible? \r\n \r\nFamily Member: Well that was a different wars even. \r\n \r\nChenevert: I know it was a different war but do you know \r\nwhere he was? \r\n \r\nFamily Member: They were in the Korean War.  Inaudible and \r\nInaudible was. \r\n \r\nChenevert: Yeah, I know Eugene was in Italy and Alvin was \r\nin England. \r\n \r\nFamily Member: Italy too.  That’s where he got injured. \r\n \r\nChenevert: Well anyway, they went to service.  The four \r\nboys, they went to service but I don’t—not any of my \r\nsisters. \r\n \r\nDe Mare: You were the only riveter in the family? \r\n----------------Page (18) Break----------------\r\n 20 \r\n \r\nChenevert: I was the only riveter in the family. \r\n \r\nKelly: Y-you said your brother got injured in Italy during \r\nWorld— \r\n \r\nChenevert: Not Italy.  He was over in England when he got \r\ninaudible. \r\n \r\nDe Mare: What happened to him? \r\n \r\nChenevert: I’m trying to think just—What happened to Alvin \r\nin— \r\n \r\nFamily Member: They both got hit by— \r\n \r\nChenevert: My older brother Eugene lost his an eye but \r\n \r\nFamily Member: Inaudible. \r\n \r\nChenevert: But the other one, his back bothered him a lot.  \r\nAnd he was—the had sent him to the States to Wyoming to a \r\nhospital there.  I used to correspond with now and then but \r\nI don’t remember too much about the injury but he survived \r\n----------------Page (19) Break----------------\r\n 21 \r\nit and did well. And so did the other one.  They both gone \r\nnow. \r\n \r\nFamily Member: Inaudible wasn’t in the Korean War, he was \r\nin Germany. And Douglas was in the Philippines.  \r\n \r\nChenevert: Number three yea. \r\n \r\nDe Mare: Do you—can you talk about when you found out the \r\nwar was over? \r\n \r\n26:51:09------------------------------------------------ \r\n \r\nChenevert: Well, I was very glad when I heard the war had \r\nended because by that time I had a baby. I became pregnant \r\nwhen I was in St. Louis and uh when I came home when—about \r\nthe spring of that year and my baby was born in October. \r\nAnd then the following year was when the year was over. And \r\nI was just thrilled, yes. And uh was— \r\n \r\nDe Mare: Were you working at the factory when you were \r\npregnant?  \r\n \r\nChenevert: No— \r\n----------------Page (20) Break----------------\r\n 22 \r\n \r\nDe Mare: Did did, were you working at the factory while you \r\nwere pregnant? \r\n \r\nChenevert:(Shaking head) \r\n \r\nDe Mare: No... \r\n \r\nChenevert: See when I took that leave of absence, I never \r\nreturned. \r\n \r\nKelly: Do you remember where you were at or what you were \r\ndoing when you found out that war was over? \r\n \r\nChenevert: You know, I don’t remember what I was doing but \r\nI was happy but I was home most of the time anyway so I \r\nimagine that’s where I was. \r\n \r\nKelly: And did your husband come home right after? \r\n \r\nChenevert: He came home soon after.  He came home when the \r\nbaby was five months old. \r\n \r\nDe Mare: And now how many children did you have? \r\n----------------Page (21) Break----------------\r\n 23 \r\n \r\nChenevert: I had two children but they’re both gone now. I \r\nhad a baby in fact, my daughter who was born uh in my son \r\nwas born in ’45. My daughter was born in ’47 and she was \r\nstill born on July, in fact her birthday is soon, July 25\r\nth\r\n.  \r\n \r\nDe Mare: Did you ever go back to work after you left the \r\nfactory? \r\n \r\nChenevert: Yes I did go back to work. I went back to school \r\nfor a while then I worked for Michigan State uh for uh for \r\nthe Compensation and then I also worked for the Board of \r\nEducation. \r\n \r\nDe Mare: And what did you do for them? \r\n \r\nChenevert: I was Matron for the bathroom attended for the \r\nlocker room girls in the school. And so I worked there for \r\na while. \r\n \r\nDe Mare: If you if you could look back at the time when you \r\nwere a Rosie the Riveter, do you think doing that kind of \r\nwork that was so important and that you were very well paid \r\n----------------Page (22) Break----------------\r\n 24 \r\nfor, did that change you in anyway? Do you think it changed \r\nyour life? Can you talk to that? \r\n \r\nChenevert: I don’t think it changed me. I just know that I \r\nnever liked violence, I never liked war and I was just glad \r\nto do something to help.  Because there was a lot of help \r\nneeded at that time. \r\n \r\nDe Mare: Do you think that do you that that all the women \r\ngoing to work while the men were away at that time, changed \r\nthe way we look at women in this country? \r\n \r\nChenevert: With some people it may have because there was a \r\ntime when women didn’t always wear pants. And actually we \r\nreally started wearing a lot of pants then because I had a \r\njumpsuit for work. And I wore jumpsuits, and you know all \r\nthe overalls, coveralls, everything... \r\n \r\nKelly: Is there any memory or story that from that time in \r\nyour life that you um or maybe you’ve heard stories or \r\nanything that you recall that you’d like to just tell us? \r\n \r\nChenevert: I can’t think of anything that would be so \r\nextraordinary about it because it was a different time, I \r\n----------------Page (23) Break----------------\r\n 25 \r\nmea I talked about traveling on streetcars everyday because \r\nI didn’t drive at the time. And uh so I used to have to get \r\nout very early in the morning at five o’clock in order to \r\nbe at work at six when I was working in the dayshift. \r\nThat’s really something I’m telling you. \r\n \r\nKelly: Were they crowded or d-did—were they crowded? \r\n \r\nChenevert: Were they crowded? The streetcars? \r\n \r\nKelly: Yes... \r\n \r\nChenevert: They weren’t crowded in that time of morning but \r\nthere were quite a few people but they weren’t crowded. You \r\ncould always get a seat at that time of morning. And uh but \r\nwhen you made a transfer where others were coming from \r\nother directions, and the streetcars that ran to Wyoming, \r\ninaudible, you’d see so many women getting off the \r\nstreetcar. We had a field we walked from the line to the \r\nfactory and it was always so full and that’s the part where \r\nI’d see so many women. \r\n \r\n----------------Page (24) Break----------------\r\n 26 \r\nDe Mare: Can you talk a little bit about—I know you are \r\nfrom Detroit and you lived at home but I know so many women \r\ntraveled from everywhere to work at that time. \r\n \r\nChenevert: Yes, that’s true. \r\n \r\nDe Mare: And did you meet—can you talk about what that was \r\nlike for you? Did you meet a lot of people you would have \r\nnever met before? Or... \r\n \r\nChenvert: I did meet some people that I would never have \r\nmet before. \r\n \r\nDe Mare: ‘Cause it was the first time a lot of women were \r\nthrown together like that to work. \r\n \r\nChenevert: Yes, that’s true. \r\n \r\nDe Mare: Yea... \r\n \r\nChenevert: I know I never would have...one young lady, I \r\ndon’t think I’ll ever forget her but haven’t contacted...I \r\nused to talk to—see her or hear from her now and then.  She \r\n----------------Page (25) Break----------------\r\n 27 \r\nwas from Ironwood, Michigan and we got along. We worked \r\ntogether side-by-side and did very well together. \r\n \r\nDe Mare: Oh! Were you a member of the union? We-were—there \r\nwas a labor union wasn’t there. \r\n \r\nChenevert: There was a union...I’m trying to think—I don’t \r\nthink I was at that time. \r\n \r\nFamily Member: You waited, I think. \r\n \r\nChenevert: Because I don’t remember paying dues... \r\n \r\n33:29:08------------------------------------------------- \r\n \r\nFamily Member: Inaudible. \r\n \r\nChenevert: Yea, I wasn’t at that time. \r\n \r\nFamily Member: You weren’t a member? \r\n \r\nChenvert: No, not at that time. \r\n \r\n----------------Page (26) Break----------------\r\n 28 \r\nDe Mare: You don’t remember paying any union dues to work \r\nat the factory? \r\n \r\nChenevert: I don’t remember becoming a member when I worked \r\nyea know Desoto...Shirley give me that badge so I can show \r\nthem that...no, right there, it’s on the table, right where \r\nthe middle vase is... \r\n \r\nDe Mare: Will you hold it for us? For the camera? And can \r\nyou tell us what that is? \r\n \r\nChenevert: This-this is the badge I received the day I was \r\nhired at Chrysler-Desoto, 1943.  July 1943. \r\n \r\nKelly: Just hold it there for one second; I’m going to get \r\na close-up. \r\n \r\nDe Mare: So that’s you? And you would have been 18 years \r\nold in 1943, right?  You were born in ’25? \r\n \r\nKelly: Chrysler-Desoto... \r\n \r\nDe Mare: You are the first woman who has her badge that \r\nwe’ve talked to. \r\n----------------Page (27) Break----------------\r\n 29 \r\n \r\nChenevert: That’s because I didn’t come back after two \r\nweeks. \r\n \r\nKelly: You abandoned ship for love. \r\n \r\nChenevert: I sure did! \r\n \r\nFamily Member: That was a good thing. \r\n \r\nKelly: Yea. \r\n \r\nDe Mare: Absolutely, absolutely. \r\n \r\nKelly: How old were you during the war? \r\n \r\nFamily Member: Uh three years younger than she was... \r\n \r\nKelly: Okay... \r\n \r\nFamily Member: 15 when the war was over. It was quite an \r\nexperience. \r\n \r\nDe Mare: I bet. \r\n----------------Page (28) Break----------------\r\n 30 \r\n \r\nFamily Member: We had the black outs, we had to shade our \r\nwindows with drapes so you couldn’t even light a cigarette \r\nor match because we were worried about he air raids, you \r\nknow. Air raids with the sirens going...she was in Boise, \r\nIdaho a lot of it but I was here through it. I bet you did \r\nthe same thing in Boise.  Did you have black outs? \r\n \r\nChenevert: No, I don’t remember black outs here. I know we \r\nhad—you know when they had a rule it was for everybody. \r\n \r\nFamily Member: The black outs with the sirens. \r\n \r\nChenevert: We had rationing I know that. \r\n \r\nFamily Member: What was that? \r\n \r\nChenevert: Rationing. \r\n \r\nDe Mare: What was the hardest thing that was rationed.  \r\nWhat did you feel was the most precious thing you couldn’t \r\nget? \r\n \r\n----------------Page (29) Break----------------\r\n 31 \r\nChenevert: Let me see...sugar, I guess.  I can’t think of \r\nanything else.  It seemed like I had everything else I \r\nneeded. \r\n \r\nFamily Member: Your rationing? \r\n \r\nChenevert: Yea. What did you— \r\n \r\nFamily Member: Butter. \r\n \r\nChenevert: Oh you rationed butter? \r\n \r\nFamily Member: They rationed butter here. \r\n \r\nChenevert: They rationed the sugar \r\n \r\nFamily Member:...flour... \r\n \r\nChenevert: But you just had to have a shortage of so much, \r\nbut apparently I managed to eat because I’m about 117 on \r\nthere and when I came home from Boise I was weighing 135. \r\nAnd I wasn’t pregnant then... \r\n \r\n----------------Page (30) Break----------------\r\n 32 \r\nKelly: What do they say, when you fall in love you 10 \r\npounds? \r\n \r\nChenevert: I suppose so. I suppose so \r\n \r\n37:11:01------------------------------------------------- \r\n \r\nFamily Member: Pardon me. Did you tell them that you \r\ninaudible in high school? \r\n \r\nDe Mare: No.  \r\n \r\nKelly: Would you tell us that story?  \r\n \r\nChenevert: No I didn’t tell you that did I? \r\n \r\nKelly: Tell us! \r\n \r\nDe Mare: Yea, tell us! \r\n \r\nFamily Member: Yea, that’s the most interesting part \r\n \r\nChenevert: That’s... \r\n \r\n----------------Page (31) Break----------------\r\n 33 \r\nDe Mare: No, we want to hear it all. \r\n \r\nChenevert: Well, actually I was 14 years old when I met my \r\nhusband, because he was uh I was already in high school and \r\nhe had changed schools and I just saw him out talking to \r\nsome boys.  I knew his brother but I didn’t know it was his \r\nbrother and I just say—then I saw him talking to him and \r\nthen I asked him who was that young man with whom he was \r\ntalking?  He said, “Why are you interested?” So he then \r\nanyway, he talked to his brother and this is the way I met \r\nhim. There at school and then he started at the same high \r\nschool. \r\n \r\n38:10:16-------------------------------------------------- \r\n \r\nFamily Member: How old were you? 14? \r\n \r\nChenevert: That’s right.  I was 14 when I met him. \r\n \r\nFamily Member: And that was the beginning of a long \r\ncourtship. \r\n \r\nDe Mare: Well if she was 14 I would hope it was a long \r\ncourtship. \r\n----------------Page (32) Break----------------\r\n 34 \r\n \r\nChenvert: No, the courtship wasn’t long. I mean... \r\n \r\nFamily Member: Or a long life of love... \r\n \r\nChenevert: Yea because we married...oh! I’m glad we have \r\nthat picture still... \r\n \r\nDe Mare: Can you hold it? Is it too—yea. \r\n \r\nChenevert: I hope you dusted it. \r\n \r\nFamily Member: Yes, I did. \r\n \r\nDe Mare: And can you tell us who that is in the picture? \r\n \r\nChenevert: This is picture is a picture of—actually we were \r\nin the vicinity of the train station that’s on Michigan \r\nAvenue. \r\n \r\nDe Mare: And that’s you and your husband? \r\n \r\nChenvert: Yea, and I was down there with my husband because \r\nhe was returning to service. He was returning to service. \r\n----------------Page (33) Break----------------\r\n 35 \r\nOn this picture I was four months pregnant...four or five \r\nor whatever it was. \r\n \r\nDe Mare: Let me take that from you? Thank you... \r\n \r\nFamily Member: It was a wonderful love affair, let me tell \r\nyou. \r\n \r\nChenevert: Well it was a wonderful husband too and I’m so \r\nglad of that.  I have beautiful thoughts.  \r\n \r\nDe Mare: What has it been like to watch Detroit over the \r\nlast 50 years. I’ve never been here before. This is my— \r\n \r\nChenevert: You’ve never been here before? \r\n \r\nDe Mare: This is my very first trip. \r\n \r\nChenevert: Oh it’s— \r\n \r\nFamily Member: But when we were growing up it was so \r\nbeautiful. \r\n \r\nChenevert: Oh yes it was. \r\n----------------Page (34) Break----------------\r\n 36 \r\n \r\nFamily Member:...we had clouds.  We lived near Belle Isle. \r\n \r\nChenevert: That’s one thing, Belle Isle is still beautiful. \r\n \r\nFamily Member: ...oh we could ride our bikes... \r\n \r\nChenevert: We have friends in Belle Isle and then keep it \r\nup.  But we had so many things to be so thankful for.  We \r\nstill do but it’s just too bad the way things have gone \r\ndown. \r\n \r\nThe End. \r\n----------------Page (35) Break----------------\r\n"}}]