[{"type":"add","id":"frances-ellis","fields":{"identifier":"ROSIE_INTERVIEW_023","url":"/interviews/frances-ellis","label":"Frances  Ellis","description":"Frances Ellis started out as a bucker in Seattle for Boeing Aircraft but when her partner, a riveter, got pregnant, they had Ellis start riveting. ","image":"/images/ROSIE_INTERVIEW_023-interview-thumbnail.jpg","content":" 1 \r\nFrances Ellis \r\n \r\n \r\nThe Real Rosie the Riveter Project \r\nInterview 23 \r\n \r\n \r\n \r\nInterview Conducted by  \r\nKirsten Kelly \r\nJune 26, 2010 \r\nNashville, Tennessee  \r\n \r\n \r\n \r\nFor The \r\nFor the Tamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n----------------Page (0) Break----------------\r\n 2 \r\nInterview: Frances Ellis \r\nInterviewers: Kirsten Kelly  \r\nDate: June 26, 2010 \r\nPlace: Nashville, Tennessee \r\n \r\nEllis:  Well my is Frances Loraine Tunelle Ellis and uh I \r\nlive in Sun City, Arizona right now and um well originally \r\nwas from the state of Washington and from Washington, after \r\nwe married moved to Salt Lake and then to Sun City, Arizona \r\nwhere we are now.  But at the time, I was young and became \r\na Rosie we were in working in Georgetown.  Now Georgetown \r\nis a suburb of Seattle.  And just before you go into \r\nGeorgetown, across the street Seattle so you’re like that \r\nand we were under contract of Boeing.  Now I was only- I’m \r\n82 now but at that time, I was 18 and uh so when you went \r\nup there you had to be of age and they were kind of real \r\nstrict on you being of age to work. I think probably \r\nliability or perhaps.  I think at the time, I don’t know \r\nfor sure but I started out as a bucker. And the girl got \r\nsick and she was pregnant so they had me take her place to \r\nrivet.  She was a riveter and then of course we went from \r\nthere.  We worked on the bulkheads of the P-38s.  Had a lot \r\nof fun. I lived with another family in northern part of \r\nSeattle.  And us girls would- Mickey and I- that’s who \r\n----------------Page (1) Break----------------\r\n 3 \r\ntheir daughter was called, Mickey that’s what her name was \r\nand we get on the bus and we go for an hour to come clear \r\nfrom the north end of Seattle clear in to town then get the \r\nbus to go out to Georgetown because it was like we had to \r\ngo right downtown to get on the busses back out. But we had \r\na good time and lots of times we stood up because those \r\nbusses were loaded, honey. I- really a lot of people worked \r\nin those plants and of course when we got there we changed \r\ninto overalls. We- and we took out lunches with us.  It was \r\na fun time. I remember though, one thing. When you were \r\ndrilling if you got the the rivet in wrong which is easy to \r\ndo if that bucker isn’t perfect with that bucking bar \r\nbecause she had a bar- it was a big piece of metal bar that \r\nyou had to hold real tight to the rivet ‘cause when you \r\nrivet than it would, ya know, the rivet would go as you’re \r\nriveting it in she’s bucking and holding and pushing it \r\nagainst it and it would flatten it out to hold it in \r\nposition. The the two pieces of metal together, that’s what \r\nyou are doing actually, riveting those two together. And of \r\ncourse we were on the bulkheads of the P-38s and those were \r\nwhere the instruments go in- When you’re in a cockpit, the \r\nairplane’s cockpit than that’s where those instruments went \r\nin and this went in up to the cockpit but the instruments \r\ncame in front of them and two of them of course in the \r\n----------------Page (2) Break----------------\r\n 4 \r\nairplane. So that’s what we did and it was fun and \r\neverybody worked hard. \r\n \r\n03:25:01--------------------------------------------- \r\n \r\nKelly: What was the spirit like in the big factory- can you \r\nexplain what the factory looked like? Or- \r\n \r\nEllis: Oh, it’s kind of hard to remember. Well we were in \r\nan open- a big open room um I don’t remember that you know \r\nit was so long. \r\n \r\nKelly: How many people would you say- \r\n \r\nEllis: Oh there were a lot of us in there ya, a lot. And \r\nyou went in and out of the gate too.  You had a big name \r\nplate. You know you were you were- it’s almost kind of like \r\ngoing in the airport now except they were very fussy about \r\nanyone bringing anything in or out. Your lunch pail- I mean \r\nif anything suspicious went on, they were right on it. \r\nThere wasn’t any messing around about stuff like that \r\neither because we had at that time we had security too, we \r\nhad too because we had the Japanese. Of course that was our \r\nmain concern, one of them. And of course the German too but \r\n----------------Page (3) Break----------------\r\n 5 \r\nit it was a safety issue. Uh, they were real nice to us \r\ngirls though and we always had a man around too. Not too \r\nmany but they were around to help us if we got in trouble \r\nof any kind or in anyway you know. When one of the \r\ninstruments that we needed was a new gun. You had to go \r\ndown to get drills and he had a- what do we call it? Where \r\nthey would got and you’d get your drills and pick up your \r\nmachines- or rivet machine, your gun. It’s just like a big \r\ngun and those- and you pull it just like you do your hair \r\ndryer or something you know and BBBLLEEE. Well, you’ve seen \r\nyour husbands have a drill at home. It’s a big drill \r\nsimilar to that and then it had a “buda” that would push \r\nthat rivet in. It was kind of- it really is kind of \r\ninteresting. Interesting thing that the women did.  As a \r\nRosie, uh maybe in one- I was just able- when we organized \r\nthis I was uh a charter member so I was in one of the very \r\nfirst groups in Arizona. And of course Sun City, because so \r\nmany people have moved there we have one of the biggest \r\nchapter of everybody which is kind of interesting because \r\nwe’ve had ladies who were made Movie Stars, we have ladies \r\nwho are pilots, that ferried the planes.  We have three of \r\nthose pilots there in our group. \r\n \r\nKelly: A W.A.C.K.?  \r\n----------------Page (4) Break----------------\r\n 6 \r\n \r\nEllis: Yes we have one girl that was a W.A.C.K. and one of \r\nthe ladies who passed away now but she was a W.H.E.N. you \r\nmentioned- you know she mentioned the W.H.E.N.s and um that \r\nkind of stuff is real interesting when they have seen all \r\nthe different people who have worked in the different \r\nareas, it’s just marvelous how they talk about all this \r\nstuff.  You think you did a lot! You really don’t seem you \r\ndid very much compared to some of the other ladies who \r\nworked in different instruments.  Now we have one lady in \r\nour group that she was on in the middle of the city of \r\nPhoenix, Arizona. They had a- it was so hush-hush people \r\ndidn’t even know those people were working there or they \r\ncalled it something else but it was so ammunition that if \r\nit blew up it would have blown up that whole town.  The \r\nwhole center of that town down there. That’s how hush-hush \r\nit was but it started in that factory down there in Phoenix \r\nthat it as called something else so people wouldn’t that \r\nthat had that. Now they wouldn’t let something like that \r\ngo. But with everything from Pearl Harbor, I’ll tell ya, we \r\nreally had to sit on that. \r\n \r\n7:41:04------------------------------------------------ \r\n \r\n----------------Page (5) Break----------------\r\n 7 \r\nKelly:  Is it such a surprise- were you already working \r\nwhen Pearl Harbor happened? \r\n \r\nEllis: No I was in school, in high school and it was- we \r\nhad bo- all the boys left, the 17, 18 year olds left to get \r\njoined up.  Everything it meant so much.  Even my husband \r\nwas 17, just before he was 18 that went in.  But he was in \r\nthe Maritime.  He wanted to be a pilot but because of his \r\none eye, they wouldn’t take him as a pilot because you had \r\nto have perfect vision in order to be a pilot.  They wanted \r\nhim to be a mechanic and he said, “No way, if I can’t be a \r\npilot than I ain’t going to be anything.” Well, he joined \r\nthe Merchant Marine and to this today so many people don’t \r\nknow that Merchant Marines more men died in that line than \r\nall the men in the world- in the whole war. It amazed you.  \r\nAs a young person, you wouldn’t know that but if you read \r\nsome of the- if you got a hold of some of this history, you \r\nwould.  Uh, they lost so many of them in the Atlantic from \r\nthe German subs sinking the merchant ships that were taking \r\nthe, everything to our men. You know, they had to get them \r\nthere. No like, less he was out to see for 13 months, in \r\nPacific and down into Australia.  He came from Australia \r\nover to Abakan to Aruba and all those places bringing oil. \r\nSo they could refine it and get it to our own guys to use \r\n----------------Page (6) Break----------------\r\n 8 \r\nfor the machines for the track- for all those big what do \r\nyou call them? \r\n \r\nKelly: Tanks?  \r\n \r\nEllis: Tanks. They had to have fuel to run them, you know \r\nand that’s what they did too yea...I hear him talk about it \r\nand it’s so interesting and it’s only the last, well 20, 15 \r\nyears or so that they became Veteran and there aren’t too \r\nmany of those men left because my husband will be 85 pretty \r\nquick. So we’ve got but they did final get they did finally \r\nget- they did finally make them Veterans and he did get \r\nVeterans ch- and you had- the men had to get this through \r\nthe Coast Guard...uh...is who gave out all those, to those guys \r\nbut it’s quite interesting  \r\n \r\n10:15:00------------------------------------------------- \r\n \r\nEllis: At home as a younger girl on that too, we had we had \r\nquiet a bunch that you can’t see through the windows.  We \r\nhad black out blinds, you know. And boy if you didn’t do \r\nthat you had a person come around your neighborhood you all \r\nhad to- whatever they called it- I forgot what they called \r\nit but you had this man go around and boy, if you didn’t- \r\n----------------Page (7) Break----------------\r\n 9 \r\nif he could see light out of your windows, you were in \r\ntrouble. Because you see, we lived on the coast of \r\nWashington so it was a real. They all you know they did \r\nbomb, where was it. A place in Washington but it didn’t hit \r\nanything that was real important.  They missed, the JAPS \r\ndid.  The was war was going on over in Europe before the \r\nJapanese bombed Pearl Harbor because of all that they \r\nthought they were going to get away with it you know.  They \r\ndon’t teach them, they teach the Japanese kids even today \r\nthat we started that war. You didn’t know that I bet, did \r\nyou. \r\n \r\nKelly:  What do they- \r\n \r\nEllis: I don’t know what they do this but they do.  Well I \r\nthink it’s because we bombed Hiroshima you know the Atom \r\nbomb and thank God, for President Truman to go ahead and do \r\nwhat he did. It was an awful thing to have to kill so many \r\npeople to stop a war but they had to do it.  And this what \r\nthey should do some of that today.  I’m not kidding. I \r\ndon’t go for all that, honey, it’s just not right. \r\n \r\nKelly:  All what? \r\n \r\n----------------Page (8) Break----------------\r\n 10 \r\nEllis:  All this war over there that we’re in now because \r\nmy son was the Vietnam War and was hurt in it. For nothing, \r\nit was.  They could get nowhere doing it and killing all \r\nthose people. Their people as well as our people.  I just \r\ndon’t understand it.  We need more women to rule the world, \r\ninstead of men. Truly, we truly do. \r\n \r\nKelly: The world would be a different place. \r\n \r\nEllis: Yes, the world would be a different place.  I really \r\ndo believe that. \r\n \r\nKelly: How do you think being a Rosie changed your life? \r\n \r\n12:44:20-------------------------------------------------- \r\n \r\nEllis: Well it made me think more love in my heart for our \r\ncountry for one thing. Um I mean I’ve always had it.  And I \r\nfly my flag. I’m really a sinker about flying my flag \r\neveryday. And uh of course I’ve been associated with Coast \r\nGuard Auxiliary and was a commander of a big flotilla in \r\nUtah so I have came across some of the Military stuff too \r\nand it’s-it’s pride. Pride in the us we do and the county.  \r\nI just wish are politic thing was better. It’s too- it’s  \r\n----------------Page (9) Break----------------\r\n 11 \r\ntoo raunchy or maybe that’s not the word, “raunchy.”  Well \r\nthey aren’t as honest as they ought to be.  We need to get \r\na little more honest in our government and they- \r\n \r\nKelly:  Were there any gender challenges? What was it like \r\nfor women at this time as you were going to become a Rosie? \r\n \r\nEllis:  Well, at that time, one of the things was, “Whoa!” \r\nThe old ladies even older than our generation that were- \r\nwell you know, our mothers never wore pants, jeans, or \r\nanything like that. Overalls, sure people out on the farm \r\nhad an overall but the men, even the women out on the farms \r\ndidn’t wear overalls. They wore long dresses yet, you know. \r\nAnd that was such a changed for the women to to going to \r\nwearing pants and that was on of the big things in our \r\nsociety at that time. Those women...and so many women coming \r\nout and having to have their children taken care of in \r\nnurseries and stuff like this. And then you didn’t end- \r\nwell I was young enough that I didn’t went home, but I \r\ndidn’t- because I lived with some other people and I didn’t \r\nhave the responsibilities there that I grew up with as a \r\nkid because I was from a family of 12.  There were two \r\ngrandfather, eight children, a mother and a dad. And you \r\ncould of eaten off the floor, that’s how fussy my mom was \r\n----------------Page (10) Break----------------\r\n 12 \r\nand I was older girls so there for you had to do a lot of \r\nwork. And uh canons and that sort of thing growing up. And \r\nthat was another thing, a lot of these people did uh, you \r\ncan’t believe how many victory gardens we had. Uh one of \r\nthe ladies spoke about that today and yesterday about the \r\nvictory gardens and they had to have food for the troops \r\ntoo. And there were wonderful farms.  Everybody just came \r\ntogether. You’ve never seen or felt such coming together in \r\na country than you did during that war. Especially, in \r\nPearl Harbor. We just couldn’t believe it.  Even as a young \r\nperson, I don’t know how to explain it... you just sat there. \r\nYou can’t believe that this happened. I’m sorry, honey.  \r\nThen all of sudden you are in the middle of all this stuff. \r\nYou just can’t imagine that you feel so- horror and then \r\ntogetherness and everybody coming together to go to work \r\nand try to make these planes. We had it. We had to get \r\nthese planes and stuff out in such a short time because we \r\nneeded them. I mean, boy and you had to do them fast and \r\nthey were taking a car plant and making it into a airplane \r\nplant and it’s it’s amazing all the things they did back \r\nthen.  Uh, we’ve came in a lot of strives since the war, \r\nlike our cameras that we’re using right now.  All this kind \r\nof thing, technology is just well gone out the window. It’s \r\njust amazing. It’s it’s I could get carried away here. It’s \r\n----------------Page (11) Break----------------\r\n 13 \r\njust make you feel like your hearts going to bust because \r\nit’s so much for you sometimes.  That’s the feeling you had \r\nback then. Pride at buying a war bond.  The kids at school- \r\nwe’d take a dime to school and I can remember at the first \r\nof the war, I made a- I was an art student too and I can \r\nstill remember this big airplane I made, and it was a big \r\nposter for the hallway. And this pilot was sitting on top \r\nof the airplane over the fusel lodge and on the wing you \r\nknow.  He’s sitting up on the wings and his legs over fusel \r\nlodge.  It was quite a- I’ll never forget that darn poster \r\nand then we paid and saving all this buying all the gum we \r\ncould get for a penny. And then we’d take all the foil, and \r\nwe saved all the foil in one of our Rosebuds, that’s what \r\nshe did. She went around all the neighborhood and she’s a \r\nblind girl now cause she diabetes as a child and growing up \r\nwith this and now she’s where she can see light and day and \r\nstuff like that and figure us out by our voices and stuff. \r\nBut it’s amazing how even she talks about getting all \r\nthese. And she’d have big rolls of it. I’m not kidding, \r\nlike big baseballs.  We’d get baseballs that big and bigger \r\nof all this foil, tinfoil because they used that for uh \r\ntanks and uh everything. It’s amazing all the things that \r\nwe did do. Uh, yea, I never thought about that until just \r\nnow.  See you get talking about stuff and here you remember \r\n----------------Page (12) Break----------------\r\n 14 \r\nthese little things that you did do. But she was talking \r\nabout the shoes. \r\n \r\n19:12:07-------------------------------------------------- \r\n \r\nEllis: My father would save so he could take us for a ride \r\nonce a month. He’d save up for the gas for the car because \r\nyou had to ration the gas. And of course we had the tickets \r\nto buy the gas and that’s the same way as the food.  That’s \r\nwhy we had to can so much stuff because uh, you just \r\ncouldn’t buy food, well for a family of 12 you know. Yea, \r\nbut it was pretty- it was a nice \r\n \r\nKelly:  Can you tell me about the last day you worked as a \r\nRosie and then what happened after? \r\n \r\nEllis: Well I came home, well you know it’s hard to \r\nremember. I don’t know, once all that was over you kind of \r\nwent on with your life and it was just something you had to \r\ndo and you just sort of put it behind you.  I had a sister \r\nthat died at the time and we had a little baby left and so \r\njust kind of put up with that and then the next year I met \r\nmy husband and got married and he quit going to sea because \r\nhe was going to sail one more time then we got married and \r\n----------------Page (13) Break----------------\r\n 15 \r\nhe didn’t go. He came back and then we got married. Yea \r\nyea, it’s just part of after the war. Uh, it was something \r\nafter the war too, I’ll tell ya because houses started to \r\nshoot up and all kinds of stuff and everybody is getting \r\nnew cars and lots of things. \r\n \r\nThe End. \r\n----------------Page (14) Break----------------\r\n"}}]