[{"type":"add","id":"jerre-kalbas","fields":{"identifier":"ROSIE_INTERVIEW_001","url":"/interviews/jerre-kalbas","label":"Jerre  Kalbas","description":"Before the war, Jerre worked piecework jobs, one making velvet \"Roosevelt Roses\" for FDR's re-election campaign. ","image":"/images/ROSIE_INTERVIEW_001-interview-thumbnail.jpg","content":" \r\n \r\n \r\n \r\n \r\n \r\n Jerre Kalbas \r\n \r\nThe Real Rosie The Riveter Project \r\n \r\nInterview 1 \r\n \r\n \r\n \r\n \r\n \r\nInterview Conducted by \r\n \r\nAnne de Mare \r\n \r\nFebruary 17, 2010 \r\n \r\nNew York, New York \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\nFor The \r\n \r\nTamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n \r\n \r\n \r\n \r\n----------------Page (0) Break----------------\r\n \r\n \r\nInterview: Jerre Kalbas \r\n \r\nInterviewer: Anne de Mare \r\n \r\nDate:  February 17, 2010 \r\n \r\nPlace:  New York, New York \r\n \r\n \r\nDe Mare: So if you could just introduce yourself? \r\n \r\nKalbas: My name is Jerre Kalbas.  You don’t want me to, uh, \r\nput in that my real name is Emma, and...? \r\n \r\nDe Mare: You can do whatever you want.  You can say it \r\nhowever you want. \r\n \r\nKalbas: Well, Jerre Kalbas.  My name is Jerre Kalbas, and \r\nI’m 91 years old.  Uh, I was born, uh, March 3\r\nrd\r\n, 1918.  I \r\nwas born in the Harlem Eye and Ear Hospital.  At that time, \r\nHarlem was a very Jewish neighborhood, and my mother was \r\nvisiting her mother, and I wanted to see the outside world.  \r\nAnd, uh, so I was born in Harlem Eye and Ear, and we were \r\nliving in Bronx – South Bronx – uh, 136 Cyprus Avenue.  \r\nYeah, we lived all over the South Bronx – different places. \r\n \r\n----------------Page (1) Break----------------\r\nDe Mare:  Have you been back up to Cyprus Avenue? \r\n \r\nKalbas:  Uh, no, a long long time ago.  I would love very \r\nmuch, but, uh, it’s so different. \r\n \r\nDe Mare:  Can you talk a little bit about what your life \r\nwas like at the time? \r\n \r\nKalbas:  That’s the hard part.  Um, well, uh, it wasn’t a \r\nvery happy childhood.  Um, uh, I didn’t know that I was \r\ncreative, but I was making airplanes out of cardboard, \r\nusing flour and water as glue, not knowing any different.  \r\nAnd of course it would dry and peel apart.  And, uh... the \r\nreason it wasn’t very happy is because my father drank.  \r\nAnd when he was sober, he was a great guy, and uh, he \r\nhelped my mother, he did almost everything in the house.  \r\nAnd he was an iron worker, and he had a lot of buddies who \r\ndrank too, so... they got paid, and they drank, and then we \r\ndidn’t have anything to eat.  So we, so it wasn’t, uh, very \r\nhappy.   \r\nAnd of course, going to school, uh, the teachers were \r\nunaware of what I was going through – days where I was \r\nhungry, and uh...And we didn’t have counselor...counselors at \r\nthat time, even to talk to, and they didn’t care.  And I \r\n----------------Page (2) Break----------------\r\nwas a very shy, uh, frightened person, and so if they \r\ncalled on me, it was just, uh, horrible, y’know...I, I \r\ncouldn’t uh... And I wasn’t aware that I was also “dilexic”, \r\nwhich I just found out from my social worker, and I’m aware \r\nof it now, that I am.  And I have to be very careful when I \r\nwrite numbers, and uh... and reading is very difficult.  Um, \r\neven though I read a lot, um, I don’t think I understood \r\nmuch at that time.  And, uh, I had to leave school, and my \r\nfirst job was, uh, at artificial flowers, with like, uh, 20 \r\nwomen at one sitting.   \r\n \r\n00:03:06:21------------------------------------------------ \r\n \r\nAnd, uh, and I was ve – I was very... very boyish and \r\nvery manish at that time, at a young age.  And, even though \r\nwe didn’t wear pants, I wore a skirt, but a man’s \r\nshirt...haircut very short...couldn’t put lipstick on, but had \r\nto going to work, or I thought I did.  And, uh, couldn’t \r\ncarry a bag...everything was in a paper bag...until I learned \r\nabout the folding manilla envelopes.  And that was, that \r\nwas really wonderful.  Uh...and then as I got a little older, \r\nI had people, that uh, that were going to co- uh, to high – \r\nuh, high school, and... I had to drop out.  And I took my \r\nequivalence exam, which I passed. \r\n----------------Page (3) Break----------------\r\n \r\nDe Mare: Did you do that close to when you graduated...when \r\nyou left school, or did you do that years later?  \r\n \r\nKalbas:  I think a few ye- um...not too many years later, be- \r\nuh, um...in fact, I wanted to, uh, join the army, but they \r\nwouldn’t take me, because I didn’t have a high school \r\ndiploma.  And I wanted to join the army, because I knew \r\nthey gave you schooling...after you’re...you were out.  And, \r\num...you know, as my social worker tells me, even though I, \r\nI, uh, didn’t have the smarts to school learning, I was \r\nable to figure things out, which today is amazing, with \r\nwhat I’m doing.  I see the difference in myself, because I \r\ndidn’t know how to spell...I now know how to spell.  Uh, I’m \r\nwatching a lot of game shows, and uh, y’know Jeopardy...  And \r\nI struggle with the Times crossword puzzle, but I don’t do \r\nthe one in the New York Magazine, so um... I can’t learn how \r\nto do, uh...to play the other games...like Sudo-... Sudah-... I ca- \r\nI can’t do it.  I try, and I can’t do it.  Uh... \r\n \r\nDe Mare:  Now, let’s go back for a minute.  Can you talk \r\nabout... ‘cause you said that the...the flower factory was your \r\nfirst job...Can you tell me a little bit more about that?  Do \r\nyou know the name of the place? \r\n----------------Page (4) Break----------------\r\n \r\nKalbas: Yeah!  Kaplan Brothers, 18\r\nth\r\n St., near 5\r\nth\r\n Avenue...  \r\noh yeah.  I know the building...I don’t know the address, but \r\nI know the building.  I don’t know why I still remember \r\nthat...maybe because the first job.  And um...I don’t remember \r\nanything being different.  Most of them were married women, \r\nor s- or um, and all Italian women.  All Italian women.  \r\nAnd uh...oh yes, and I was very interested in photography at \r\nthat time, but didn’t have the money to really pursue it.  \r\nAnd so, um, they we- uh... the wedding, or some feast day, \r\nwhere they have a whole bunch of bread, and um, so they \r\nasked me to come and photograph it, which I did.   \r\n \r\n00:05:58:14----------------------------------------------- \r\n \r\nUh...these g- these things are gone, because when I had the \r\nfire, uh on Jones St., somebody took my kneehole desk stuff \r\nto hold for me, and a few other things, and he never would \r\nreturn it.  So all these papers and pictures are, are gone.  \r\n \r\nDe Mare:  So were you actually, um, were you actually \r\nmaking the artificial flowers? \r\n \r\nKalbas: Yes. \r\n----------------Page (5) Break----------------\r\n \r\nDe Mare: And how, how...just explain to me how you did it. \r\n \r\nKalbas: Oh, ha, not very well.  No, not very well, because, \r\nuh...I was very handy, but it’s something I didn’t like, so I \r\nreally had to be shown a few of times. Well, you get these \r\nmetal stems, and you wrap the green, uh, paper around it... \r\nbut the one flower that I remember... very, very important... \r\nI’m sorry I didn’t...I don’t have that...that was in the \r\ndesk...uh, and you don’t see it today at all... um, Roosevelt \r\nwas running for the first time.  We made the Roosevelt \r\nflower – the rose with a piece of velvet, V – E – L – T, \r\nwhich was fantastic.  It was a fantastic flower. And, of \r\ncourse, I got one.  And, uh, I once passed a store, and \r\nthey had a lot of ca- uh, ca- uh, old, uh, campaign \r\nbuttons...not one of these. Not one of these.  And it was a \r\ncampaign button.  But, um, yeah that one flower I know.  I \r\ndon’t remember the others, and I don’t know how long I was \r\nthere.  But I do know it was nine dollars a week... and five \r\ncents a card there, and ten cents for cigarettes, or, uh, \r\nor 6 for a nickel, y’know, so, uh, you were okay. I didn’t \r\ndrink at that time, uh, so uh... \r\n \r\n----------------Page (6) Break----------------\r\nDe Mare: Do you remember how old you were when you worked \r\nthere? \r\n \r\nKalbas: Yeah, 16.  Yeah, that’s right.  Ooey.  I was \r\nsixteen once.  Ha ha...Yeah... \r\n \r\nDe Mare:  And do you remember where you worked from there...? \r\n \r\nKalbas:  No, I can’t remember what my next job was, but \r\nmost of them were factory jobs for a while, and, uh, when I \r\nwas sixteen what year was that...?  Uh let’s if I have to \r\nknow the, uh... \r\n \r\nDe Mare: 1934?  Yeah...1934. \r\n \r\nKalbas: 1934. Mmm. Can’t remember where I... \r\n \r\nDe Mare:  So, so you were still at home when you worked at, \r\nuh, Kaplan Brothers...? \r\n \r\nKalbas:  Oh, yes, I lived at home until the age of 21.  My \r\nmother was 4’11”, weighed 98 pounds.  I was the only one in \r\nthe family that looked liked this.  Um...they used to call me \r\nthe Russian peasant, the Muzhik.   \r\n----------------Page (7) Break----------------\r\n \r\n00:09:00:14----------------------------------------------- \r\n \r\nThe, uh... well I was, uh, I had a brother who was 6’3” and \r\nweighed 139, and an older sister who was tall and very \r\nthin.  And my kid sister was very thin.  I was the only \r\none...my father was normal, with a beer belly.  They, uh, so \r\nuh, I was the only one...yeah, and I was a 38D.  I was very \r\nbig.  My sister was flat-chested...and she used to put \r\nsocks...and I was binding mine. \r\n \r\nDe Mare:  And...so you were living at home... working at the \r\nflower factory...  \r\n \r\nKalbas: Yeah. \r\n \r\nDe Mare: ...working the other factory jobs...  \r\n \r\nKalbas: Yeah. \r\n \r\nDe Mare: You don’t remember what else you might have done...? \r\n \r\nKalbas: Well, uh, yeah, I worked, uh...I worked in machi- in \r\na sewing machine job...uh...where I ...what was I making?  It was \r\n----------------Page (8) Break----------------\r\nsomething very...something with glue...I can’t remember.  Oh, \r\nbindings, I think.  Bindings...coming out of this machine.  \r\nUm...I can’t remember... \r\n \r\nDe Mare: So you basically...you basically left school around \r\n16 to go work in the flower factory, right? \r\n \r\nKalbas: Yeah. \r\n \r\nDe Mare: That was like the way...that was the way... \r\n \r\nKalbas: That was my first job.  Yeah, my father wanted me \r\nto be a nurse, which I ...(shakes head)...had no desire...or go \r\nto, uh, business school, which I had no desire.  So...so, \r\njobs were the only thing I could do.  And no the having the \r\neducation, so uh... \r\n \r\nDe Mare:  And then...and then you were basically home until \r\nyou were 21...and your mother passed away...can you tell me \r\nthat story there...? \r\n \r\nKalbas:  Uh, yeah.  Um, when, um, I could never leave the \r\nhouse – I wanted to leave the house before, but I could \r\nnever leave the house, because of my mother, and my father \r\n----------------Page (9) Break----------------\r\nwould abuse her.  So, when I... when she died, I um... uh, that \r\nwas a rather painful part of my life, because she was a \r\nvery sickly woman, and of course, being a drunken husband, \r\nuh, the abuse of, uh...only now I know how abusive it was, \r\nbecause she had so many miscarriages.  And, um, four of us \r\nsurvived.  There was another little girl, uh, who I never...a \r\none-year-old who died from pneumonia.  Um...and, you know, \r\nthis was a toll on her, and, uh, was in the hospital with, \r\num, uh, hernia operations, which I’ve already experienced. \r\nUm...and when she died, they came and, uh re- revived her, \r\nso, um, so she was alive for awhile again...and then she \r\ndied.   \r\n \r\n00:12:08:09---------------------------------------------- \r\n \r\nAnd we had no burial...that was the other thing.  I had to go \r\nacross the street, and they- dry goods store, to get \r\nsomething to wrap her with.  And they must have used an egg \r\nsomething...it’s a glue, like, whites or something...uh, to \r\nclose her eyes, because for years, every time I would break \r\nan egg, I would go out of my mind.  I smell that smell.  \r\nAnd, uh, and uh, when they were putting up the headstone... \r\nor, or after I left the house, my brother and sisters were \r\na little angry at me.  They wouldn’t talk to me.  And I had \r\n----------------Page (10) Break----------------\r\nno place to go.  I was a scared kid, even though I was 21, \r\nI was scared.  And, but I had the [Nayah Judah] Movement, \r\nwhere this man knew that, uh, Palestine and the Jews would \r\nnot get along, and...so we were going to have a homeland, in, \r\nuh, Alaska.  And the United States government gave people 4 \r\nacres of land – that’s how Alaska was built up.  The \r\ndoctors and, uh, nurse, and teachers...and we, as a whole \r\nbig group of girls and boys, were going to go.  And were \r\neven going to go out in covered wagons.  Ha ha. Uh, I have \r\nhis book somewhere.  My friend, Jeanie, who just died, dug \r\nit up for me, so I have the book somewhere...I don’t...uh, \r\nafter all these years.  He was a great man...wonderful man.  \r\nAnd so here was a place for me to stay, and a place for me \r\nto go – a farm.  My father always talked about going on a \r\nfarm.  So I want to go on the farm.   \r\nSo we went up to Livingston Manor.  A man gave us some \r\nproperty.  Um...uh, away from his, uh, summer place, where \r\npeople used to come up.  And so we had tents put up, uh, \r\nten for 20 of us – me and the guys.  We couldn’t get any \r\nwomen to stay. And, uh the boys thought they were going to \r\nhave me cook for them and wash their clothes.  I had other \r\nideas – there I am, very masculine, and...  So, I, I was \r\nbuilding the roads and chopping down trees, trimming them, \r\nand making chords of wood.  I went up there 139, and I came \r\n----------------Page (11) Break----------------\r\nback 165, solid muscle.  It took years for me to lose it – \r\nmy back used to ripple with my... And of course, I became a \r\nwaitress at one time, and pulled out a...uh, the booth, and \r\nuh, I doubled up.  That was my first operation – the \r\nhernia.   \r\n \r\n00:14:59:09----------------------------------------------- \r\n \r\nWell, from that work, I guess...and my...the walls were weak, I \r\nguess I took after my mother there.   \r\n \r\nDe Mare: That’s fascinating... \r\n \r\nKalbas: I’m rambling...I’m rambling on... \r\n \r\nDe Mare: No, no, no!  You’re actually... I, I’m letting you \r\nramble, because it’s fascinating.  Um...and thank you for \r\ntalking about your mother.  I know that’s difficult stuff. \r\n \r\nKalbas: Yeah, that was very difficult. \r\n \r\nDe Mare:  I know it’s tough stuff.  I think it’s...I, I think \r\nthat there’s something that I really um...one of the things – \r\nyou can turn off the camera for a minute.  (break)  Um, so \r\n----------------Page (12) Break----------------\r\nI just want to be sure that I have it clear.  So you, with, \r\nyou moved...you went to the farm with the [Nayah Judah] \r\nMovement. \r\n \r\nKalbas: Uh, yeah, this was a farm at the Livingston Manor.  \r\nI don’t know how it came about, but then we went to \r\nConnecticut with uh... to a farm owned by Fanny Holtzman.  \r\nShe was the lawyer that, uh, broke the Rasputin case...many, \r\nmany, many years ago.  Anyway, I should talk about her, but \r\n...and she also, at that time, when the UN, uh...the Jewish \r\nproblem started, she was very active in that.  And so, she \r\nhad a very beautiful house up there, and we of course had \r\nour tents.  And, uh, and she had work for us to do for her \r\ntoo – like clearing some of her property.  And she would \r\ncome up weekends, and she would see how much we did.  She’d \r\nhave a carton of cigarettes.  Instead of leaving a carton, \r\nshe’d figure out how much we did, and leave a \r\npack...y’know...until the point where I had to smoke a pipe, \r\nbecause I wasn’t getting any cigarettes.  We were doing our \r\nown...our own work. \r\n \r\nDe Mare:  And now, what was the end...how did that...how did \r\nthat [turn your life around]... \r\n \r\n----------------Page (13) Break----------------\r\nKalbas: Oh yeah, yeah, how... how did it, uh... \r\n \r\nDe Mare: You mentioned- \r\n \r\nKalbas: Oh they had a- yeah, yeah, of course!  Uh, it was \r\nme and 20 boys.  They were boys, and I was a girl, y’know \r\nwe were very... Um, and uh... this was 19, uh, th- uh 31- uh, \r\n39.  Yeah, 1939 when I went up to the farm.  Um...and the war \r\nbroke out.  You know, we had, we had meetings here.  There, \r\nthere was...I slept at...before we went up to the farm, I slept \r\nat, uh, um...the uh, the office on 34\r\nth\r\n, off Lexington.  \r\nUh...and I think I told you about hiking up the...to the \r\nfarm...in the boots.  With the...  \r\n \r\nDe Mare: Tell me again.  You can tell me lots now. \r\n \r\nKalbas: Oh boy.  Okay.  But that time, you know, you were \r\nable to hike.  You were able to pick up trucks, and they \r\nwould give you lifts.  I mean, that, that’s the way we... we \r\ntraveled a lot at, at that time, and we were kids.  A lot \r\nof my friends did that too...to get to Orchard beach, you \r\nknow...We, we would pick up cars...and everything was safe at \r\nthat time.   \r\n----------------Page (14) Break----------------\r\nAnd, um... oh yeah, I think I told you about my fa- my \r\nsister taking piano lessons?  This is important to the, uh... \r\nAnd um, I wanted very much to play the violin, and, uh, he \r\nwouldn’t give me lessons, because he thought I wouldn’t \r\npractice.  And I wanted them. \r\n \r\n00:18:02:19------------------------------------------------ \r\n \r\nAnd I think I told you I made a violin out of a cigar box, \r\nand a bow with rubber bands, and I used to squeak... And uh, \r\nand I would never get compliments, uh, of what I was doing.  \r\nI was drawing.  I was doing all kinds of stuff with my \r\nhands, and...nothing.  No ever...no encouragement...no, uh... \r\nexcept I had teachers in junior high - the first year, I \r\nthink – sisters.  And one of them seemed to be interested.  \r\nNow I go back and I realize they both had very manish \r\nhaircuts, you know, and that’s how I mighta...you know, I \r\nwasn’t aware...  I was worried about myself, you know, and... \r\nbeing attracted to the teachers, you know, and all that \r\nnonsense.  Um...and so...where was I with the...um... \r\n \r\nDe Mare:  You were going to, um, going to, getting up to \r\nthe farm. \r\n \r\n----------------Page (15) Break----------------\r\nKalabas: Oh yeah.  And so, uh... we decided to hitch up, to – \r\nthe secretary and I – decided to hitch up to, uh, \r\nLivingston Manor.  There were 6 guys there, and we were \r\ngoing to stay for the weekend.  And I borrowed a pair of \r\nboots.  And I had two pairs of socks on, and they were \r\nstill big.  And here I am walking...and I had the violin case \r\nthat Joseph [Hefter] gave me...with a violin in it.  I was \r\ngonna go, y’know, play.  And, of course, when the truck \r\nstopped us, I hadda open the violin...y’know...the machine gun.  \r\nHa ha.  And, I think I told you this before.   \r\nUh...and so we got up there, and um, the boys \r\nimmediately said - she was a woman, and here I am a girl – \r\nand there was one boy up there that I was friends with, \r\nCharles...very good friends...and he knew, he knew about me.  \r\nAnd um...but the boys wanted us in the middle of the bed.  So \r\nwe slept in the middle.  And one of them was getting a \r\nlittle fresh and kept moving his hand.  And so I woke up in \r\nthe morning, and I told Charles.  And I said, “Charles, I \r\nwant to sleep in front of you.” And he said, “Okay.”  I \r\nsaid, “But we have to say something so that the boys won’t \r\nthink anything...I don’t want anybody to...”  So I said that \r\nthey were accidentally...oh, yeah, I had big blisters on the \r\nbottom of my foot, which they hadda open...and they bandaged.  \r\nSo I told them that they were kicking my foot and they \r\n----------------Page (16) Break----------------\r\nhurt.  So I slept on the outside.  And at that time... Today, \r\nI realize that I was able to take care of myself – all \r\nthese different things – and I’m doing more of it today \r\nthan I ever did.  And my social worker, y’know, pointed it \r\nout.  He said, uh, y’know...because I can’t read and \r\nunderstand...I have to be able to do...to be able to ... I mean, \r\nyou can tell me, tell me from now, or show me...but I have to \r\nDO to learn...and he says, “Yes, yes you would.  You are.  I \r\nmean, you have to do it, and then you learn.”  And I do. \r\n \r\n00:21:04:16------------------------------------------------ \r\n \r\nAnd, so, um, that was that story.   \r\nAnd, um, I can’t remember what year it was, but I also \r\nworked at the U.N. at the last year that they were a great \r\nsuccess.  Um, and that was, that was really pathetic, \r\nbecause Russian was my first language.  And, they didn’t \r\nteach me how to read or write, um, and, uh, I refused to \r\nspeak it.  After I went to school, that was the only \r\nlanguage I spoke at five years old, and they were making \r\nfun of me, so I had to learn English.  And I tried to teach \r\nmy father and mother English.  Uh, my father was an iron \r\nworker...uh, oh yeah, and Jewish – they spoke Jewish when \r\nthey didn’t want ... to know what they were talking \r\n----------------Page (17) Break----------------\r\nabout...until I met a lot of Jewish friends, and then I \r\nstarted to understand what they were saying.  So, y’know, \r\nso who is, uh... So I could n- uh... \r\n So at the UN, it was just...y’know, you had all \r\nnationa- it was just so wonderful, uh..  But I wasn’t \r\nlearnt enough to speak the Russian, uh...I was, I was an \r\nescort.  I was delivering message into the assembly hall.  \r\nY’know I, I’d call in and give it to Pearson, the English, \r\nuh... ah... I’d help [Gramiko] on with his coat.  Y’know, it, \r\nit was just, uh, a wonderful thing, but I was still very \r\nnervous and very shy, and...  And I made the mistake of \r\ntaking the kids into the delegates lounge, and all of a \r\nsudden, on the loud speaker, came, “Get outta there!” \r\ny’know in nice words.  And then I got friendly with this \r\nwoman who made the, uh... and she...because nobody taught me \r\nwhere places were.  And then they wanted me to, uh, use the \r\nphone...and delegate rooms to the delegate... to the delegates.  \r\nWell, I, I didn’t know how to the phone thing...I mean, \r\n“hold”, and ... I would...I would... I mean, what a mess I made.  \r\nI couldn’t do it.  I could ... secretarial things, I just \r\ncouldn’t learn.  Didn’t want to.  Didn’t want to.  Because \r\nI always worked with my- yeah I had a lot of mach- machine \r\nshop experiences, and, uh, and this is what I, uh, liked \r\nbetter. \r\n----------------Page (18) Break----------------\r\n \r\nDe Mare: So, so talk about...so the boys all got drafted... \r\n \r\nKalbas:  Oh yeah, the boys got drafted, yeah.   \r\n \r\nDe Mare:  Uh, and then, what did you do...?  ...next...?  Do you \r\nremember what, what you did? \r\n \r\nKalbas:  Yeah, yeah I went to California, and that my first \r\ndefense job...in 1940, I think.  1941.  Yeah, uh, Frankie and \r\nMyra, these friends of mine, invited me.  And so I... there \r\nwas a Cafeteria called Life, which was very gay... and a few \r\nstraight people, but mostly gay.  And this major from the \r\nSalvation Army was very friendly.  And, uh, I mentioned, I \r\nguess, that I wanted to go to California, and he gave me \r\nthe ticket – the price of a ticket. \r\n \r\n00:24:05:21------------------------------------------------ \r\n \r\nAnd I sat up on this bus, 6 days, all the way to \r\nCalifornia.  And, uh...and we went into this store, a machine \r\nshop, where they were making these sidewalk breakers, which \r\nthey have these elegant ones now...nothing like this one.  \r\nAnd also the handguns.  And, uh, at that time I wasn’t \r\n----------------Page (19) Break----------------\r\naware that my friends were collecting parts of a handgun.  \r\nAnd they put one together for, uh, Ralph Faulkner, who was \r\nteaching, uh, fencing to the actors...and so we got free \r\nfencing lessons.  So that’s when I first started to fence, \r\nand then when I came to New York, I had more, uh...and that \r\nwas gone – my foils and my masks – when I had the fire.  \r\nThis guy kept those too.  I had a pair or two...you know, \r\njacket and everything.  So, uh, you know if I took a lunge \r\ntoday, I wouldn’t be able to get back, but... ha ha ha.  But \r\nit was great, uh, great sport. \r\n \r\nDe Mare:  So you worked at [Thor...]? \r\n \r\nKalbas:  So I worked at Thor..., and um...and I like California \r\nvery much...I, I w- oh yeah, so I wanted to stay, and we were \r\nlooking for property, but they would not sell women \r\nproperty.  They would not, at that time, sell women \r\nproperty.  A woman could not buy real estate, or...in \r\nCalifornia anyway.  That was in the 40s, early 40s.  So we \r\ncouldn’t buy anything.  We couldn’t, uh... So, uh...  Oh they \r\nwanted to come back to New York.  SO I came back in the \r\nrumble seat, because I couldn’t drive.  So I was in the \r\nrumble seat, and they were dri- taking turns driving.  And \r\nthat took us about five days, I think.  We hadda stop and \r\n----------------Page (20) Break----------------\r\nbuy a rug...I was freezing back there.  But blankets were too \r\nexpensive.  But it was fun.  And then my... \r\n \r\nDe Mare:  What do you mean that women couldn’t buy real \r\nestate?  Was it a law, or was it just no one would deal \r\nwith you?  Do you remember? \r\n \r\nKalbas:  They just didn’t sell to women.  Women were \r\nnothing.  You know, even...at that...at that time.  You know, \r\neven though we were in the...defense plans, y’know?  They um... \r\nNo, I wasn’t aware that uh, we just...they would not sell to \r\nus.  I don’t know whether it was all over or what.  I’m \r\nsure the more wealthy women were able to buy it...I don’t \r\nknow...what went through their- I don’t know.  And, uh, we, \r\nwe didn’t bother looking into it, I don’t- no, I know that \r\nwe were very angry, and I’m sure we did something, but I \r\ncan’t remember the details. \r\n \r\nDe Mare: It’s fascinating. \r\n \r\nKalbas: I c- ... I know.  I know. \r\n \r\nDe Mare: It’s amazing, because that really was not very \r\nlong ago, you know what I mean?  Like it was a long time \r\n----------------Page (21) Break----------------\r\nago, but in terms of the way things have shifted between \r\nthen and now...I just...I’ve never... \r\n \r\n00:27:00:07---------------------------------------------- \r\n \r\nKalbas:  Well, when did we get to vote?  I mean, uh ... \r\n \r\nDe Mare: 1920 \r\n \r\nKalbas:  I know.  Without...yeah, without voting...without, \r\nuh, yeah. \r\n \r\nDe Mare: Did your mother used to vote?  Did you...do you \r\nremember? \r\n \r\nKalbas: Oh I...I don’t know...cause I know they were citizens...I \r\ndon’t know. \r\n \r\nDe Mare:   I’m just curious.  ‘Cause my mother took me... \r\n \r\nKalbas: My mother didn’t do anything outside of take care \r\nof us.  She loved to take care of babies, or take care of \r\nus, you know, and, um...but she didn’t do anything.  She was \r\na very meak- very lovely woman, but ... And I liked my father \r\n----------------Page (22) Break----------------\r\nvery much...when he, uh, was sober.  But when he was drunk, \r\nit was just awful.  I really had to stay up and protect \r\nher.  I mean, I didn’t realize until many years later, I \r\nwas my mother’s protector.  And this, uh... my relationships \r\nwere pretty bad, um, because of that...many years...because I \r\nsaw...I didn’t let women breathe, you know...  I just wanted to \r\ndo.  And, uh, I realized...it took me many years before I \r\nrealized what was happening.  And when I see today the way \r\nkids are, I just can’t...can’t believe it, you know?  They’re \r\nso free, and, and it’s, it seems so easy.  But, uh, it \r\nwasn’t easy growing up.  And, yeah, I had a lot of fun...you \r\nknow, I...uh...and I guess I always wanted to laugh, you know, \r\nand uh... I made sure I was happy.  And uh...and I loved the \r\nwork on the farm.  The harder it was, the better I liked it \r\n- as long as I didn’t have to cook and wash their clothes.  \r\nBad enough I had...I mean, we were doing it on the rocks!  \r\nAnd our, yeah, and our only means of bathing was these \r\nwonderful, beautiful falls...up at Livingston Manor...it was \r\njust beautiful.  I mean, you were able to sit under the \r\nrocks there, with the water coming down.  And when the \r\nwomen would come up, uh, visiting during the weekend...of the \r\nboyfriends...the girlfriends of some of the boys, and then \r\nsome of the girls... And I would have to go with them...watch \r\nthem bathe...to keep the guys away.  I was playing chickie.  \r\n----------------Page (23) Break----------------\r\nI was going out of my mind... And of course, they would leave \r\nover the weekend.  So... y’know... nobody, uh... And they left me \r\nup on the farm all alone, up at Livingston Manor.  Um...yeah, \r\nhow did they get to...Maybe they had been up at Connectucut \r\nfirst...I can’t remember now...that’s terrible...because I wound \r\nup at Livingston Manor.  Yeah, uh, and this tent for 20 \r\npeople – it was a huge thing.  And, uh, it was getting very \r\ncold, and the rain and the snow was beating down, and it \r\nwas beginning to tear.  I had to shimmy up that thing and \r\nget it loose...get the ring off...to get that tent down.  So...it \r\nwas very...I think that’s why I’m strong today...the uh, \r\noutlasting, you know... \r\n \r\n00:30:20:02------------------------------------------------ \r\n \r\nDe Mare: I’m glad!  Whatever it is. \r\n \r\nKalbas: Yeah, and I have family now too. \r\n \r\nDe Mare: So let’s go, let’s go back...let’s go back to the \r\nDefense job for a minute.  So you, so you worked out, you \r\nworked out in Thor Industries you made the, the  sidealk \r\nbreakers, and then you  \r\n \r\n----------------Page (24) Break----------------\r\nKalbas: Yeah...I came back to New York. \r\n \r\nDe Mare: ...and what did you do next? \r\n \r\nKalbas: I think it was the Lafayette one next.  And that \r\nwas, um, a number two laithe – huge laithe.  Warner and \r\nSwasey laithe.  And we would machine parts.  And, but that \r\nwas a hand crank thing...it wasn’t a...the good laithes that I \r\nwent to Ford instrument...that were...those were beautiful.  \r\nThese were very, uh... they had, they had belts from the \r\nceiling coming down to keep... to work them.  It was weird. \r\n \r\nDe Mare:  ...and what did you make there? \r\n \r\nKalbas: There, at Lafayette, I don’t know what I made.  I \r\ndon’t even think they let us know.  But at...there was a \r\nsmall machine shop on, um, on Waverly Place?  Or...the street \r\nwhere um, where um...that bar?  The 1969...Stonewall.  There \r\nwas a street there that had a small machine shop.  I worked \r\nthere...and there we were making the silver parts for the, \r\nuh, the whatcha-call-it ships...the, uh, the ships that went \r\nup in the sky.  The uh, the uh... no no, the uh, space, the \r\nspaceships.  We made the silver parts, and, and we had a \r\nbox there to share the silver shavings, and people would \r\n----------------Page (25) Break----------------\r\ncome around to make sure you weren’t taking any silver.  \r\nAnd, uh...and that was for the uh, space... uh... um...when it was, \r\nh- the what’s the word I want?  The space industry...would it \r\nbe...?  Yeah...yeah, that they told us.  And, uh...that was very \r\nstrange, because I received um, a Christmas card, and it \r\nwas K-A-L-B-A-S-S.  and...the first name...and there was an \r\naddress, and I called my sister, and I said “This is weird.  \r\nI mean, I don’t know any...”  And we didn’t know what the \r\nfirst name was – which I can’t remember now.  And, so, uh... \r\n \r\n00:32:57:09------------------------------------------------ \r\n \r\n...oh I made the phone call...I don’t know how I got the phone, \r\nbut I made the phone call.  And I spoke to this woman...I \r\ncan’t remember the name of the shop on the street, but she \r\nsaid “Do you work there?”  I said, “Yes.”  She says “Well, \r\nthat’s my husband who’s a foreman there.”  I didn’t even \r\nknow his last name.  And so, she, they had sent out the \r\ncards.  Yeah...it was, it was another letter missing...but it \r\nalmost like my last name...Kalbas. \r\n Um...so that shop.  And I think from there it was, uh, \r\num...Ford Instrument, out in Queens.     \r\n \r\n----------------Page (26) Break----------------\r\nDe Mare:  Can you talk to me about the job at Ford \r\nInstrument...?  What did you do there? \r\n \r\nKalbas:  That...uh, I was an inspector first.  I was \r\ninspecting things.  And then they let me run the lathe, \r\nbecause I told them I did it at this place...but the lathes \r\nwere so different...that’s when I started to run the lathes \r\nagain.  And uh...set them up and everything.  And, uh...and I \r\nwas a very careful worker...very careful.  Like my friend, \r\nMaya, had a job running a lathe, and she accidentally left \r\na [chuck] key in, and then she leaned over...and I caught \r\nher, you know...and she was being pulled, but she stopped the \r\nmachine.  And I saw some terrible accidents in California \r\ntoo.  I mean, the...the woman refused to wear her ____ \r\nhat...and operating a drill press.  So...she lost her eye \r\nsight.  It was...uh...really bad... \r\n \r\nDe Mare:  When you were at Ford Industries, was it a lot of \r\nwomen working...was it some women working? Can you talk \r\nabout...? \r\n \r\nKalbas:  Yeah... There weren’t as many women as men, but \r\nuh...oh Ford Instrument – there were a lot of women.  Yeah, \r\nuh...inspectors...and uh... In fact, uh, my friend - the woman I \r\n----------------Page (27) Break----------------\r\nwas living with then – uh, got a job there.  And, I think I \r\ntold you about her...Patty?  Uh, she was 10 years older than \r\nme.  Uh...that’s when I started to...that’s when we had to put \r\nthe socks on...liquid form...because the wall...we couldn’t buy \r\nsilk stockings...couldn’t buy cigarettes.  You hadda stand on \r\nline for that.  And um...she wanted to put the seam, but I \r\nwouldn’t allow that.  Putting the stocking on, the cream \r\nwas enough.  I mean it was...because you’re wearing a \r\nskirt...you’re not wearing slacks yet.  And even in the, \r\nuh...and then we started to wear overalls.  But not slacks.  \r\nNot yet.  I don’t even know when that started.  I can’t \r\nremember when it started, but it was great.  Yeah... \r\n \r\nDe Mare:  So you and Patty worked at Ford Instrument. \r\n \r\nKalbas: Yeah, and she, uh, she was able to learn everything \r\nvery quickly.  She had been a dancer...she never worked, uh... \r\nshe danced all over the world, and uh...  And so, so she went \r\nout to the shipyards.  Well, we hadda go out there, because \r\nher mother was going out there...her grandmother... She was \r\nvisiting her grandmother.  So we went out on the Sante Fe, \r\nuh, train.  Patty and I were up at the deck...upper deck... And \r\nthen...her mother was downstairs. And her mother just didn’t \r\nstay away.  It was just...very bad.  Vera was a very... But, \r\n----------------Page (28) Break----------------\r\nuh...me, I respected mothers.  Um... where the woman with me \r\nprior to Patty used to yell at her, and...have fights.  \r\nUm...and so we went into the shipyards then...and she went into \r\nthe office.  And I was on the boats. \r\n \r\nDe Mare: ...if you could just talk about the job...?  So you \r\nwent out with Patty and Patty’s mother on the train... \r\n \r\nKalbas:  Right. \r\n \r\n0037:03:14------------------------------------------------ \r\n \r\nDe Mare:  And then you got out there...and you got the job.  \r\nCan you tell me the story of working at ... she worked at the \r\noffice, and you worked on the plant... so...and let me know \r\nwhat you were working on... \r\n \r\nKalbas:  Uh, yeah...uh, I got a job at 95 cents an hour at \r\nCal Ship – uh, Shipyards out in California.  And, um...I was \r\ntold that after 4 months, I would become a journeyman at a \r\ndollar twenty, after I learned...  And the union was \r\ncollecting our dues...I had a union card, and everything.  It \r\nwas a 50 dollar initiation... I can’t remember what we were \r\npaying monthly...or weekly...  I can’t find my card.  So, uh, \r\n----------------Page (29) Break----------------\r\nuh what I was doing was I had this big big big box, and it \r\nhad all electrical equipment in there.  And I was dolling \r\nthe electrical equipment out to the electricians.  Uh, I \r\ngot to know all the parts, and ...by the serial numbers... and \r\nI would give em to em.  \r\nAnd, um...this was a week away from four months... this \r\nman came up, introduced himself... “Pat,” he said.  And I \r\nsaid, “Hello.” And he said “I’m going to be your \r\njourneyman, and you’re going to be my helper.”  I said, \r\nuh...uh...”Pat, I don’t think so.  But I have nothing against \r\nyou.  Will you just...”  He had no idea what the job was.  He \r\nhad no idea what the parts were, what he had to do, and he \r\nwas going to be my journeyman.  So I said “Just wait. I’ll \r\nbe right back.”  So I went down to the office, and I was \r\nlivid.  It takes me awhile to get angry...I mean, I don’t get \r\nangry.  And um...uh...Patty said she didn’t recognize me.  And \r\nI even remember my boss’s name...uh, Palo...Mr. Palo.  I said, \r\n“Mr. Palo, this is so-and-so.  Is this right?”  He said \r\n“Yes.”  I said “No.”   \r\nAnd my lead man – the one I really get orders from - \r\nwas in the hospital getting an appendicitis operation.  So \r\nI had to wait til he came back.  I said, uh...“I, I’m not \r\ngoing...you want me to teach Pat?  I will show him around for \r\none week, then I want...uh, my...the week is up, and I want my \r\n----------------Page (30) Break----------------\r\ndollar twenty, and I wanna become a journeyman.  I wanna \r\nstart putting the lights up in the, uh, in the bunk rooms.”  \r\nAnd he said, “No.”  I said “Yes.”  So I waited the week.  I \r\nwas teaching Pat the symbols and everything -  very, very \r\nnice...very comp-  And the week was up, and my lead man still \r\nisn’t back.  I can’t remember his name.  Um...I went to my \r\nboss again, and I, and he said “No.”  I said, “Well, I’m \r\ngoing to the Superintendent.”   \r\n \r\n00:39:58:14---------------------------------------------- \r\n \r\nAnd I knew that they could not fire you, because you \r\nhad to have availability...certificate of some kind...during \r\nthe war, you can’t get fired.  I don’t remember why.  And \r\nuh...but I was still paying my dues...and the union people \r\nwouldn’t see me.  And so, I was sitting outside the \r\nSuperintendent’s office.  He would come out, and say “Good \r\nmorning.”  I said “Good morning.”  He wouldn’t speak to me... \r\nwouldn’t, uh...nothing... just sitting there.  And I was \r\ngetting bored, you know, ‘cause I have to be active.  And \r\nmy lead man fi- came back, and I told him what was \r\nhappening.  And he couldn’t do much about it.  Finally, the \r\nSuperintendent...I said “I, I, I wanna go to Union.  I want \r\nto see the Union.”   \r\n----------------Page (31) Break----------------\r\nSo I went to the Union...I think it was Mr. Graham...I’m \r\nnot sure...and, um, I said “Look what’s happening,”  I said. \r\n“This is not true.  I was supposed to be journeyman - a \r\ndollar twenty an hour.  You’re still taking my dues.”  He \r\nsaid “We don’t want you women here.”  I says “Oh, you \r\ndon’t?”  I said “Why do you think we’re here?  I mean, are \r\nyou aware of why we’re here?”  And I really laced it into \r\nhim.  And he saw that I was...wasn’t easy to uh... And he, he \r\ngot it for me.  I said “Oh...no...not enough.  But you’re gonna \r\nget it for all the other women.  These women are wives and \r\ngirlfriends of, uh, men who are fighting...”  and they were \r\nfrom Oklahoma, Kansas City, and they couldn’t really fight \r\nfor themselves...and so we got it.  We got it, and we, we \r\nwere okay.   \r\nAnd then we left...I don’t know why, I think that...Patty \r\nand I.  We were going back and forth from California a few \r\ntimes...and, uh...the grandmother was still alive, the money \r\nwas in escarole...I don’t know what was happening.   \r\nAnd, uh...I don’t know what my next – oh yeah, I came \r\nback to New York.  And, I wanted to resume, uh, the \r\nelectrical work... Oh yeah, the electrical work was in the \r\nState rooms.  There were ten of us in one state room.  And \r\nthe boats were very cold - this is wintertime.  And the \r\nsteel...they were very cold.  So we had this big can, with a \r\n----------------Page (32) Break----------------\r\nfire going...and ten people in one state room. There were \r\ntwo- one overhead light, two bunk lights, two desk lights.  \r\nAnd it didn’t take ten people to do this.  Took one person \r\nto...to hook up the wire.  But this is what they were doing. \r\nThey were hiring people, and getting the money for the \r\nunion - they didn’t care.  It was really a farce, \r\nuh...because uh... Also the welders, when you needed a welder \r\nto put the brackets up before you could put the boxes up, \r\nthe light, uh, uh materials... uh... you had to follow their \r\nhose, and you would find them asleep.  Uh...oh yeah, it was \r\nvery bad.  Very bad.   \r\n \r\n00:43:00:20----------------------------------------------- \r\n \r\nAnd uh...the tanker, and some of the liberty boats, \r\nsplit in half in mid-ocean.  Um...because the welding was so \r\nbad.  Oh yeah, at that time it was, uh... And of course the E \r\nBonds were being sold, so you had, uh...you had the actors \r\nand actresses and politicians coming down to talk to you...  \r\nClark Gable, Helen Hayes...  And one of the gals got out, and \r\ngot a hold of Clark Gable, and of course she was pulled \r\nback.  Uh...I shook hands with Henry Wallace...the uh...  Yeah, \r\nit was, uh...it was interesting.  And the work was so easy.  \r\nAnd, uh, and I developed, uh...  Now my doctor tells me – and \r\n----------------Page (33) Break----------------\r\nI’ve had MRs - I have asbestos in my lungs.  But they’re \r\nnot bothering me...it’s not bothering me.  I mean...my \r\nbreathing...my lungs are very good.  I think that’s what’s \r\nkeeping me alive, because everything...I’ve had so many \r\noperations. \r\nDe Mare:  Can you talk a little bit about the energy around \r\nthe war?  Because you were all...you were all, uh...  So you \r\nwere all working in the factory, and people would come \r\ndown, and [do presidents] and... \r\n \r\nKalbas:  Yeah, they...yeah, we were reading the papers.  We \r\nwere listening to the radio.  And, um...the women would talk \r\nto me about the letters they got from their husbands or \r\nboyfriends.  I mean, it was a very friendly, uh...I was, I \r\nwas a very friendly...I got along pretty well.  And, uh, I \r\nthink I told you, my lead man took me up to the crow’s \r\nnest, and we found two guys up there.  And I was a little \r\nbit afraid of coming down, because it’s a moving, uh, rope \r\nladder part of the way. But it was fun going up.  And I \r\nknow what the crow’s less- nest is now.  I, I watch, uh, \r\nCash Cab, and they had that answer, and nobody could answer \r\nit.   \r\nSo, uh, so it’s...I realize then, it’s, uh...my experience \r\n- and so many jobs, and meeting so many different people - \r\n----------------Page (34) Break----------------\r\nwhich has given me the education that I didn’t have, you \r\nknow.  But I miss, I missed for the longest time...I would \r\nregret it.  There were, you know, a lot of people me told \r\nme “Stop regretting. ‘Should have’, ‘Should have’...You \r\nshouldn’t use it anymore.”  But I felt that way, because \r\nwith an education, I wanted very much to be a Phys Ed \r\nteacher, you know... And I would have made it to travel, and \r\ndo a lot of other things which I wasn’t able to do because \r\nmy salaries were always so low.  And, uh, I never thought I \r\nwould have to come into a Section 8 – it was very, very \r\nhard for me when it happened.  Uh...I was on, uh, 15\r\nth\r\n St., \r\nbetween 7\r\nth\r\n and 8\r\nth\r\n, a, a walk-up.  I had just had my hip \r\nreplaced, so it was not very easy.   \r\n \r\n00:45:57:16----------------------------------------------- \r\n \r\nAnd uh...I had met the social worker then, and he had a \r\nclient in the building, and he told me about the...uh, the \r\nempty.  So I went for it.  But, uh...I didn’t want to move \r\nfrom there.  Even though it was 3 flights up, I walk it \r\nevery day.  In fact, I felt much better than I do now \r\ntaking the elevator, and I keep saying I’m gonna walk the  \r\nstairs, but I don’t. \r\n \r\n----------------Page (35) Break----------------\r\nDe Mare:  So, um...when you...you...when you left Cal Ship, \r\nwhat...you came back from New York, and what happened...what \r\nhappened then?  You... \r\n \r\nKalbas:  Well, I, yeah, I tried to get a job as a \r\njourneyman again, but they asked me if I knew the panel \r\nboard, which I didn’t.  Nobody taught me – I didn’t.  So, \r\nI’m not a journeyman, you know.  But it was the dollar \r\ntwenty that I was looking for, and uh, I did have the \r\njourneyman card, and they were collecting more dues.  But \r\nuh, but I certainly didn’t learn it, and I didn’t lie about \r\nit. \r\nAnd I guess then I got these, uh, horrible waitress \r\njobs.  I could never be a waitress.  I couldn’t imagine \r\ncarrying these dishes on my own – I just couldn’t.  So I \r\nwas a counter person, and uh, that was horrible.  I hated \r\nit.  Until, uh, um...a f- a- what was it?  Oh, Bruce, and uh \r\n- Bruce and Bunny, these two friends of mine...this married \r\ncouple...um...he was a magician, and he knew, uh, he knew Lou \r\nTannen, this big magic, uh, place on, on 42\r\nnd\r\n St. And he got \r\nme, uh, work that I did at home...like sewing cards together \r\nand making... making little tricks.   \r\nAnd then I opened this machine shop on McDougal St.  \r\nUm...and I had a small lathe, a drill press, a band \r\n----------------Page (36) Break----------------\r\nsaw...um...Ford Machines, I can’t remember.  And these 4 kids – \r\nthese 4 boys – who were...3 boys...?  3, I think... and they knew \r\nnothing about mechanics or machines, and I came from the \r\nwar, so I knew, uh... And they put holes in my drill \r\npress...uh, uh, the band saw hadda be built low, and he sat, \r\nand cut his foot.  One cut his thumb off... I mean, it was \r\nhorrible.  I, and I’m not a teacher.  That I learned a long \r\ntime ago.  I just cannot, uh... I don’t know what it is... I \r\ncan’t tell someone how to do something.  I have to show- \r\nagain, there it is... I have to show. \r\n \r\n00:49:00:09------------------------------------------------ \r\n \r\nYeah...yeah, there it is.  I realize now.  That’s why...yeah, I \r\njust couldn’t, uh... So I could never be...you know, I could \r\nnever be a boss, or...uh...  And so, uh, I had to sell all the \r\nmachinery for 25 dollars... well, because every- every one of \r\nthe tricks I made fell through.  Because they never told me \r\nthat there was...there were two kinds of, um, of uh, soder \r\nflux – the acid, and the other.  And I bought the acid \r\nsoder, and uh...used it on wires, which came apart.  You \r\nknow, this was the, uh, the razor-blade-swallowing trick. \r\n \r\nDe Mare: You have to go on... \r\n----------------Page (37) Break----------------\r\n \r\nKalbas: I know...ha ha ha. \r\n    \r\nDe Mare:  You have to tell me this... \r\nKalbas: The, uh, it came from England, in a question mark – \r\nthis big metal box - a big metal frame question and a box.  \r\nAnd we couldn’t use that, so we made an exclamation point.  \r\nSo I went to a tin smith shop and got all the parts, and \r\nsodered... those things were fine.  I sodered...I made a box \r\nbox...a question mark with a box on the bottom, all sodered \r\ntogether.  And, the back was, the back – was it open?  No, \r\nI think it had a cover, but I can’t remember how the cover \r\nwent.  But the box was open to begin with, and what you did \r\n– and you had holes in front.  Oh, this was the electric \r\nlight bulb...the razor blade was something else, but the same \r\nsystem.  Uh, electric light bulb.   \r\nSo, there were holes, and electric lights were \r\nsodered...the wires, and the wires came through your sleeve.  \r\nAnd you hadda little box here that was flesh colored.  And \r\nat the end of that box, you had the copper, and...in the back \r\npocket, he had the other box which all this was attached \r\nto.  And that’s...that’s attached to the box at the bottom of \r\nthe question mark.  All the lights are lit, because it’s \r\nall wired.  And with this box he has in his mouth, the \r\n----------------Page (38) Break----------------\r\nmagician is able to have it in, uh, with all the bulbs \r\nsodered together, and ‘squozen’ into this box.  And then, \r\nthe lights are here too.  And as he’s on the stage, he’s \r\ntalking, the lights are on, and he pushes one through... \r\npretends to swallow it....pushes the other...pretends to \r\nswallow it, and so forth until they were all gone.  Then he \r\npushes out the- pulls out the whole string of lit lights. \r\n \r\n00:52:00:09------------------------------------------------ \r\n \r\nSo...that was with the flux.  That was acid, so the lights \r\ncame apart.  Then, I made the breakaway wand, which was the \r\nfirst plastic that came out – Catalin.  Catalin plastic.   \r\nAnd the man who I got the plastic from wanted me to \r\nwork for him, but I couldn’t stand the smell of, uh, the \r\nburning plastic.  I just couldn’t ... that was terrible.  \r\nUm...also got an offer to work on neon lights, which I turned \r\ndown.  I was afraid. I had to...and selling dickies...I was \r\nafraid to take chances.  And so, uh...what job was that?  Oh, \r\nthe breakaway wand...was black tubing Catalin, and then some \r\nwhite.  And, which I...no, I’m sorry...the white...it was a white \r\nwand.  And you got the chord from the men’s hats.  The men, \r\nuh.. I was told by...where to go...you know, so I was able to \r\nbuy this stuff.  And so you got this chord.  And with my \r\n----------------Page (39) Break----------------\r\nlathe, I was able to drill – that’s right, this was solid \r\nplastic – I drilled the holes, and on each one of them I \r\nleft little steps so that they would fit in until they \r\nbecame the right length.  And then, the black – it was \r\nblack...it was black, the wand – and the blank plugs...and the \r\nwhite plugs at the end to seal the knots.  And then the \r\nlast one had a slit, which I changed my drill press into a \r\nmilling machine, and made a slit in the – and that was on \r\nthe rope.  So, when he had the wand, which was absolutely \r\nstiff...he’d hand it to you, and it would collapse, because \r\nhe would pocket the slit one.   \r\nSo, they had to be polished, so I took ‘em up to the \r\npolishing place, and I said “Look at...this is how they fit.  \r\nThey can’t...you know, this is how they have to be.  They all \r\ncame back rounded.  Ha ha.  So that was...I mean it was just \r\nunbelievable what was happening.  I couldn’t do that \r\nanymore.  I stayed in touch with him a long time, you know, \r\nand I did little card sewing at home. \r\n \r\nDe Mare: I’m really struck by a couple things that you’ve \r\nsaid that really, um...  Can you talk more specifically about \r\nwhat it was like being a woman in that world – and \r\nparticularly about being a lesbian in that world?  You said \r\nthat they didn’t think much of women, and [that they knew \r\n----------------Page (40) Break----------------\r\nnothing].  Can you just...can you talk a little bit about \r\nthat time?  ‘Cause I don’t think people understand how...I \r\nmean, what the expectations were on you...and how you... \r\n \r\n00:54:57:09------------------------------------------------ \r\n \r\nKalbas: Well, well uh, being a lesbian being very obvious, \r\nit wasn’t easy, I mean walking down the street.  Uh...I mean, \r\nthe guys on the corner there would yell out “Dyke!” you \r\nknow, and all kind of remarks.  And, uh, but it just wasn’t \r\neasy.  Um...but I didn’t pay too much attention to it, you \r\nknow I uh... And then, um, then I had an incident when, uh, \r\nuh...there were open bathrooms at the L trains.  I think I \r\ntold you this?  Well, I’m wearing a man’s shirt, and a \r\nskirt, and uh...I paid my nickel and went through the \r\nturnstile.  And I had to go the ladies room...I went to the \r\nladies room...and a guy came outta the change booth after me \r\nand said “Sonny, you can’t go in there!”  So, I really \r\nlooked kinda obvious, I guess - you know, I didn’t think so \r\nat the time.  So, uh, uh, it wasn’t hard- it wasn’t easy at \r\nall...it was very, it was very hard for me at the flower \r\nplace, when uh...I could never go in the bathroom with \r\nanybody else, you know.  And if anybody else was in there, \r\nI, I was very nervous, and very uh...  \r\n----------------Page (41) Break----------------\r\nIt’s quite different, you know, it uh...  I was a \r\nscardey.  I was really, uh... So, I guess I didn’t pay too \r\nmuch attention to, uh, being mistreated as a woman, you \r\nknow?  There was other problems.  Uh...but I guess that’s \r\nwhat it was.  But we, but when I met my college friends, \r\nyou know...we talked, and uh...  And it was much, much easier \r\nthen, you know...  They were gay, even though they didn’t \r\nlook it.  Uh...and I, you know... I would sit and wait for them \r\nat Hunter.  I went to Hunter... I went to Brooklyn College.  \r\nThey, uh... I even went to a class...uh, opera...she was studying \r\nopera.  And I had to book out, and it was almost becoming \r\nmy turn - thank God the bell rang.  Yeah, I was in tight. \r\n \r\nDe Mare: I think you were very brave...in many ways. \r\n \r\nKalbas:  But, uh...but I knew that we were ... we were- weren’t \r\ntreated equal...you know, I knew as far as the pay went, \r\nand everything.  Uh, but there- there’s nothing we could do \r\nabout it.  I couldn’t... at that time.  Uh...and I didn’t know \r\nwho – I wasn’t an activist then – I didn’t know who...where \r\nto go, and uh... I was afraid to go to meetings, you know, \r\nand do any of that stuff...to be out in the open.  So that’s \r\nwhy it was hard for me to...  \r\n----------------Page (42) Break----------------\r\nOh, yeah, the machine shop... I used to eat across at \r\nJoe’s, and uh, Millie, his wife, was the waitress.  And \r\nthey had a boy who was 16 years old.  Um...and after 16 \r\nyears, she’s pregnant, so they asked me if I would be the \r\nwaitress.  I said “Meee?”   \r\n00:58:05:12----------------------------------------------- \r\n \r\nI mean, and I knew everybody there...eating... I mean, \r\nthere was, uh, these were all kids then.  Uh...Steve McQueen, \r\nuh, um...Ha- Harry Belafonte...they, they were all kids.  Uh... \r\nuh... Paccino, I mean, the whole bunch of them were there.  \r\nUh...and uh...Liz is uh... Liz Maytag and her boyfriend, who \r\nlooked like a bum...and after a while...after about 5 or 6 \r\nyears, I would get calls from either her lawyer or \r\nsomething, her family...wanted me to tell about Mike, you \r\nknow...what... I was friends of theirs.  I mean, they were \r\nhelp- they started to help me.  They knew I was afraid as a \r\nwaitr- a waitress at the beginning, so they would do all \r\nkinds of things and help me...and stay and help me clean up \r\nand everything – they were great!  And that’s how I got \r\nused to it.  9 and a half years I stayed there.  I worked \r\nbreakfast, lunch, and dinner...I was, uh... That’s how I \r\nfinally learned to cook.  Joe was upstairs sleeping, and \r\nsomebody came in and they wanted liver dinner, you know.  \r\n----------------Page (43) Break----------------\r\n“Okay...I...I’ll make the liver.” And I put the liver in the \r\npan...I put the onions and everything...and I had this nice big \r\npiece of liver, and ... it’s down to nothing!  It shrunk!  \r\nAnd there’s a membrane on the outside, and you have to \r\nslice that.  Who knew?  That was my...but I became a good \r\ncook, because I was cooked up at Bonnie’s for 3 and a half \r\nyears...I mean, even there I was frightened, because I had \r\nnever cooked, but uh, Angelo, who was at 17 Barrow... I don’t \r\nknow if... which is One by Land, One by Sea now.  Um....and \r\nthat was a great restaurant.  And, uh, Angelo taught me a \r\nlot of stuff.  And cookbooks... and I finally learned how to \r\n... how to cook.  I even made my own hollaindaise sauce.  And \r\nuh...Angelo showed me how you, you cook eggs. You just em...you \r\njust cook em...there like not cooked, but you take a...you take \r\na strainer, and you put ‘em in a long, long pan with ice \r\ncubes and iced water.  You put ‘em in the refrigerator, and \r\nin the morning you have your eggs ready to go for Eggs \r\nBenedict...Arnold.  There are so many of those. \r\n \r\nDe Mare:  Now when you were here last time, you told me a \r\ncouple of stories I’d like for you to tell again about...I \r\nwant...I’d like you to tell the story of the men putting the \r\nbolt in your tool box?  The man who put the bolt through \r\nyour toolbox?  I’d like you talk about the- and you also \r\n----------------Page (44) Break----------------\r\nsaid something that was interesting where you said if you’d \r\nbe cutting the wires, I’d put a little juice through?  So \r\ncan you tell those stories again, can you, can you... \r\n \r\n01:00:57:04------------------------------------------------ \r\n \r\nKalbas:  Well, in the shipyards...when we were doing the \r\nwire, when we had to splice the wire, um...they would put the \r\njuice on from the panel box.  But, luckily, they would know \r\njust know how much to put on, so we would get a shock.  And \r\nyou’d come out, and you know...nobody would admit it, you \r\nknow, they would, uh... But they weren’t treated, uh...but \r\nthere was nothing you could do, because you didn’t know who \r\nwas doing it.  And, uh, you ... you couldn’t defend yourself.   \r\nI have this...because I took it... Uh...when I went to the \r\nbathroom, these guys at Lafayette machine shop - uh this \r\nwas a brand new, uh, tool box - and they put a bolt through \r\nit, through the top of the box.   I came out, and I saw \r\nthis bolt, and I, I... “What the hell is this?”  but then I \r\nlooked at it carefully, and saw that they did...they took a \r\nbolt, and sliced it on the bias, and uh, glued it on.  So... \r\nso I laughed with them...and then, then everything was fine.  \r\nBut prior to that, they put a little bluing on the handles \r\nof my lathes, and when I came out, I got all blue...and \r\n----------------Page (45) Break----------------\r\nthat’s not easy to take off – that bluing that you put on \r\nsilver – on, uh, metal, to do the drawings. \r\n \r\nDe Mare: Do you think that kind of thing happened a lot? \r\n \r\nKalbas:  Oh yes...I’m sure.  Oh yes...yeah...some women were \r\nreally abused, and uh...  I mean, I’m not, uh... I was just \r\ntold.  I didn’t see any... any of it.  But, uh \r\n \r\nDe Mare:  Why do you think it was?  Do you think it was...? \r\nWhat do... why do you think...? \r\n \r\nKalbas:  Well, these men didn’t want me there, they said at \r\nthe beginning.  I said, “Well, what do you think I’m doing \r\nhere?”  And not only that...and I didn’t know enough to say \r\n“Why are you here?”  You know, I, I knew...you know, I knew \r\nthat if they weren’t in the army, they couldn’t be, and I \r\nwouldn’t have said anything.  But, uh...but you know, I \r\ndidn’t know how to fight back.  They uh... How do you fight \r\nback with something like that?  And uh...I mean, there’s a \r\nwar going on, you know?  You’re doing what you can do, and \r\nunfortunately, it was the best paying jobs that I had.  You \r\nknow, that, uh, that didn’t make sense, but it was. \r\n \r\n----------------Page (46) Break----------------\r\nDe Mare:  Do you think...?  Now, after the war...were you, were \r\nyou working at the... when the war ended? Did you get notice \r\nfrom someone when the war was over?  Were you actually \r\nbetween jobs at that point? Can you tell me what happened? \r\n \r\nKalbas:  Well, yes, I couldn’t get a job in defense plants \r\nanymore.  I tried the electrical, and I realized that you \r\ncouldn’t.  And the men were coming back, and I realize they \r\nhad to get back their jobs.  And that’s when I guess I got \r\nthe waitress jobs, you know, the counter jobs.  Yeah, I had \r\na few of those, which were horrible, because, uh, one man \r\nwanted me to open up my shirt.  At that time, I still had \r\nmy breasts...wanted me to open up my shirt and expose myself.  \r\nYou know, I’m a, I’m a counter girl, and uh, they wanted \r\nme- you know, to cater to the men.  Bullshit. You know...  \r\nEven, even if I weren’t gay, I wouldn’t have done that.  It \r\nwasn’t me. \r\n \r\n01:04:18:09------------------------------------------------ \r\n \r\nDe Mare:  Now, how did you get involved with the U.N.?  Can \r\nyou tell that story? \r\n   \r\n----------------Page (47) Break----------------\r\nKalbas:  Yeah, there was a man who was eating at Joe’s, and \r\nuh...and that’s where I met him...and that, uh, when I had the \r\nmachine shop, and it was getting over with, so he, he got \r\nme the job. \r\n \r\nDe Mare:  And what did you do there? \r\n \r\nKalbas:  Uh, yeah...I, I was, uh, escorting, uh, school kids \r\ninto different rooms, and then they wanted me to uh...and so \r\nI became an escort, really.  And then delivering messages \r\nto the assemblies.  And I was able to, uh, to stay there \r\nand listen.  And uh...they did it in English.  They did it in \r\nRussian.  And they did it in French.  And, uh, I think I \r\ntold you, if they left out “and” in one of the languages, \r\nthey had to do it all over again.  It was a little boring, \r\nI mean... Instead of getting to the meat of the, uh, the...what \r\nwas happening, you know...? \r\n \r\nDe Mare:  Did it feel exciting to be with/...how did it feel \r\nto be around... \r\n  \r\nKalbas: /Oh yes, it was very- \r\n \r\n----------------Page (48) Break----------------\r\nDe Mare:  What was going on there?  Like, what was actually \r\nbeing decided at that point? \r\n \r\nKalbas:  The Jewish problem, at that time, mostly.  And a \r\nfew other of the... You know, I haven’t been able to get \r\nmyself to the UN here?  And I wanted so much to see it.  I \r\njust haven’t been able to do it.  I don’t know... it, uh... \r\nwould bring back... I don’t know... That was a wonderful \r\nexperience, and I just wasn’t experienced enough to make it \r\na better job.  That’s what bothered me.  And having, you \r\nknow, Russian abil- Russian, you know, knowledge, and...  But \r\nnot enough.  You know, I couldn’t read. \r\n \r\nDe Mare:  How do you think, um... How do you think life is \r\ndifferent for women now, you know, in the, in, in the \r\nworking world? \r\n \r\nKalbas:  Oh, I think it’s much easier.  And I think they’re \r\nbeing recognized for their work more.  And, uh, it’s still \r\nnot enough, but I still think...I still know, from reading, \r\nthat they are getting a little more money.  Um...um... and \r\ndifferent kinds of positions that they can go for and get, \r\nwhich at one time was absolutely impossible.  Um...and of \r\n----------------Page (49) Break----------------\r\ncourse, the men are a little different too.  Some of them \r\nare staying home, and uh, which is good. \r\n \r\nDe Mare:  What d- when you look back at that time, when you \r\nwere, you know, first out in California and... \r\n \r\n01:07:00:16------------------------------------------------ \r\n...what, what is your...what is your most vivid memory from \r\nthat time?  Do you have a story or anything?  Something \r\nthat you really remember – doesn’t even have to be about \r\nworking, but I’m just curious as to what you... \r\n \r\nKalbas: Oh, just that Patty and I met this woman who was, \r\nuh, giving us rides to different places.  And, uh, and she \r\nalso was taking things home from the, from the shipyards, \r\nand she was building a house – a boat house for her father.  \r\nShe had all parts.  I mean, the uh...of course, she was going \r\nto use wood, but she had all the lights, the fixtures, \r\neverything.  I was afraid to be with her.  I...it was scary. \r\nBut it was fun, you know.  Taking the uh...the fencing \r\nlessons...being in the studio.  But then, I came back, and I \r\ncontinued with it, with uh, George Santelli, for a while, \r\nand uh...til.,..til the fire, I guess, and... \r\n----------------Page (50) Break----------------\r\n I think in ways it was much easier, even though \r\nthere wasn’t much money, or... um...  I don’t think we should \r\nhave taken away the factories as much as we did.  That is, \r\nuh... that is terrible.  That was a terrible thing.  \r\nAbsolutely, I mean...uh...because there was work.  You know, \r\nthere was, uh...  I mean...  Building was one thing, but, uh,  \r\nthe making of things... I mean, why can’t we still have it \r\nhere?  I mean, that’s, uh...  I don’t understa- you see, I \r\ndon’t understand business that much, and I don’t eat- read \r\nthe business reports. I don’t read some of the things maybe \r\nI should.  I just don’t want to anymore.  I mean, it uh...  I \r\ndon’t want to make myself sad.   \r\n \r\nDe Mare:  How do you think it... You know, you said a couple \r\ntimes that, like, the work that you did in the factories \r\nwas the first time you ever did work that you really liked.  \r\nAnd you obviously liked hard work, and you obviously liked \r\nto make things.  Um...do you think that... do you think, in a \r\nway, that the war allowed you to... like how did you as a \r\nperson... \r\n \r\nKalbas:  Well, I learned much more, mechanically.  And, \r\nuh...and I learned to stand up for myself, especially with \r\nthat union thing.  I think that did a lot for me.  Um...and \r\n----------------Page (51) Break----------------\r\nPatty being 10 years older than me... you know, she even \r\ntaught me how to walk.  I was walking like a truck driver, \r\nshe told me... and how to order food and stuff.  But I’m sort \r\nof getting back...uh, I don’t want to do those things \r\nanymore.  Ha ha.   \r\n \r\n01:09:50:04------------------------------------------------ \r\n \r\nDe Mare:  I think you’re wanting to do what you want... \r\n \r\nKalbas: And yet, I don’t want people to take care of me.  \r\nYou know, I um... And uh...I haven’t been thinking about it \r\nuntil lately, uh...I’m 91...how much longer, I don’t know... But \r\nif it goes on longer, what condition will I be in? You \r\nknow...will I be able to take care of myself?  And the \r\npeople, the help that you get, is just...I mean, I could NOT \r\naccept the help that they send me.  When I was home \r\nrecouperating the first day, it was just terrible.  I \r\ndecided to just do things by myself – which I did.  And \r\nmaybe that – you know, that didn’t help me much, because I \r\noverdid, I think.  I mean, like the second day, I was \r\ngetting into the shower... uh, with the bench, of course.  I \r\nhad the, uh... \r\n \r\n----------------Page (52) Break----------------\r\nDe Mare: I think it’s good to be feisty. \r\n \r\nKalbas: Well, uh...ha ha. Yeah, but, you know... I’m beginning \r\nto wonder... I should slow down a little bit, and yet I \r\ncan’t. \r\n  \r\nDe Mare: So, what was your favorite job you ever did? \r\n \r\nKalbas: Hmmm...I think the...I think the cooking up at \r\nuh...until, until the kids refused to, uh, uh, take care of \r\nthe food and the...you know, alter the food, change the food \r\naround in the walk-in, and in the refrigerators.  I was \r\nworried about poisoning anybody.  And, uh...yeah, that was... \r\nthat was kind of fun. \r\n \r\nDe Mare:  Do you think that...uh, you, you say a couple times \r\nthat the other women who you worked with in the – I’m \r\njumping around a little bit - but you that something– that \r\nthe wom- the other women that you worked in the factories \r\nwith were wives and um...they were from the Midwest, and do \r\nyou...do you have an idea... I mean, we talked a little bit \r\nabout this last time, but I don’t think that you had a- I \r\ndon’t think that it clicked in with you...  I was trying to \r\nunderstand, you know, being a young woman on your own back \r\n----------------Page (53) Break----------------\r\nthen...what life was open to you.  When you were younger, how \r\nyou felt...what you felt you could do... and what you thought \r\nyou couldn’t do. \r\n \r\nKalbas: Well, I didn’t think I could do very much, because \r\nI didn’t have the education.  And so, I was afraid to take \r\nchances, uh... a neon job, I passed up – neon lights.  And, \r\nyou know, that would have been inetersting.  Um...the selling \r\nof the dickies, which are coming back.  I mean, not that I \r\nwould wear one today, but they’re coming back.  Um...not \r\nhaving the education bothered me a lot.  Very much.  And so \r\nit held me back.  I didn’t know how to, uh, forge ahead.  \r\nAnd there was nobody around, and I wouldn’t ask for help.  \r\nYou know... \r\n \r\n01:13:00:00------------------------------------------------ \r\n \r\nDe Mare: I mean, it’s interesting, because... So you - I’m \r\njust trying to get it straight in my own head - so you kind \r\nof... you wanted to be a...you thought about being a phys ed \r\ninstructor.  Your father wanted you to be a nurse, but you \r\nwere not interested in that. \r\n \r\nKalbas: No. \r\n----------------Page (54) Break----------------\r\n \r\nDe Mare: Um... you went back and you did get your high school \r\ndiploma a few years later.  Um...did you have a dream of \r\nsomething that you really wanted to do, or was it more...? \r\n \r\nKalbas:  Yeah, I wanted to be a Phys Ed instructor. \r\n \r\nDe Mare: That was the dream...that was the dream... \r\n \r\nKalbas:  Yeah...because I knew I would be good.  I was very \r\nathletic... I played all kinds of games.  The uh...um...yup. \r\n \r\nDe Mare: I want you to show me your silver.  I wanna...um...I \r\nactually wanna...I would love for you to show me on camera, \r\nyour stuff. \r\n \r\nKalbas: I don’t have too many pieces. \r\n \r\nDe Mare: That’s okay. \r\n \r\nKalbas: This is my favorite now.  Ha ha.   \r\n \r\nDe Mare:  So can you tell me how you made that? \r\n \r\n----------------Page (55) Break----------------\r\nKalbas:  Yeah, the clear blue.  I just, uh, got some dowels \r\nand cut ‘em, and got this piece of wood...cut it in \r\nshape...painted...and um... Got on the internet and got a picture \r\nof the spider.  Went to the copy place and reduced it, and \r\ngot some pictures of bugs, and cut them out...uh...outta paper, \r\nand then glued them to the silver, and cut it out – the \r\nsilver.  And uh...then I put the rubber band underneath with \r\nthe clips, that I made.  And...he’s moving.  Ha ha.  It’s \r\ncrazy.  Oh, I made a slot in there, so the rubber band \r\nstays in place.  Why I made this, I don’t know.  Ha, I \r\nmean...still don’t know. And I polish it every once in a \r\nwhile, ‘cause it gets oxidized. \r\n \r\n01:15:58:09--------------------------------------------- \r\n \r\nDe Mare: Do you want to show me what you’re working on \r\nright now? \r\n \r\nKalbas: Oh that thing?  That Santa Clause? No. \r\n \r\nDe Mare: Whatever you want to share...whatever you want to \r\nshow... \r\n \r\n----------------Page (56) Break----------------\r\nKalbas: No, what I’m working on is...where’d I put ‘em...?  \r\nWell, I’m gonna cut these out.  I’m gonna cut a fish outta \r\nthis.  I put things away, and I don’t know where I put ‘em. \r\nNo...that’s it. \r\n \r\nDe Mare:  So, what is this?  Is this actually...? What are \r\nthese? \r\n \r\nKalbas:  This is a piece of silver...and these are cut outta \r\npaper.  I have a whole bunch of animals cut out that I’m \r\ngoing to put and cut it out, cut it out.  This is the \r\nelephant...but you can’t see it.  Maybe it’s in the desk \r\ndrawer.  Nope...I’m really not working on anything right now.    \r\n \r\nDe Mare: Can you show me your...the little...the fish? \r\n \r\nKalbas: Except I have the, uh... Oh, Yeah.  That’s...I don’t \r\nknow whether you should ta- that’s the uh...the logo on the \r\nSage, uh...Newsletter.  It’s the only pin I have left. \r\n \r\nDe Mare:  I think it’s wonderful. \r\n \r\nKalbas: Yeah, it came out very good. \r\n \r\n----------------Page (57) Break----------------\r\nDe Mare: I think it’s beautiful. \r\n \r\nKalbas: Yeah, you see what you have to do?  You have to \r\ndrill a hole, and uh, then you cut it out from the hole.  \r\nLook at that! Ha ha.  It’s fun. \r\n \r\nDe Mare: Can you show me the, the paint- the framed \r\npicture? \r\n \r\nKalbas: Oh...yeah. \r\n \r\n01:19:00:02------------------------------------------------ \r\n \r\nDe Mare: So can you tell me the story here? \r\n \r\nKalbas: Um, yeah, uh...Jeannie, uh, brought me to the \r\nrestaurant, Pearl’s Oyster Bar.  And, uh...and this woman in \r\nthe white chef’s suit, would come out and look at me...go \r\nback...look at me...and I didn’t recognize her.  And then when \r\nwe sat down to eat, she came over and told me that she used \r\nto wash dishes for me at Bonnie’s when I was a chef there.  \r\nAnd, uh, then I, then I realized who it was.  And, uh, \r\nevery time I go there I get free oysters and free wine, and \r\n----------------Page (58) Break----------------\r\nso I decided I, I would say thank you by doing this for \r\nher.  And I had a lot of fun doing it.   \r\n \r\nDe Mare: Can you tell me what each of the things are? \r\n \r\nKalbas:  Well, there’s a fish with orange eye.  There’s a \r\nlobster with turquoise eyes.  And there’s an oyster, which, \r\nI got the shell from her...and it’s very thin silver, so I \r\nwas able to mold it...and then cut out a piece of silver to \r\nlook like the meat in the oyster...and then put the pearl in \r\nthe center.  And then painted the, uh, board, uh, the \r\nocean, and I thought it would look good with a little bit \r\nof a shadow box, so... \r\n \r\nDe Mare: It’s beautiful. \r\n \r\nKalbas:  Yeah, and, oh yeah...when I drew the lines in - I \r\nscratched the lines in – um...if you didn’t, if I didn’t \r\noxidize- if I didn’t, uh, spray it with a fixative, it \r\nwould get very black...from the air.  And so, you can’t \r\npolish these things, uh...  So, I, I put the fixative on, and \r\nnow you’ll be able to see the light and dark of the \r\nmarks...which is important, otherwise you wouldn’t uh... \r\n \r\n----------------Page (59) Break----------------\r\nDe Mare: Can you show me...can you show me the tool box?  And \r\ncan you tell me, you know, the story of it...how long you’ve \r\nhad it? \r\n \r\nKalbas:  At Ford Instrument, is when they demanded it. \r\nYeah, Ford In- no, I had it at the Lafayette.  I don’t know \r\nwhen I bought it...I can’t remember.  But uh, when I lived \r\non, uh, Jones Street, I made friends with a carpenter.  So \r\nI had these things built around it, but he wouldn’t build \r\nthe way I wanted him to...the wood in between...so I can take \r\nthese boxes out, so... I have fun every time I want a box. \r\n \r\n01:22:00:00------------------------------------------------ \r\n \r\nDe Mare:  So what do you actually have in the tool box \r\nhere? \r\n \r\nKalbas: In here? \r\n \r\nDe Mare: In the, in the original one? \r\n \r\nKalbas:  In this...? Oh now I have pieces of silver and wire \r\nand more tools... all kinds of tools.  Some drill bits,  \r\npushes...all kinds. \r\n----------------Page (60) Break----------------\r\n \r\nDe Mare: So how long has that been following you around the \r\nworld?  Let me think about it...Ford’s Intstruments would \r\nhave been 19- \r\n \r\nKalbas: No, this is, this is Lafayette – that small shop \r\nbefore I went to Ford.  So, is it when I got back, from \r\nuh...no, before I went to California.  I guess it had to be \r\n40... \r\nDe Mare: 69 years. \r\n \r\nKalbas: Ay...that hurts when you say it like that.  And then \r\nI have pieces of – I didn’t make this – just pieces of \r\njewelry lying around. \r\n \r\nDe Mare: Did you enjoy it, when you used to make...you didn’t \r\ntalk about... \r\n \r\nKalbas: Oh yeah, that...that’s one of my favorite jobs too.  \r\nI also worked for Paul Lobel, an art smith on West 4\r\nth\r\n St. \r\nin the village.  I was doing part-time work for them and \r\nworked at home on making things... \r\n \r\nDe Mare: What kind of things did you make? \r\n----------------Page (61) Break----------------\r\n \r\nKalbas: Uh...hoop earrings...uh... At Lobel’s, I just cut things \r\nout.  He wouldn’t let me soder or anything.  He had \r\nsomebody doing that.  I did polishing.  Where are my...I \r\ncan’t...hmm...oh, I think I know.  No...  That’s bad, you know?  \r\nNow, when I put things away, I don’t know where they are.  \r\nThat’s very bad.  Don’t let it happen to you gals. Oh, this \r\nis a flexible shaft.  Oh, it’s heavy. \r\n \r\nDe Mare: What do you use it for? \r\n \r\nKalbas: Um, this you use for drilling, polishing, \r\num...burring... You use it for everything.  And it has a foot, \r\nuh... a foot pedal, which I don’t think is hooked up right \r\nnow. \r\n \r\n01:25:00:00------------------------------------------------ \r\n \r\nNo... \r\n \r\nDe Mare:  Is that the only piece of equipment, like \r\nelectrical equipment, you have right now? \r\n \r\nKalbas: No...no, no, no... \r\n----------------Page (62) Break----------------\r\n \r\nDe Mare: What else do you use on a regular basis? \r\n \r\nKalbas: Well, I use a lot of this.  This is what I cut the \r\nthings out with.  But not having a jeweler’s workbench...what \r\nI did... I cut the- I put this up here...oh...facing this way.... \r\nAnd that’s where I do my cutting.  You don’t want me to \r\nhook it up? \r\n \r\nDe Mare: No that’s okay, I can see what you’re doing.  So \r\nyou do this completely by hand. \r\n \r\nKalbas:  Yeah, and then you just uh.  It’s gonna move...you \r\ncan’t uh...you have to really hook it up... And you cut it that  \r\nWay.  That’s’s how I cut this pin out.  That, I like doing \r\nvery much.  And then you have wax that you wax this with.  \r\nAnd then I...  \r\nI have other motives.  I have...etching tool and...I ha- \r\ndo have a book of some of the work I did.  My, uh, my \r\nfriends in Holland are, are sailors.  You know, they have \r\ntheir own boat, and everything.  So I made this for them, \r\nwhich is on a piece of um...uh...you know what they use for \r\nceilings...?  That, uh, tin...?  That’s what the background is.  \r\n----------------Page (63) Break----------------\r\nAnd then the silver boats – different sh- uh, uh sailboats \r\n- with the nautical chord around it.  \r\n \r\nDe Mare: Show me what else you’ve got there? \r\n \r\nKalbas: It’s nothing... All my animals.  My kangaroo.  Oh \r\nthat’s...that one I made for the doctor, who’s also a sailor.  \r\n \r\n01:27:56:16------------------------------------------------ \r\n \r\n \r\nAnd I made this sign for a friend of mine, in South \r\nHampton.  Oh, the one, the uh, the one who does the \r\ncollage.  And that’s my strong lady... with red hair – \r\ncopper.  Those are some of my animals. \r\n \r\nDe Mare: They’re wonderful, Jerre. \r\n \r\nKalbas: Yeah, you see, I can’t solder anymore.  I soldered \r\nthe water run, and the stick pins.  And I can’t do it.  And \r\nthat’s a picture where they took...in the jewelry class.  I \r\nthink I have one of the t- ... and a bracelet I made...some \r\nearrings... That I can still make...but I don’t like to, \r\nbecause I can’t solder the... I made a spoon for a baby.  Oh, \r\n----------------Page (64) Break----------------\r\nyeah...this is my favorite.  I dropped a rubber band on the \r\nfloor once, and it took that shape.  So I had the rubber \r\nband, and then I put a paper clip on it, and I put it on an \r\nelastic and wore it around.  And I was able to pull that \r\noff.  I was going to manufacture them, you know, and sell \r\nthem on secretary day, but...  See, I don’t, I don’t want to \r\nmake money on this.  I just give it away.  Oh yeah, there, \r\nthere it is, on the elastic. \r\n \r\nDe Mare:  That’s really wonderful, Jerre. \r\n \r\nKalbas:  And then, I used to make buttons.  Um...well, this \r\nsomebody brought back from uh...Israel, and they wanted me to \r\nbox it for them.  So, I did that.  But I used to make \r\nbuttons by doing that... by putting... which it has to be \r\nsoldered.  Oh, that’s what I can’t do for you, because I \r\ndon’t have the long...oh yeah, that’s my class of exercise \r\npeople.  Oh and that’s my [clawfish].  And her husband was \r\na photographer, so she decided to do this.  And my horse... \r\nAlligators were wonderful.  They were wonderful.  They were \r\nall pins.  That’s...the alligator.   \r\n \r\n01:31:00:00------------------------------------------------ \r\n \r\n----------------Page (65) Break----------------\r\nThat’s it.  Oh...this is the paper mache.  That’s \r\nChristmas decorations I used to make ... and then, that’s \r\nalso made out of paper mache.  See, it’s so much nicer than \r\nthat stuff.  Isn’t that nice?  Better. \r\n \r\nDe Mare: Very sweet. \r\n \r\nKalbas:  I like that... I like sitting down and painting too.  \r\nI may start doing that again. \r\n Yeah, with all the work that I did, in the factorie- \r\nthe defense plants and the shipyards, I feel that I am \r\nRosie the Riveter.  And, uh...I think that we should be put \r\nout in public more, and, uh, really recognized...not just as, \r\nuh, defense workers, but as people who were...were making \r\nthe, uh, doing the livelihood for our families and our \r\num...while our, the husbands, and the, uh, boyfriends were \r\naway.  Uh, I mean, I didn’t have a husband or a boyfriend, \r\nbut uh, I still feel that it should be recognized, very \r\nmuch so.  And it isn’t.  They keep, they keep ignoring it – \r\neven that, uh, Tom Brokaw and, uh, that show.  I was \r\nvery...I, I really want- I didn’t know how to call.  I wanted \r\nto call that station and tell ‘em right then and there.  I \r\nreally did, I was, I was angry, because it should be \r\nrecognized and brought out.  We weren’t just playing there.  \r\n----------------Page (66) Break----------------\r\nThe guys were sleeping.  We were working.  We really were.  \r\nThe women took their jobs seriously. \r\n \r\nDe Mare:  I think it’s so interesting how you talk about \r\nbeing so shy, and yet you were the one, of all those shy \r\nwomen, who fought for what was right, and I think that’s \r\nextraordinary. \r\n \r\nKalbas: Well, that’s only because I was very angry.  I \r\nmean, someone has told me that I was going to get more \r\nmoney, and then, uh – and I was doing a good job – and not \r\nbeing paid for it, yeah I got very angry.  Um...I, I couldn’t \r\nunderstand...you know, it was beyond me.  I mean, I just knew \r\nthat I...I didn’t even think twice, so I must have been very \r\nangry.  I don’t, uh, I don’t really fight that much.  Uh, \r\nhad I fought more, you know... \r\n----------------Page (67) Break----------------\r\n"}}]