[{"type":"add","id":"lucretia-jane-tucker","fields":{"identifier":"ROSIE_INTERVIEW_009","url":"/interviews/lucretia-jane-tucker","label":"Lucretia Jane Tucker","description":"Jane started working at age 14 at a 5 and 10-cent store. When war broke out, she moved to Savannah for a defense job.  ","image":"/images/ROSIE_INTERVIEW_009-interview-thumbnail.jpg","content":" 1 \r\n \r\n \r\nLucretia Jane Tucker \r\n \r\n \r\nThe Real Rosie the Riveter Project \r\nInterview 9 \r\n \r\n \r\n \r\nInterview Conducted by  \r\nAnne de Mare  \r\nJune 28, 2010 \r\nNashville, Tennessee  \r\n \r\n \r\n \r\nFor The \r\nFor the Tamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n----------------Page (0) Break----------------\r\n 2 \r\nInterview: Lucretia Jane Tucker \r\nInterviewers: Anne de Mare  \r\nDate: June 28, 2010 \r\nPlace: Nashville, Tennessee \r\n \r\nDe Mare: So to begin, why don’t you introduce yourself.  \r\nTell me your name.  Tell me where you were born and just \r\ntell me what you did in the Second World War. \r\n \r\nTucker: Jane Tucker and I was born in Lineville, Alabama.  \r\nAnd during the war-- Word War II, I was a welder in a \r\nshipbuilding corporation.  And we built liberty ships that \r\nwere cargo ships that carried supplies and men.  So that’s \r\nwhat I did. \r\n \r\nDe Mare:  Can you tell me a little bit about your \r\nchildhood.  Where you grew up and what your parents did and \r\nwhat the family life was like as a small girl?  \r\n \r\nTucker: I grew up in the Depression.  I remember it \r\nclearly. I was born in 1927 and my mother and father were \r\ndivorced when I was two so we went back to my hometown, \r\nback to Lineville to live.  It was a population of about a \r\nthousand people.  We were like everyone else.  My mother \r\n----------------Page (1) Break----------------\r\n 3 \r\nworked and she had a history.  She played piano at the \r\nsilent movie (cough) then she had a job as what we called a \r\nSwitchboard Operator.  She worked for the telephone \r\ncompany.  She made 25 dollars a month.  So we struggled, of \r\ncourse for financial reason but I did not know that as a \r\nchild.  I think one thing that I gained for that is a \r\nstrong sense, well I guess that’s one reason I have such a \r\nstrong sense of independence because I can remember \r\nthinking when I can make my own money I will never ask \r\nanybody for anything else.  Because it was always such a \r\nproblem for my mother to give us what we needed. \r\n \r\n01:53:00--------------------------------------------------- \r\n \r\nDe Mare:  How many children were in the family? \r\n \r\nTucker:  Two.  I have an older sister.  She was a Rosie the \r\nRiveter.  And my mother.  We went to Savannah together and \r\nwe went to work together on the same day as the Eastern \r\nShipyards.  We all three were Rosies.  \r\n \r\nDe Mare: Do you remember how you found out about the job? \r\n \r\n----------------Page (2) Break----------------\r\n 4 \r\nTucker:  Yes I do. We didn’t know anything about the \r\nposters and the National campaign to employ women but my \r\nmother because she was so desperate for money. She never \r\npaid all the grocery bill.  We shopped at a grocery store, \r\nnot a food store nor the clothing store.  We just paid some \r\nevery month. But she had cousin who lived in Savannah and \r\nshe called and told my mother that if you come to Savannah \r\nall three of you can get jobs and work and make good money. \r\nWhen I was 14, I had job at a 5 and 10-cent store. The \r\ndollar store. I made 60 cents for half a day when I would \r\ngo after school and when I worked all day on Saturday, I \r\nwould make one dollar. And when I was interviewed for the \r\njob as a welder, they said you would be in training for 6 \r\nweeks and you will be making $1.20 an hour to start with. \r\nWow.  I thought I’ll have lots of money. And actually we \r\nwere motivated to go because of the money- for the need of \r\nthe money.  My mother was motivated.  I think of the \r\ncourage she had to go to a city and she didn’t know what \r\nshe was getting into I’m sure.  She didn’t know we were \r\ngoing to be surrounded by armed forces, air forces and navy \r\nand forex in the army.  It took her a lot of courage to do \r\nthat but that was her determination.  And she paid \r\neverything that she owed.  She told people that she owed \r\nmoney- this was characteristic of that day.  It’s no longer \r\n----------------Page (3) Break----------------\r\n 5 \r\ntrue, I find.  She told them that I’m going to leave and go \r\nget a job, in a war, in a defense plant and I will pay you \r\nwhat I owe you.  Every month I will send you some money.  \r\nAnd she did. One of the men, the man you owned the clothing \r\nstore said, “Mrs. Syris” That’s what all they called her, \r\n“You don’t need to pay me anything else.  Just forget that \r\nbecause you’ve paid me enough.”  But she didn’t she paid \r\nhim.  So that was part of the way I grew up. \r\n \r\n4:39:11--------------------------------------------------- \r\n \r\nDe Mare: Was it difficult? Can you talk a little bit about \r\nyour mother being a single mother at that time?  \r\n \r\nTucker:  Oh it was difficult.  She was totally devastated \r\nbecause nobody in her family had ever been divorced. Nobody \r\nin the hometown was divorced. She was totally just undone. \r\nAnd of course it came across in her raising of us. I mean \r\nshe was really unhappy.  \r\n \r\nDe Mare:  And do you think that when you went Savannah and \r\ngot the jobs and you were earning as money as you were \r\nearning.  Can you talk a little bit about what it was like \r\nto feel that independence and see your mother feel that \r\n----------------Page (4) Break----------------\r\n 6 \r\nindependence from the burdens- the financial burdens? Can \r\nyou talk a little about that?  \r\n \r\nTucker: Yes I can. It was a wonderful feeling to know- and \r\nwe help, we helped pay.  We gave money to help pay was she \r\nowed. And then of course we helped pay for our living \r\nexpenses.  We all lived together in a new little duplex \r\nthat they had built for defense workers.  So we all helped.  \r\nAnd there was a get sense (of responsibility) but I save \r\nthe money that I made in the five and dime store to buy \r\nclothes with.  That’s just been my nature I guess but it \r\nwas a great feeling of independence.  I know longer had to \r\nask anybody, for money. And I started smoking, which was \r\nnot a good thing but women did that. Until then- this is a \r\npiece of history- “ladies” would not smoke in public. They \r\nwould not do that.  And we said well, I can remember and I \r\nwas 16 and we said, well we are doing men’s work so we can \r\nsmoke if we want to, where we want to. (laughs)  But I \r\nwould never smoke until I had the money to buy my own \r\ncigarettes was the point in part answer to your question. \r\nPlus we were urged to buy war bonds that was the only way \r\nthe war could be won also. So we bought a war bond- a 25 \r\ndollar Amateur, it was 1875, they would just automatically \r\ntake it out of your paycheck.  I think I bought one every \r\n----------------Page (5) Break----------------\r\n 7 \r\nmonth... we got paid every two weeks.  Yeah but anyway, it \r\nwas great sense of independence. And freedom-  to know that \r\nI could be responsible for myself.  \r\n \r\n07:13:19--------------------------------------------------- \r\n \r\nDe Mare: Can you talk a little bit more about the kinds of \r\nthings, like the smoking of the cigarettes, the kinds of \r\nthings that you as a young woman felt were open to you that \r\nmay not have been open to you before you starting working \r\nand had that kind of independence. You know you said that \r\nwomen didn’t smoke and I know women didn’t wear pants.  Can \r\nyou talk a little bit about what that shift was like? \r\n \r\nTucker: Well we were shunned by the local people.  We were \r\nshunned by the men in the factories.  But we were shunned \r\nby the local people because we did wear pants.  We didn’t \r\nwear pants in public, but, uh, we wore them on the street \r\nbecause we rode the public transportation.  There were no \r\ncars.  We didn’t have cars during the war. But, I- I felt \r\nvery, and maybe because it was suggested, you know, that I \r\nfelt (pause) Well, I felt shunned is the best word, by the \r\nlocal people.  We did have the freedom to wear pants. I \r\n----------------Page (6) Break----------------\r\n 8 \r\nnever really wore pants.  I never stopped wearing dresses \r\nuntil the, in 60s, years later. \r\n \r\n      Reaches for water   \r\n \r\n08:32:11 ------------------------------------------------ \r\n \r\nTucker:  And, hum, we did have a sense of- well it was a \r\nsense of freedom to have a whole new world open up to you.  \r\nAnd the social was great.  (Laughs) \r\n \r\nDe Mare:  Well I want to get to that. \r\n \r\nTucker: The social life was great.  The Hunter Airbase was \r\nthere and it was our patriotic duty to entertain the \r\ntroops. For 15-16, 17 year old that was a pretty important \r\nthing.  And I remember that more than a lot of other \r\nthings. \r\n \r\nDe Mare:  Let’s go back, because I want to talk more about \r\nthat. But I want to go back to what you said you felt that \r\nthe men in the factory shunned you.  \r\n \r\n----------------Page (7) Break----------------\r\n 9 \r\nTucker:  Oh yea, they did not want women to work. They did \r\nnot want women- And I didn’t feel that maybe because I was \r\nso young. But I felt protected by the men and you had- \r\nThere were of course who were kept on the job and that was, \r\nthey were deferred from listing in the service because they \r\nwere necessary to train us and to help do the work. And uh, \r\nI never remembered that but if you listen to some other \r\nRosies’ stories, you will hear some really mean, hateful \r\ntricks that they played on the women to make it difficult \r\non them.  They said that we do not want to women to work \r\nbecause women are too emotional. They are not strong enough \r\nphysically.  They will be a distraction to the men and they \r\nwill be sick all the time. You know...so, I didn’t really \r\nsense that but like I said a lot of women did.  \r\n \r\n10:15:10-------------------------------------------------- \r\n \r\nDe Mare: But you also said that when you went to and from \r\nwork in your uniforms that you felt that the local people \r\nkind of looked down a little bit.  \r\n \r\nTucker: They did, but Savannah was a very closed city if \r\nyou weren’t a native of Savannah.  And in those days you \r\nwere either a blue blood or you weren’t whatever that \r\n----------------Page (8) Break----------------\r\n 10 \r\nmeans.  It wouldn’t mean anything much to your generation \r\nbut that, that...So you didn’t feel a part of it but it \r\ndidn’t matter because we had our own community and all of \r\nthe young women, and most of them in their twenties, some \r\nof them older, came from small towns, just like I did, in \r\nGeorgia or South Carolina and we had a community and we \r\nbonded. We worked together and we socialized together. And \r\nsome of them, two of them who were my friends all \r\nthroughout were married already but... \r\n \r\nDe Mare: Did they have any children? \r\n \r\nTucker: No.  The ones I knew did not. \r\n \r\nDe Mare:  Because I’ve always been curious what the young \r\nmothers did.  If they were able to go into work or not \r\nbecause I know there wasn’t much in terms of childcare \r\navailable. \r\n \r\nTucker:  No. No childcare.  That was a ... \r\n \r\nDe Mare:  Where- Can you talk a little bit about, you said \r\nthat you lived in worker’s housing.  That there was housing \r\n----------------Page (9) Break----------------\r\n 11 \r\nthat was made for the workers.  Can you talk little bit \r\nabout that?  What it was like?  \r\n \r\nTucker: Well that was a whole switch.  I will tell you \r\nanother piece of history but this was because of the \r\nDepression.  I-I grew up in a small town.  We weren’t in \r\nthe country.  We were in the town but we did not have \r\ninside, running water. We had well and we had outside \r\nconvenience. It wasn’t very convenient.  But when we moved \r\nto Savannah, of course the house was new.  We didn’t have a \r\nrefrigerator. It had a wonderful refrigerator. It had \r\ncentral heat, I guess, I don’t remember about the heat but \r\nI do know it had running water.  And a bathtub, which we \r\nhad and that was a real luxury.  The-the, I remember the \r\nlandscaping was poor.  They just built these, and they were \r\npretty nice, they were small, two bedrooms, very small and \r\na living room and then the kitchen and dining area.  A lot \r\nof people, other places in the country had terrible living \r\nconditions and those duplexes are still in Savannah 60 \r\nyears later.  So they weren’t just-I don’t know who lives \r\nin them now but I’ve seen them in the last 50 years anyway. \r\n \r\n12:47:23--------------------------------------------------- \r\n \r\n----------------Page (10) Break----------------\r\n 12 \r\nTucker: But living, but I mentioned no transportation.  I \r\ncan’t remember how we got to work.  I’m sure we had to \r\ntransfer, go downtown and get on another bus, but a bit of \r\nhumor. You want a bit of humor about our transportation? We \r\nhad to find a neighbor who drove, who had a car, an old \r\nFord convertible.  And the top of the convertible would \r\nleak when it rained very hard.  My sister and I sat in the \r\nbackseat and open an umbrella and giggle all the way to \r\nwork. But the funny thing was my sister was a lot more, a \r\nlot bolder than I was. But the man, the owner of the car, \r\nwhose name I can’t remember, called one morning and said he \r\ncouldn’t go to work because he was ill.  And if you missed \r\na day of work you didn’t get overtime when you worked. And \r\nwe worked overtime when all the time. You had to put in \r\nyour 40 hours to get overtime. He said ‘one of you girls \r\ncan drive,’ and I knew that my sister didn’t know how to \r\ndrive and I wasn’t about to try and my sister said, ‘I’ll \r\ndo it.’ And so she drove.  I think she may have driven \r\nsome- maybe her boyfriend’s car. \r\n \r\n13:57:21----------------------------------------------- \r\n \r\nDe Mare: Can you talk a little bit, because you lit up so \r\nmuch when you start to talk about when you were a young \r\n----------------Page (11) Break----------------\r\n 13 \r\ngirl with all the men and servicemen around. And what your \r\nsocial life was like, it seems from the outside, so many \r\nwomen traveled to work. And so as you said you have all \r\nthese women from small towns all these young girls.  Can \r\nyou talk a little bit about the freedom of that social life \r\nand what that felt like to you?  \r\n \r\nTucker:  It felt great. IT was wonderful and the first \r\nexperience- the first thing we experienced was we took a \r\ntrain from my hometown in Alabama to Savannah.  I didn’t \r\nknow anything about troop trains.  I didn’t know much about \r\nthe war.  What I knew was basically what we saw on the \r\nnewsreel because I didn’t have any close people, any family \r\nmembers in the war.  But we got on the train, and I had \r\ntravelled on the train all my life, that was our mode of \r\ntranspirations from visiting aunts and uncles and \r\ngrandparents.  But when we got on the train in Heflin, \r\nAlabama, the small town where we got on the train.  It was \r\npacked.  It was a troop train and it was packed with \r\nservicemen in uniform.  And there were no seats. So we sat \r\non our suitcases, for well, it took about 18 hours.  We \r\nchanged in Atlanta.  Same thing in Atlanta. I can remember \r\nhow impressed I was with some of the young men.  My mother \r\nwas in her 40s, early 40s, and they would offer, they would \r\n----------------Page (12) Break----------------\r\n 14 \r\nget up and say ‘you can have my seat for a while.’  And I \r\njust remember being awe-struck.  And then another, as soon \r\nas we started working, 10 hours a day, hot, heavy clothes, \r\nin the sunshine, sweating all day but we- we were about to \r\ngo out by 7 o’clock in the evening when got home. Of course \r\nwe went to work early and got off at probably around 4.  \r\n But if we didn’t, and I sensed, and I-I tokenly say \r\nwe were doing our patriotic duty because we were having a \r\nwonderful time meeting all these guys and they were \r\nwonderful guys. And I say frequently when I’m talking to 5\r\nth\r\n \r\ngraders about World War II history, that I was never \r\nintimidated and they were always just as—ah I can’t find \r\nthe world.  Well they treated us like ladies in every \r\nsense.  And they were eager to just enjoy themselves.  Most \r\nof the guys we painted-dated were from Hunter Air Base.  It \r\nwas a jumping off point for Europe and they were there 6 \r\nweeks.  And we knew that they were going to be gone.  Well, \r\nwhen you’re a teenager you can pretty much develop a \r\n(relationship), and during the war you know some people got \r\nmarried after knowing someone for two days.  I did not do \r\nthat, even after 6 weeks.  I think if I had done that, and \r\nI am still single.  But you-u just wanted to do everything \r\nto make them happy.   \r\n----------------Page (13) Break----------------\r\n 15 \r\n And this is a funny experience and you said how did \r\nit make me feel?  I made the mistake, shortly after I got \r\nto Savannah of going downtown by myself to shop. And I was \r\nwalking down the street and suddenly I was surrounded by 6 \r\nor 8 Navy guys.  And they said, ‘Oh, where did you come \r\nfrom?’ ‘Oh, look at this beautiful... young thing.’  And I’m \r\nlike- And I’m sure my eyes were as large as they could get. \r\nAnd they were just having a good time.  I wasn’t \r\nfrightened.  I mean I was.  It embarrassed, you know, very \r\nembarrassed more than frightened. But that was a thing I \r\nstill remember and they were just enjoying themselves. No \r\nharm meant.   \r\n \r\n17:47:09------------------------------------------------- \r\n \r\nDe Mare: Can you talk a little bit about the work itself? \r\nWhat you physically did and what it was like to do that kid \r\nof work? How you learned it and— \r\n \r\nTucker:  Well in the beginning, like I said we were in a 6 \r\nweeks training class and we just worked and I did the rod \r\nwelding which the eclectic welding.  And you had a lot of- \r\nof course you had a lot of fire fall so you wore boots up \r\nto- mid-calf and heavy pants and long sleeve shirts and \r\n----------------Page (14) Break----------------\r\n 16 \r\nheavy suede-type gloves in school that’s what we wore- and \r\nthe shield, the welder’s shield. And I can’t remember any \r\nof it being difficult.  I’m sure it was.  The greatest \r\nchallenge was keeping the temperature on your machine set \r\nto the proper control because if it was cold the metal \r\nwouldn’t melt and if it were too hot it would just run off \r\nthe seams. But that was the real challenge when you were \r\nworking on the yard.  Yes it was heavy work. You had to \r\npull that line where you were going.  We didn’t have to do \r\nany heavy lifting that I recall.  And it was extremely hot, \r\nof course in Savannah, and muggy.  I don’t remember the \r\nwinter times.  I just remember the summer heat. They—and \r\nthis is something else that came from World War II era.  We \r\nworked long hours and because of that they started giving \r\nyou 15-minute break in the morning in all factories.  They \r\nwere required to do that, and a 15-minute break in the \r\nafternoon.  And we had a salt tablet dispenser in our area \r\nso if we started feeling weak we could go have a tablet of \r\nsalt because you lost so much sodium in your sweating. \r\n \r\n19:45:02------------------------------------------------- \r\n \r\nTucker: But it was...but it was dangerous work.  My sister \r\nalmost lost her fingers.  She was working up on the way.  \r\n----------------Page (15) Break----------------\r\n 17 \r\nThey had two areas of work.  We put the- built the rooms \r\nand put the walls and everything together, welded on the, \r\nthey were called the slabs.  It was like built up platforms \r\nfrom the ground.  And then they were carried by these \r\ncranes up to the ways where the ship was assembled. And \r\nthat was more dangerous. And at the end of the war when \r\nthey, and this was the hardest thing you had to do.  They \r\nwere not allowed to put women in the inter-bottoms of the \r\nship. That’s where the pipes all go, like manhole size \r\nareas and you had to slide through those holes, crawl \r\nthrough those holes to get to the area where you were going \r\nto weld.  I’d carry a light.  It was like going into a coal \r\nmine, I guess.  And they had but- they did have at the end \r\nof the war because they were not starting new ships they \r\nused the women that were still there to go into the inter-\r\nbottoms.  And we heard these stories about how you’d be \r\nsexual abused.  And the worst thing, the most dangerous \r\nthing that happened was the first day, to me the whole time \r\nI worked in the shipyard was this one of my coworkers just \r\nup a distance from me, maybe 50 yards.  And the acetylene \r\nwelder was welding on the top on the deck and they were \r\nsupposed to clear the space underneath.  He failed to do \r\nthat and it burned through and it poured down on her ankle.  \r\nIf it had been on her back or her head, it could have been, \r\n----------------Page (16) Break----------------\r\n 18 \r\nit could have been fatal.  And I don’t know if she ever- \r\nshe never came back to work because it really was such a \r\nbad burn.  And, and you couldn’t breath and that why it was \r\nsuch a difficult thing getting your temperature setting on \r\nthe machine because you’d have to climb out come outta, and \r\nit would be a distance longer than this room sometimes, but \r\nwe didn’t do that for long. \r\n \r\n21:59:19------------------------------------------------ \r\n \r\nTucker:  And another interesting thing, and I didn’t \r\nremember this.  My sister was not happy. She didn’t want to \r\nkeep working there.  She never liked it. So she went to the \r\noffice to resign and they said, ‘well we are sorry but \r\nyou’ve signed a defense contract.  You are not free to \r\nresign.’  But soon as the war started tapering down, she \r\ndid quit. She had already... \r\n \r\nDe Mare:  Can you talk a little bit about in the factory, \r\nbecause you said something very interesting about the \r\nsexual assault in the factory.  Can you talk a little bit \r\nabout the relationship between the men and the women?  Did \r\nyou directly with the men?  And how many men?  How many \r\n----------------Page (17) Break----------------\r\n 19 \r\nwomen? Like how would you say the relationships were in the \r\nfactory that you experienced? \r\n \r\nTucker:  They were good mostly. And well we only had- we \r\nonly had two supervisors over the area that I worked in, \r\nthe slab.  They were numbered by slabs. We had, they called \r\nthem a lederman and a quarterman.  The lederman was the one \r\nwho worked most directly with us.  He was a wonderful man, \r\ngreat.  I remember his name.  I don’t remember too many \r\nnames. Pippen was his last name.  And then the other guy \r\nover him, the quarterman, I was very uneasy.  He had a \r\ngirlfriend and I would have never had known this, I was too \r\ninnocent coming from a small town.  But she was much older \r\nwoman and she sat outside his shack, his office.  But the \r\nolder women talked about it see so I-I became informed \r\nabout what went on in the world around me.  So but the \r\nrelationship as I said, where I was, was good. It was not \r\nthat way in lots of factories. Many factories. \r\n \r\n23:39:08-------------------------------------------------- \r\n \r\nDe Mare: So were there any...you worked directly with men on \r\nthe floor, like you were welding, you were working and \r\nthere were men working right next to you? \r\n----------------Page (18) Break----------------\r\n 20 \r\n \r\nTucker: No, no.  Not in my case. Now my mother had a man \r\nwho was just a welder in her group and there would be 8 or \r\n10 of us in each group. \r\n \r\nDe Mare: But your group was all women? \r\n \r\nTucker:  All women- except the supervisors.  And they just \r\ncame to help us.  I can remember this too, I guess this \r\nsomething else I can... I thought, I was annoyed once I got \r\ninto the fact that we were doing something important to \r\nhelp win a war.  The guys wou- but I felt like this about \r\nwork, I guess it’s kind of always been my work ethic.  He, \r\nmy lederman would come by and say ‘you’re working too hard.  \r\nGo sit down in the shade over there.  Get cool I think.’  \r\nSit down?  I’m getting paid to do this.  So you know, we \r\nhad the breaks.  I did take those. But I thought, and it’s \r\nodd how you remember something like that is seemingly \r\nunimportant but we did work and long hours. \r\n \r\nDe Mare:  Now was there any kind of labor union where you \r\nworked? \r\n \r\nTucker: Yes. I can talk about that. \r\n----------------Page (19) Break----------------\r\n 21 \r\n \r\nDe Mare: Please do. \r\n \r\n24:50:21--------------------------------------------------- \r\n \r\nTucker: Went through my mind just a few minutes ago because \r\nI was thinking about how taking the break bothered me and \r\nit was getting, this was probably in 1944, I had been there \r\nabout a year and we were required to join the union. \r\n \r\nDe Mare:  And which union was it? \r\n \r\nTucker:  I don’t remember, sorry. \r\n \r\nDe Mare:  That’s ok, that’s ok. \r\n \r\nTucker: And uh, about midway through the, see I went to \r\nwork in 1943 and it was 1944, towards the end of that.  We \r\nwent on strike. We were required to go out on strike. We \r\ncouldn’t go in, I mean it was just like a strike today for \r\nmoney.  We were making ships to take supplies to the men \r\nwho were fighting and dying for us and I have never, I \r\nremember making a statement that I would never work for \r\nanother company where I had to be a part of a union.  But \r\n----------------Page (20) Break----------------\r\n 22 \r\nit lasted 2 or 3 days and we got the raise.  I wish I knew \r\nexactly how much the top pay was.  I didn’t keep anything.  \r\nI’m not a collector of things.  And I didn’t know it was \r\nhistory but I think it was $2.40/50 because that comes to \r\nmind when I think about the strike. \r\n \r\n26:06:20 \r\n \r\nDe Mare: And did you and the women make the same wage as \r\nthe men? \r\n \r\nTucker: No. \r\n \r\nDe Mare: Ok, can you talk about that? \r\n \r\nTucker:  I did not know it. I didn’t even know it.  It \r\ndidn’t occur to me that men would be paid more.  But \r\nhistory, the stories I read about the other they were not \r\npaid equal salaries.  And there was no Feminist Movement at \r\nall.  I mean, you know...(laughs) we weren’t thinking about \r\nif we were being treated equally. \r\n \r\nDe Mare: Do you think- let’s move forward in just your \r\nperspective in your life, how do you think that time \r\n----------------Page (21) Break----------------\r\n 23 \r\nchanged women the Women’s Rights Movement did happen?  When \r\nwomen started to have more of a voice or more um- when they \r\nstarted to stand up a little more for themselves in \r\nsociety.  Do you think your time then affected how you \r\nlooked at that?  Can you talk about yourself in the way? \r\n \r\nTucker:  You know, I’ve never really been conscious of \r\nthat.  I have just not been conscious of that. \r\n \r\nDe Mare:  Well, when you look at your niece and you see the \r\nopportunities that are open to her now and you think about \r\nbeing a young woman. Can you just talk about, because you \r\nhave this great perspective of history coming from where \r\nyou came from?  Can you talk a little about that?  \r\n \r\nTucker:  I can and I just attended my niece’s, JC’s \r\ngraduation from the University of Georgia and I was \r\nspeaking to another parent, relative of another child and \r\nshe said, ‘Who is your graduate? What school is your \r\ngraduate attending?’ and I said, ‘well, she just graduated \r\nfrom, um, in the school of animal science from the \r\nuniversity and she’s been accepted, she is going onto vet \r\nschool.  And this lady who was from Nashville said that her \r\nsister applied to go to vet school at the University of \r\n----------------Page (22) Break----------------\r\n 24 \r\nGeorgia in 1951 and she could not even be given an \r\napplication because she was a female. So you know, so I \r\ncan, but I didn’t sense any of that early on. I realized \r\nthat more later in and now feel, in fact I’m embarrassed to \r\ntell this. The committee at my church to call a new \r\nminister and this was 30 years ago and we had two names and \r\none was a female and one was a male with a family.  And \r\nthey said well, we’ll have to pay him more than we pay her.  \r\nAnd I said, I don’t think that’s fair. You know, that’s the \r\nfirst time I remember consciously computing something like \r\nthat in my mind.  And I know it was because I had read and \r\nheard a lot of things.  I’ve just never really thought that \r\nmuch about it.  But I am so grateful that we had a part in \r\nhelping women to be able to have independence.  I know it \r\nhas created a problem in families.  I think it has with \r\nmothers working all the time and not being home and yet at \r\nthe same time, I know women lived in terrible marriages and \r\ncircumstances because they had no freedom to go work or do \r\nanything else. So you know it’s a good... (balance) \r\n \r\n29:27:08--------------------------------------------------- \r\n \r\n----------------Page (23) Break----------------\r\n 25 \r\nDe Mare:  Now you yourself seem to have been independent \r\nyour whole life it sounds.  And what did you go on to do \r\nafter the war? \r\n \r\nTucker:  I went on to, well I stayed out of high school for \r\ntwo years to work.  Then I went back to graduate from high \r\nschool and then I went back to study dental hygiene so \r\nthat’s what I did for 55 years.  And I love it because I \r\nenjoyed working with people.  I can remember at the 5 and \r\n10 cent store how much I enjoyed those people and seeing \r\nhow interesting different people are and I don’t think I \r\nknew it then but I say it often now to young people now, it \r\ndoesn’t matter if you’re sweeping floors or what you’re \r\ndoing.  Just do the best you can.  Make it the best you \r\ncan.  Work is work.  I had a black lady tell me that once, \r\nan Afro-American.  She said, work is work, hun, do it the \r\nbest you can.  And don’t think that you’re too good and I \r\nhad, as a dental hygienist because we had college training \r\nand in the school there was always that sense that we were \r\nbetter than the dental assistants, ya know because we were \r\neducated.  But I could swipe...Well I did to a sense, but it \r\nwasn’t...but it wasn’t.  I can’t remember some of the tings \r\nthat I didn’t think...it was like cleaning floors in a dental \r\noffice, dust, take out the garbage.  I thought, I didn’t go \r\n----------------Page (24) Break----------------\r\n 26 \r\nto school to learn how to do this and that’s when I heard \r\nthat saying work is work and I thought, get over it, Jane. \r\n(laughs) None of this is beneath... \r\n31:16:15------------------------------------------------- \r\n \r\nDe Mare: You touched on something I wanted to ask you \r\nabout, because you worked in Savannah.  Were there any \r\nAfrican-Americans working in the shipyard with you? \r\n \r\nTucker: No. \r\n \r\nDe Mare: None? \r\n \r\nTucker:   But this was the beginning.  This was the first \r\ntime in history of this country that...you can never say \r\nnever.  It was the first time black, Afro-American women \r\nwere about to get out of white women’s homes to work. They \r\ncould not- My aunt for instance, when to work in New York \r\nin the 20s to work as a stenographer, that’s what they call \r\nsecretaries.  But-but that that secretarial work, office \r\nwork, nurses, and school teachers those were women’s jobs.  \r\nAnd that’s all I thought I’d be able to do. I had no idea I \r\nwould have the opportunity to go to college.  Even when I \r\nwas going back to high school my last year.  But it’s \r\n----------------Page (25) Break----------------\r\n 27 \r\nwonderful to see, to look back and to see, I think God \r\nhelps you even when you’re not asking for help to find your \r\nplace.  And we all have a place.  And we are all gifted.  I \r\ncertainly don’t feel like I’ve ever done anything big but \r\nbecause of my love of people, I certainly feel that I’ve \r\ncontributed to people’s-well to their health first of all \r\nand then to their well-being because some people need a \r\ncouncilor wherever they are on that particular moment of \r\nthe day.  My work has been a great joy. \r\n \r\n32:43:21------------------------------------------------ \r\n \r\nDe Mare: Do you have an anecdote or story or an experience \r\nabout being in the shipyards that you would like to tell?  \r\nMore of like an anecdote, a funny thing, a sad thing, I \r\nmean the story about the woman who was burned is the sort \r\nof thing I’m talking about.  Any other event that made an \r\nimpression on you as a young woman?  Maybe what it was like \r\nto see your mother working that hard? Or I don’t know, \r\nanything you think...when you were thinking back? \r\n \r\nMimi:  Tell us why your sister went to work in the most \r\ndangerous place in the ship? \r\n \r\n----------------Page (26) Break----------------\r\n 28 \r\nTucker: Oh ok.  They make women you weren’t required to go \r\nup on the way to work because it was more dangerous. So my \r\nsister volunteered. And one of our close friends, and I had \r\nforgotten this. But I visit with this friend, many times, \r\nseveral times, after the war in recent years. And she said \r\n‘do you remember why Betty went up on the way?’ I said, ‘No \r\nI don’t remember why?’ It’s because she thought there would \r\nbe a lot of cute boys up there.  And we called them boys.  \r\nWhen I was writing my story, I thought, well I can’t call \r\nthese guys soldiers. Well we called them boys.  And they \r\nwere boys, they were boys. It breaks your heart to hear the \r\nveterans tell their stories.  18 year olds, 17 year olds so \r\nthey were like me.  They were young. But one of them, and \r\nthis is related of course to social life- romance- because \r\nthat’s just a normal thing for teenagers but I- you \r\ncouldn’t, you had to grab your scarf and tie it around your \r\nhead to keep your hair out of, so it wouldn’t catch on \r\nfire.  And I must have had a very special evening planned \r\nafter work so anyway, I decided I would do my hair up in \r\ncurlers, pin curlers and then wear- I would have to wear my \r\nscarf tied around my neck but I wasn’t going to weld above \r\nmy head that day.  I mean- I can remember thinking that.  I \r\ndon’t know why I thought I could get away with not welding \r\nup above my head. But anyway I was welding and sure enough \r\n----------------Page (27) Break----------------\r\n 29 \r\nthe sparks flew down into that scarf and caught on fire.  \r\nI’m sure I had planned or thought about it so instead of \r\njerking it this way (back), I jerked it the right direction \r\n(forward) got it off before getting hurt. I was burned once \r\nbut not—and this is an interesting story as a welder.  You \r\nhave that shield to wear and you can’t allow any of the \r\nrays to get into your eyes.  If you do, you get what they \r\ncall a burn, a ray burn. Very painful. So I had never had \r\nthat and you could get exposed to it from somebody else’s \r\nwelding if you weren’t careful. Or else you could have a \r\ntiny leak.  So one night I had a date with this guy and we \r\nwent downtown to the theatre, the movie.  On the bus.  And \r\nwe’re in the movie and it’s a comedy.  And all of a sudden, \r\nthe tears, and this is the first symptom that you have a \r\nflash burn.  The tears just started pouring down my cheeks.  \r\nAnd I thought, oh my goodness, and then I could tell that \r\nsomething was wrong with my eyes.  All the way home on the \r\nbus, he had to sit with me with tears pouring (laughs) down \r\nmy face and everyone looking at him like what kind of guy \r\nare you and what have you done to that poor little girl.  \r\nSo and it was painful.  I could not work for a day.  And it \r\nwas interesting.  The treatment today is still the same \r\nbecause I asked a patient of mine who is a welder what they \r\ndid if they got a flash burn.  He said we grate potatoes. \r\n----------------Page (28) Break----------------\r\n 30 \r\nYou just pack them on your eyes with your eyes closed and \r\nthat gives you some relief. But that was a painful thing \r\nand that only happened to me once.  And I just don’t \r\nremember the dangers.  Now I have read and this again is a \r\nstatistic, by 1944, 37,000 defense workers in plants had \r\ndied in the country.  And that’s in a booked about it \r\ncalled Rosie the Riveter.   \r\n \r\n37:10:12--------------------------------------------------- \r\n \r\nAnd this reminds me to tell a story and this is not what we \r\nare talking about.  But the reason I thought is that book \r\nas a picture of the first Rosie the Riveter that was \r\npainted by Norman Rockwell.  You know big muscular girl \r\nwith dirt on her face. And ya know, she looks very- well, \r\nlike a male instead of female, no femininity. So anyway, \r\nthe woman who worked in defense plants did not like that at \r\nall. So this Alvin Miller did this icon and you see it was \r\nwell accepted. And you can see she had make-up on, \r\neyelashes. And we did not want to be treated differently \r\nbecause we were still ladies underneath even though we were \r\nworking and we were tough.  Ya know, I think I had too much \r\npride about that for a long time when I was telling my \r\nstory about what we did.  If you think about history, there \r\n----------------Page (29) Break----------------\r\n 31 \r\nwere young women, my age, 16 year olds who carried guns in \r\nthe Revolutionary War and in the Civil War, they did the \r\nsame; they fought. And women crossed this country in \r\ncovered wagons and worked like men and gave birth to \r\nbabies. And took care of babies and buried their children \r\nso we were not the first women to do—But we did something \r\nspecial at a special time.  And this was a peoples’ war.  \r\nI’ve heard. I heard one.  He’s a historian and has written \r\nsome books about World War II but he was only 9 years old \r\nduring the war.  But he said, ‘I had a part in winning the \r\nwar. We collected cans for the salvage center to make \r\nbullets with; we collected grease; we- and foil we would \r\npeak the foil off of gum wrappers and cigarette wrappers \r\nand make big balls out of it. He said my mother would put \r\nall that in my little red wagon and I would take it to the \r\nsalvage center. And they trained young people, boys, young \r\ngirls I guess to identify foreign planes, enemy planes.  \r\nAnd so they were sky watchers.  They were civil patrol \r\npeople and they could identify all of them, German and \r\nJapanese planes.  At the time I had no idea that there were \r\nGerman submarines off the coast of Savannah, all the way up \r\nand down the coast. They were prowling of course. And we \r\nwould get alerted and we would have to black the (windows) \r\nand we would have blackouts.  And another thing that I \r\n----------------Page (30) Break----------------\r\n 32 \r\nthink is just a part of my nature is that it didn’t seem \r\nreal to me so it didn’t upset me. \r\n \r\n40:06:09-------------------------------------------------- \r\n \r\nDe Mare: Can I ask you a personal question? \r\n \r\nTucker: Sure. \r\n \r\nDe Mare: I’m just curious, to go back to what that work did \r\nto you and your family.  Your mother being a single mother \r\nand how you think that affected you because you said that \r\nyou never married. Can you talk about, about that? About \r\nyour experience and how you look at the world in that way? \r\n \r\nTucker: I think that one of the things that I remember \r\nclearly was meeting all these wonderful guys and knowing \r\nthat they were going to be gone and you were not going to \r\nhear from them again- probably. And the thing I regret most \r\nabout that is and I tell young people when I’m talking to \r\nthem, write people.  I could find some of those guys now \r\nwith the uh, comp, the Internet that I don’t know how to \r\nwork. But JC could do it for me but I thought I would never \r\nforget ‘em.  But anyway I think that had some affect on me \r\n----------------Page (31) Break----------------\r\n 33 \r\nya know kind of build a shell up.  You know, I’m not really \r\ngoing to get serious about this guy because he’s gonna be \r\ngone. And but for the uh, the other thing it did for me...It \r\nopened up a whole new world for my mother.  She had some \r\nfreedom that I didn’t understand and we didn’t talk about.  \r\nIt’s too bad you don’t communicate with your moms more but \r\nI know it was a sense of freedom that she really enjoyed to \r\nknow that she could make her own way and survive.  But one \r\nof the things I gained from the experiences of meeting \r\nthese different guys was- I had no idea was going to go to \r\nschool in Chicago.  And my grandmother was born in 83, 18- \r\nI mean 1863 when the Civil War started and my grandfather \r\nremembered it even more because he was 7 years older.  And \r\nhe talked about it and he did not like damn Yankees.  That \r\nwas his, he did not like. My grandmother liked everybody.  \r\nI would have been afraid. I never met anyone from north of \r\num, not many people out of Alabama actually.  But having \r\nthat experience with people from all over the country and \r\nfinding out that people are the same wherever they come \r\nfrom.  Basically, we are all carrying and the same kind of \r\npeople.  And when I said that I was going to school in \r\nChicago everyone said oh boy you are really going to have a \r\nhard time making friends. Oh it’s terrible to go to a \r\nYankee school, a northern school whatever.  And so I did \r\n----------------Page (32) Break----------------\r\n 34 \r\nnot have that fear because I had known these wonderful guys \r\nand it was just such a, um, well it was just such a \r\nbroadening experience of course to meet other people and \r\nget away from the small town pettiness.  I think the thing \r\nI dislike most about small towns and my mother’s family, my \r\nmother, again my grandma I never got a sense learning this \r\nfrom her. But my mother’s theme song was ‘What are the \r\nSmith’s going to say?’ (laughs) ‘What are they going to \r\nthink about you if you do that?’  So I was never- I was \r\ntalking to one of the other Rosies this morning and she was \r\ntalking about going back to her hometown and finding her \r\nroots.  I said I have never wanted to go back to my \r\nhometown. I’m sorry.  But it was during the Depression.  \r\nThere was nothing and the people weren’t- and the teachers.  \r\nWe had terrible education.  That was another thing I had to \r\nstruggle with when I went to college. We didn’t have good \r\nte- I never- One year we had enough money operate the \r\nschool to the first of February at least the public \r\nschools.  I think was in the 4\r\nth\r\n or 5\r\nth\r\n grade and there was a \r\ngreat debate about whether to promote us and they decided \r\nthat they would go ahead and do that because there was no—\r\nand every year the term was shortened, usually 7 months or \r\n8 months but um. We had, when World War II started, the \r\nteachers moved away instantly.  They were probably making \r\n----------------Page (33) Break----------------\r\n 35 \r\n$25 a month working in my school in my hometown and they \r\ncould move a larger town and make more money.  So um, When \r\nyou are young and I did not remember.  I have done one \r\nrecording for the Library of Congress when they were doing \r\nthose in ‘05 and I didn’t remember anything much (laughs).  \r\nHe said that ok we’re going to have an interviewer.  He \r\nwill ask you questions but I just didn’t remember a lot \r\nbecause I hadn’t thought about it.  And I have taught to \r\none friend, I just have a habit now since I’ve gotten so \r\ninterested in the last ten years, I said, where, did you \r\nwork during World War II?  And she said, well yes I did.  \r\nShe was a supervisor over several plants that made shells, \r\nammunition; I don’t know exactly what kind in Atlanta \r\nmaking.  And she travelled all around and she talked to me \r\nabout it for 30/40 minutes.  And she said, ‘ya know, I have \r\nnever told anyone about that.  Been over 50 years.  Even my \r\nson, even my son doesn’t know that story.  And I couldn’t \r\nget her interested in joining the American Rosie the \r\nRiveter Association.  And she’s no longer able to, she had \r\na stroke.  That’s why I want to do this.  Because there are \r\nnot many people who are able to do it even now. So...But I \r\ngot a young start (laugh) I may not be able to do it next \r\nyear but I’m glad you asked me to do it. \r\n \r\n----------------Page (34) Break----------------\r\n 36 \r\nDe Mare:  Well thank you so much.  This has been so \r\nwonderful. \r\n \r\n46:15:14-------------------------------------------------- \r\n \r\nTucker:  I just want to tell you some things good that came \r\nout of World War II and then I’ll do that story.  But \r\nwomen, um, well, disabled people had never been able to \r\nwork in public.  They were hired. Blind people were able to \r\ndo certain jobs. Deaf people could do other jobs. So \r\ndisabled people were hired as a result of the need.  There \r\nhad never been any daycare; we mentioned that. There were \r\nno-and and when the war started you would have friends and \r\nfamilies that would work different shifts.  Mother’s would- \r\nand they would babysit.  The Kaiser shipbuilding \r\ncorporation in Richmond, California, the largest one of \r\nall, opened the first daycare center before World War II \r\nended. Antibiotics had not been developed. They, I’m sure \r\nthey were being worked on and being ya know, being \r\ndeveloped but because of the need that stepped up \r\nimmensely, they became used constantly, which was a great \r\nstep.  Had to be on the battlefront.  They needed \r\nsomething.  And it saved a lot of lives to be able to use \r\nthe antibiotics and to use them, to go ahead and use them.  \r\n----------------Page (35) Break----------------\r\n 37 \r\nThere had never been women hired to play in a symphony. The \r\nmale conductors would not hire women.   There were no women \r\nbaseball teams.  She’s (JC) a baseball player. But they \r\nhad- have you seen the movie A League of Their Own. Ok. So \r\nIt opened up a lot of doors and answered- and developed a \r\nlot of good things.  Those are just a few. \r\n \r\n48:03:12--------------------------------------------------- \r\n \r\nTucker:  And the story that she is referring to about my \r\nmother worked in, it was really a women’s store in downtown \r\nAtlanta on Peach Street before malls were discovered and \r\nthere was a lady there who was an elevator operator. Her \r\nname was Jutinita.  I’m going to go home and see if I can \r\nfind a newspaper article I saved when she retired.  She \r\nwould be a Rosie the Riveter.  She was an Afro-American and \r\nshe took a man’s job.  We didn’t think about it- I hadn’t \r\nthought about it until today, earlier today I was thinking \r\nabout Jutinita. She was one the most gracious ladies I’ve \r\nknown.  My mother loved her. And she was just precious.  \r\nShe really was and the Atlanta Journal wrote up the story \r\nof her working at JP Alan’s for all those years as the \r\nelevator operator. And said she was the last female, the \r\nlast elevator operator.  I thought it was in the country, \r\n----------------Page (36) Break----------------\r\n 38 \r\nbut it must just be in Atlanta because we were talking \r\nabout it and they still do have operators in some the \r\nbuildings in larger cities.  But she was so gracious and \r\nwould just make your day to see her and she was precious \r\nperson.  I think the greatest thing to me is, one of the \r\ngreatest things is to have the Afro-American’s be able to \r\nwork...and even at the graduation of JC from the University \r\nof Georgia, it occurred to me that 30 years ago there would \r\nbe no black graduates.  I mean, there wouldn’t be. \r\n \r\nDe Mare:  It’s actually amazing how— \r\n \r\nTucker:  Um, I- That’s an embarrassing part of our history. \r\n \r\nDe Mare: Yes. \r\n \r\nTucker:  Very worst than embarrassed. \r\n \r\nDe Mare: Just one more thing.  What happened for you when \r\nthe war was over? \r\n \r\nTucker:  I knew exactly what I was going to do when the war \r\nwas over.  I was going immediately back to high school.  Of \r\ncourse the adults in the family when I stayed out of school \r\n----------------Page (37) Break----------------\r\n 39 \r\nsaid ‘you’ll never go back.’ And I said ‘Oh yes I will.’  \r\nAnd I had no idea then that I would have the opportunity to \r\ngo to college. I mean there was no money.  I remember \r\nteachers saying ‘you better do well in that class because \r\nwhen you get to college you’re going to need to know that.’ \r\nAnd I’m like ‘I’m not going to college.’  But you know I \r\nstill wanted to do well. (cough)  My father’s oldest sister \r\ntalked to him.  She was a dental assistant in Birmingham, \r\nAlabama and she talked to my father and she called me and \r\nsaid ‘would you consider going to school to be a dental \r\nhygienist?  Your father will pay for your education.’  See \r\nI paid for my last year of high school. I lived with my \r\naunt but I paid for my clothes, such a good feeling.  I \r\nhelped some with my education.  I used the war bonds, money \r\nthat I saved.  And that was a great lesson to learn, that I \r\ndid gain, how to save and the importance of having some \r\nextra money.  And I’d like to be able to get over the fear \r\nnow of not having enough.  You know, I’ve never accumulated \r\na lot.  And that’s just a fear older people have and I want \r\nto be sure that you have this saying. Maybe someone else \r\nhas given it to you.  It sounds more like the Great \r\nDepression, but I have read that it came from World War II. \r\nAnd the saying is ‘Use it up, wear it out, make it do or do \r\nwithout.’ And I say that all the time.  One mother who came \r\n----------------Page (38) Break----------------\r\n 40 \r\nwith her 5\r\nth\r\n class to the museum in Rome to hear our talk \r\nsaid ‘would you please let me write that down.’  I saw her \r\nagain sometime later and she said ‘that’s up on my \r\nrefrigerator.’ But I still do that.  It’s very difficult \r\nfor me to walk into a shop and buy two dresses of the same. \r\nYou know-I (shrug) It didn’t have that effect on my sister \r\nso it’s a difference in personalities. We don’t all react \r\nthe same. \r\n \r\nDe Mare:  One last question, because it just occurred to \r\nme. What did your mother do after the war? Because she \r\ndidn’t- \r\n \r\nTucker:  No she worked in a department store in Savannah \r\nthat’s no longer there.  It was Adler’s.  It was a classic \r\nstore owned by a Jewish family.  That’s where she worked \r\nfirst and then in Atlanta, we moved... Yes she always worked. \r\nAnd it was interesting; my mother thought work was a curse \r\nbecause women didn’t work.  They were supposed to stay home \r\nand take care of their families and be supported.  She \r\nreally did not like- I don’t know how I got my attitude, \r\nmaybe, I don’t know I just have always loved work because I \r\nliked the work that I was doing.  But it was also \r\ninteresting, it’s not important but when she knew she could \r\n----------------Page (39) Break----------------\r\n 41 \r\nretire and draw her social security, she started liking the \r\nwork. She enjoyed it all; it was funny how that works.  But \r\nshe was a hard worker and she was courageous.  She really \r\nwas. \r\n \r\nDe Mare: Sounds like it... \r\n \r\nTucker:  And she worked 12 hours a day 6 or 7 days a week \r\nand no pay sometimes.  If people didn’t have money to pay \r\ntheir telephone bill, the owner of the company didn’t have \r\nmoney to pay the operators. They had a bed in the room \r\nwhere the equipment was.  I used to work there too some so \r\nshe could go home for an hour as long as Mr. Fain, the \r\nowner didn’t know it. \r\n \r\nDe Mare:  Well thank you so much.  This has been \r\ndelightful.  It was a privilege to meet you.  \r\n----------------Page (40) Break----------------\r\n"}}]