[{"type":"add","id":"mary-anne-kniska-diamond","fields":{"identifier":"ROSIE_INTERVIEW_011","url":"/interviews/mary-anne-kniska-diamond","label":"Mary Anne Kniska Diamond","description":"Mary Anne moved to Akron, Ohio to work for Goodyear Aircraft, eventually becoming the supervisor of the \"Goodyear Aircraft Women's Squadron.\"  ","image":"/images/ROSIE_INTERVIEW_011-interview-thumbnail.jpg","content":" \r\n \r\n \r\nMary Anne Kniska Diamond \r\n \r\nThe Real Rosie The Riveter Project \r\n \r\nInterview 11 \r\n \r\n \r\n \r\n \r\n \r\n \r\nInterview Conducted by \r\n \r\nAnne de Mare & Kirsten Kelly \r\n \r\nJune 27, 2010 \r\n \r\nARRA Convention, Nashville, Tennessee \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\nFor The \r\n \r\nTamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n----------------Page (0) Break----------------\r\nInterview: Mary Anne Kniska Diamond \r\n \r\nInterviewers: Anne de Mare & Kirsten Kelly \r\n \r\nDate:  June 27, 2010 \r\n \r\nPlace:  Nashville, Tennessee \r\n \r\n \r\nDiamond:  My name is Mary Anne Kniska Diamond, and I was \r\nborn in Clarksburg, West Virginia in May of, uh, nineteen \r\nand twenty-two. \r\n \r\nDe Mare:  And, uh, could you tell me a little bit about \r\nyour childhood: How many children were in the family, what \r\nyour parents did? \r\n \r\nDiamond:  Our family was probably, uh, little more than \r\naverage.  There were ten of us in... in the family.  I had, \r\nuh, two sisters and seven brothers and, uh, my father was a \r\ncoal miner and, uh, my mother and dad both were, uh, \r\nimmigrants from Czechoslovakia.  They made their way over \r\nhere- my mom was fifteen, my dad was nineteen- and they met \r\nin, uh, Menonga, West Virginia, when my mother came over to \r\nvisit her sister.  They were married and were married all \r\nthose years, uh, and, uh, we had a big family.   \r\nUh, we did a lot of, uh, self-perpetuating things.  \r\nLike if you... if your job was to, uh, hang the clothes or to \r\n----------------Page (1) Break----------------\r\nhelp wash the clothes, we did that.  You had to have that \r\nkind of cooperation in those days.  That was before, uh, \r\nyour automatic, uh, washers, and I remember when we got our \r\nfirst automatic washer, for everybody was happy.  And we \r\nhad... we had a great childhood. We went to, uh, Catholic \r\nschool.  We walked to school, which was probably, uh, \r\napproximately a mile and a quarter, back and forth.  But at \r\nthe time the streetcars were running and, uh, one of our \r\nconductors- he was an Irishman- uh, would stop and pick us \r\nup if he saw us walking home.  So, we always appreciated \r\nthat.  And, uh, I went on to, um, high school and, uh, \r\nstarted to work as a record librarian at St. Mary’s \r\nHospital in Clarksburg, West Virginia, until the war \r\nstarted. \r\nAnd then a friend of mine suggested we do something \r\nfor the defense since all of the guys were gone.  So we \r\ncame to Akron, uh, Ohio, and immediately got a job at \r\nGoodyear Aircraft.  And, uh, during that time they were \r\nforming the, uh, Goodyear Aircraft Women’s Squadron, which \r\nwas all of...  They had one for the men, where they worked \r\nevery place, and they started it for the women.  And we \r\nwere trained to go any place in any of the plants and be \r\nable to take right up if there were absenteeism or illness \r\nand so forth.   \r\n----------------Page (2) Break----------------\r\n00:03:15:02------------------------------------------------ \r\n \r\nDiamond:  (Con’t) So we went to school for a year.  We also \r\nworked eight hours and had three hours of schooling each \r\nweek.  So if you were on seven to three shift you went to \r\nschool after three.  So, they were long days.  But we had \r\ngraduation and, uh, uh, then I was placed in a supervisory \r\ncapacity where we had what we call ‘The Squad House’, uh, \r\nand that’s where all the calls would come in if there was \r\nabsenteeism on the line and so forth.  So I was on \r\nsupervision with a hundred and twenty-six women, which we, \r\nuh, dispensed all over the plants if they were needed.  And \r\nif they weren’t needed, they studied.   \r\nSo, uh, I was there for, uh, until right after the \r\nwar.  Uh, the reason I came home was because my mother and \r\nfather were both ill and, uh, uh, started to, uh, work at, \r\nuh, for a doctor and, uh, he was a medical internist and I \r\nworked for him for thirty years.  So, what else do you want \r\nto know? \r\n \r\nDe Mare:  Well- that was a lot of information very fast.  \r\nSo... so you... you were trained to do all the different work \r\non the aircraft. \r\n \r\n----------------Page (3) Break----------------\r\nDiamond:  Right. \r\n \r\nDe Mare:  So tell me some of the things you were trained to \r\ndo. \r\n \r\nDiamond:  Well, the very first thing we had to do was the \r\nnomenclature.  We had to know what was... what was the wing, \r\nand what was in the cell, and what was the wheel in the \r\nbrake and so forth.  So, uh, that was in our schooling and \r\nyou... you had to take a test to get on the squad.  They \r\njust... the... the lady I went up there with, uh, she didn’t \r\nmake it.  She... but I don’t think she was that interested in \r\ngoing on.   \r\nBut, uh, uh, we learned the different, uh, jobs like \r\nriveting- you know Rosie the Riveter- we learned how to use \r\na riveter or use a... the gun without ruining the rivet, \r\nbecause if it wasn’t just right they were thrown out.  And \r\nwe learned a hang form, uh, different parts of the plane \r\n‘cause when they would come out of the factory they weren’t \r\nflush a lot a times.  So they had... you had to pound it in a \r\ncertain place to make it conform.  Plus, we did, uh, we \r\ncould go to any of the offices and work.  So you learned \r\njust a little bit about everything. \r\n \r\n----------------Page (4) Break----------------\r\n00:05:49:08------------------------------------------------ \r\n \r\nDe Mare:  Wow.  And what kind of aircraft did the Goodyear \r\nCraft Company make?   \r\n \r\nDiamond:  We made the famous F6F Corsair, the one whose \r\nwings folded up.  It was used in, uh, the, uh, Pacific \r\nTrain... that’s when the Japs... That plane was, uh, one of the \r\nreasons that we won the war in the Pacific, because they \r\nwere so versatile.  I mean they could do just about \r\nanything with them.  And, uh, we made, uh, all of the parts \r\nof the plane with the exception of... of the motor.  The \r\nmotor was made in Philadelphia, but, uh, uh, we did \r\neverything.   \r\n \r\nDe Mare:  And you said you were the... you supervised a \r\nhundred and twenty-six women. \r\n \r\nDiamond:  Right. \r\n \r\nDe Mare:  And these hundred and twenty-six women were \r\ntrained as you were... \r\n \r\nDiamond:  Right. \r\n----------------Page (5) Break----------------\r\n \r\nDe Mare:  ...to do all different... \r\n \r\nDiamond:  Absolutely. \r\n \r\nDe Mare:  ...kinds of jobs and send out. \r\n \r\nDiamond:  Absolutely. \r\n \r\nDe Mare:  And you were known as the... the Women’s Squadron? \r\n \r\nDiamond:  The Goodyear Women’s Squadron. \r\n \r\nDe Mare:  Now, was it unusual that a woman would be \r\nsupervising all those people? \r\n \r\nDiamond:  Might... might not have been so unusual but it was \r\nunusual in the... in the fact that you had to know where to \r\nsend these women when the calls came in, because if there \r\nwas absenteeism on the line or someplace where they needed \r\nhelp, you had to know, uh, just about what these gals could \r\ndo.  (Coughs) Excuse me.   \r\n \r\nDe Mare:  Sure. \r\n----------------Page (6) Break----------------\r\n \r\nDiamond:  But they were... they were trained also so it was \r\nno problem to send these people out on the job because you \r\nknew that it could be done. \r\n \r\n00:07:21:21------------------------------------------------ \r\n \r\nDe Mare:  Now can you talk a little bit... ‘cause you were \r\nborn in 1922 you said. \r\n \r\nDiamond:  Mm-hm. \r\n \r\nDe Mare:  So you grew up in the heart of the Depression... \r\n \r\nDiamond:  Right. \r\n \r\nDe Mare:  ...in West Virginia. \r\n \r\nDiamond:  Absolutely. \r\n \r\nDe Mare:  And your father was a coal miner... \r\n \r\nDiamond:  Right. \r\n \r\n----------------Page (7) Break----------------\r\nDe Mare:  ...and there were a lot of you. \r\n \r\nDiamond:  Right. \r\n \r\nDe Mare:  Um, can you talk a little bit about what your \r\nfinancial situation was, and then how being a Rosie and \r\nearning money at... at Goodyear, how that changed your, um, \r\nfinancial life. \r\n \r\nDiamond:  Well, I don’t know that it had a great, uh, \r\neffect on the income, uh, because the coal miners at that \r\ntime did not make the money that they make today.  But, uh, \r\nthe, uh, the fact that you could go out and earn some \r\nmoney, uh, was great because you could spend some of it on \r\nyourself and the rest of it you handed over to mom.  And \r\nthat helped keep everybody else going, and not only me, but \r\neverybody in the family. \r\nMy brothers, uh, worked different jobs and, uh, uh, my \r\none brother- next to the oldest- went on to become captain \r\non the tanker, and, uh, self-taught, and was in the war, \r\nuh, at, uh, on the Pacific and in the, uh, Atlantic.  And \r\nthe tankers would go to Saudi Arabia and get, uh, loaded, \r\nand then they would join the fleet.  But they had to, uh, \r\nuh, stay in what they called  ‘the coffin’s corner’, so in \r\n----------------Page (8) Break----------------\r\ncase they were strafed and caught on fire that it wouldn’t \r\nharm the fleet.   \r\nAnd, uh, my, uh, three other brothers were all in \r\nservice and, uh, uh, they served in Europe and, uh, no- had \r\nfour brothers instead of three, because my one brother was, \r\nuh, in the marines and, uh, he was in for the total time \r\nand he was all over the Pacific.  The other two were in, \r\nuh, European Theatre. \r\n \r\n00:09:28:14------------------------------------------------ \r\n \r\nDe Mare:  Okay.  Um, can you talk a little bit about what \r\nit was like for you working, making the machinery that was \r\ngoing to help, you know, the soldiers.  Can you talk about \r\nyour connection to the war effort and how that made you \r\nfeel? \r\n \r\nDiamond:  Well, at the time we started we really didn’t \r\nknow how much effect that it actually would have until \r\nafter we were out.  But we took the men’s jobs and without \r\nthat, uh, without the women being there, it... we wouldn’t \r\nhave been able to produce as much as we... as the United \r\nStates could.  So this way there was not really a lot of \r\nlet-up in the production because women learned they- a lot \r\n----------------Page (9) Break----------------\r\nof people thought, well, maybe we couldn’t do it, but we \r\ndid. \r\n \r\nDe Mare:  Did you think you couldn’t do it? \r\n \r\nDiamond:  No!  (Laughs)  No.  No, because when we went to \r\nsquad school that was the first thing they did, they \r\ninstilled the confidence.  They said, “Now, you know, don’t \r\nthink that just because you’re a woman you can’t do this, \r\nbecause you can.”   \r\n \r\nDe Mare:  So that was in the school you... you... you learned \r\nthat push. \r\n \r\nDiamond:  In the squad school.  Yeah. \r\n \r\nDe Mare:  Okay. \r\n \r\nDiamond:  And your own, you know, your own personal \r\nfeelings, “If he can do it, I can do it, too.”   \r\n \r\nDe Mare:  How did you, how did you find out about... Can you \r\ntell me the story about how you found out about the work \r\nagain? \r\n----------------Page (10) Break----------------\r\n \r\n00:10:49:04------------------------------------------------ \r\n \r\nDiamond:  It was in our, uh, evening newspaper.  Uh, the \r\nunemployment office was looking for people to work in the \r\ndefense plants.  So, (I thought) why not, why not take a \r\nchance?  So... which we did.   \r\n \r\nDe Mare:  Now, um, coming from West Virginia, going to \r\nOhio, can you talk about that as a young woman?  How that... \r\nthat shift was for you? \r\n \r\nDiamond:  Well, the first thing, uh, first thing we were \r\ncalled were ‘hillbillies’.  “Well, here come those \r\nhillbillies.”  That... that was another phase that... it was... \r\nit was really funny because a lot of people, uh, had no \r\nidea what... what they were saying when they said \r\n‘hillbillies’.  But, uh, uh, we... we... I think and I... I’m not \r\npositive, but an awful lot of the... the women that worked \r\nwere from West Virginia, Kentucky, Ohio, Michigan.  And \r\nthat... that- in our part of the country- I’m sure there were \r\nothers, too.  But, uh, it made a big difference and, \r\n‘course, we made better money, too, you know.  So, uh, it \r\nwas... it was a two-prong thing.  It was adventure and money. \r\n----------------Page (11) Break----------------\r\n  \r\nDe Mare:  I want you to go... I want you to expand on that \r\nbecause when you said they... they were... they didn’t know \r\nwhat they were saying when they were saying ‘hillbilly’. \r\n \r\nDiamond:  Right. \r\n \r\nDe Mare:  So, from someone from West Virginia, what is a \r\n‘hillbilly’?  \r\n \r\nDiamond:  Just a plain, old West Virginian.  And the, uh, \r\nuh, the term ‘hillbilly’ has come down over the years.  \r\nThat’s what we still call each other, ‘hillbillies’, when \r\nwe want to.   But for different people it has different \r\nconnotations.  But, uh, we always referred... you know, even \r\nour football team is ref... er... referred to as the ‘West \r\nVirginian Hillbillies’.  So it really doesn’t mean a whole \r\nthing, it’s just, uh, something, uh, uh, that has been used \r\nforever.   \r\n \r\nDe Mare:  Now, you said that when you got your first money, \r\nyou said you... you were able to spend a little money on \r\nyourself, and then you said, gave the rest back to your... \r\nyour mother. \r\n----------------Page (12) Break----------------\r\n \r\nDiamond:  Right. \r\n \r\nDe Mare:  Do you remember what you did buy for yourself as \r\na young woman? \r\n \r\n00:12:56:04------------------------------------------------ \r\n \r\nDiamond:  Anything I wanted.  Things were a lot cheaper \r\nthen.  And we’d go down to the best store in Akron and... and \r\nthen get a good lookin’ outfit, you know.  Uh, but, uh, \r\nactually we didn’t have to have that many- excuse me- that \r\nmany clothes, because we wore coveralls at the plant.  And \r\nyou know those were easily laundered, and just hang ‘em up, \r\nand then you put ‘em on just like, after they dry, you put \r\n‘em on.  That’s what you wore.  They were pretty good \r\nlookin’ things, too. \r\n \r\nDe Mare:  Yeah.  And, uh, was that the first time you’d \r\nworn slacks as a... as a young woman or had you... did you wear \r\npants as a woman before you worked there? \r\n \r\nDiamond:  Not... not really, no.  My mom didn’t approve of \r\nthat.  But, uh, the coveralls were great, and I mean, to \r\n----------------Page (13) Break----------------\r\nthis day I wear denims, uh, because they’re very \r\ncomfortable.  But they... they were one piece, uh, coveralls, \r\nwe’d call them.  So actually, it was easy, you know, you \r\njust jumped into those and you didn’t have to worry about \r\nanything else.  Just comb your hair and put some makeup on, \r\nyou were ready to go. \r\n \r\nDe Mare:  When you moved to Akron, do you remember where \r\nyou lived?  Like did you live in a room, did you rent a \r\nroom, did you rent a house?  How did that work? \r\n \r\nDiamond:  Well, Goodyear had a, uh, uh, task force that \r\nlooked out for the people coming in, and they got us an \r\napartment at, uh, on Center Street, not too far from \r\ndowntown Akron.  And, uh, we had... I had that apartment all \r\nthe time I was there, even after my first roommate left, \r\nuh, one of the girls from the squad from West Virginia was \r\nlooking for a place, so she moved in with me and we’ve been \r\nfriends ever since.   \r\nAnd, uh, uh, it was, uh, we didn’t have a car, of \r\ncourse, but a lot of the men who worked at the plant had to \r\ncome down Market Street, so we arranged to have them pick \r\nus up regardless of what shift we were on, ‘cause there was \r\nalways somebody coming down Market Street to come into the \r\n----------------Page (14) Break----------------\r\ncenter of town, so we didn’t have to worry about \r\ntransportation.   \r\n \r\n00:14:57:19------------------------------------------------ \r\n \r\nDe Mare:  And it was... it... was it organized?  It was just \r\ncasual, you would just... \r\n \r\nDiamond:  No, it was... it was pretty much organized, but if \r\nyou didn’t like it, you didn’t have to do it.  But I... all I \r\nhad to do was walk out of my apartment and go not even a \r\nquarter of a block down to the corner and, uh, uh, Sam \r\nKramer would pick me up, uh, regardless of what shift I was \r\non, because they were on the same rotations, so it was no \r\nproblem. \r\n \r\nDe Mare:  Can you explain what the shift rotations were \r\nabout?  Can you explain that? \r\n \r\nDiamond:  There were three shifts at Goodyear: seven to \r\nthree, three to eleven, and eleven to seven.  That was the \r\nnight shift.  And when we went to school, we had to... to \r\nwork those shifts, and then on our off hours or... is when we \r\nwent to... to school.  But it was set up at the plant, and \r\n----------------Page (15) Break----------------\r\nour instructors were all there at the plant, so we didn’t \r\nhave to do anything extra, it just took more time. \r\n \r\nDe Mare:  What was the hardest thing you had to learn how \r\nto do at the plant?  Was there something that you just... you \r\ndidn’t think you’d be able to learn how to do?   \r\n \r\nDiamond:  Nothing that I can remember.  Because we had \r\ngood... we had good, uh, uh, they called them lean men and, \r\nuh, they would tell you what to do.  And, uh, that wasn’t \r\nhard to do as far as that was concerned.   \r\n \r\nDe Mare:  I think it’s amazing that you learned to do all \r\nof those different jobs... \r\n \r\nDiamond:  You had to... \r\n \r\nDe Mare:  ...I mean, you had... you had to be able to go be \r\nflexible enough to go... \r\n \r\nDiamond:  Right. \r\n \r\nDe Mare:  ...from one to another to another. \r\n \r\n----------------Page (16) Break----------------\r\n00:16:25:14------------------------------------------------ \r\n \r\nDiamond:  Well, my most enjoyable time at Goodyear was in \r\nthe flight hanger because I was on inspection with, uh, one \r\nof the, uh, uh, Goodyear, uh, inspectors.  And they... they \r\nwould instruct you- at first- what to look for because when \r\nthe, um, the F6F was completed, the test pilots would test \r\nthem at, uh, Wingfoot Lake which was right outside of \r\nAkron.  And... and if there was anything wrong, they would \r\nbring them back into the plant and they called that \r\n‘crabbing out the airplane’.  It was to see if there were \r\nany defects and then it was, uh, our job to fix those \r\ndefects before they were sent to the Pacific.   \r\n \r\nDe Mare:  Oh.  Now, what was the... what... what was it like to \r\nhave all... ‘cause women came from all over to work... \r\n \r\nDiamond:  Right. \r\n \r\nDe Mare:  ...in that... what was the social life like there, \r\nwith all of the young women? \r\n \r\nDiamond:  We had a blast.  We had... one of our bosses had a, \r\nuh, dance hall in Ravena, and every Saturday night he had a \r\n----------------Page (17) Break----------------\r\nsquare dance.  So he would load us up in the car and we’d \r\ngo to the square dance on Saturday night.  Uh, and all... one \r\nof my, uh (coughs), excuse me... \r\n \r\nDe Mare:  Do you want a glass of water?  Would you get me \r\na... \r\n \r\nDiamond:  Yes, please. \r\n  \r\nDe Mare:  Okay.  I see. \r\n \r\nKelly:  (unintelligible) \r\n \r\nDiamond:  Oh, thank you very much.  \r\n \r\nKelly:  (unintelligible) \r\n \r\nDe Mare:  (unintelligible) \r\n \r\nDiamond:  One of the first things I did when we got to \r\nAkron was to look up a church because, uh, I’m Byzantine \r\nCatholic, which was at the time sort of, uh, uh, odd.  But \r\nthere was a Byzantine Church in Akron, and I went to church \r\non... on the first Sunday, and the man who was the cantor in \r\n----------------Page (18) Break----------------\r\nthe church, he probably noticed this little hillbilly \r\nsitting back there, so he... he came back and, uh, asked me, \r\nuh, you know, where I was from and so forth, and he took me \r\nunder his wing, took me home and I had dinner with them and \r\nthey were life long friends.  They... they... they were just \r\nwonderful.   \r\n \r\n00:18:40:04------------------------------------------------ \r\n \r\nDe Mare:  What were some of the... were... were... were you \r\nexposed to, um, I guess what I’m asking... were you exposed \r\nto people you hadn’t met before?  I, I mean... \r\n \r\nDiamond:  All the time. \r\n \r\nDe Mare:  And what was that like for you as a young person? \r\n \r\nDiamond:  Well, it... it really didn’t... didn’t affect me too \r\nmuch because there was nobody that was shy in our house, \r\nyou know, uh, you’d, uh, you met all kinds of people.  Now, \r\nsome you liked and some you didn’t.   But you knew how to \r\navoid that.  But most of the people as a general rule are \r\nvery, very nice if you are.   \r\n \r\n----------------Page (19) Break----------------\r\nDe Mare:  Um, what about, um, dating?  Were there any, um... \r\nI know a lot of the men, of course, were gone, but what was \r\nthe, uh... \r\n \r\nDiamond:  Oh, we... we don’t want to go into all of that.  \r\n \r\nDe Mare:  Oh, yes we do.  It’s part of your life. \r\n \r\nKelly:  It’s our favorite part. \r\n \r\nDe Mare:  It’s part of your life.  Like, I’m just curious.  \r\nPeople don’t understand. \r\n \r\nDiamond:  Well, at that time, you know, you didn’t... you \r\ndidn’t actually have to have a date to go to the dances and \r\nstuff.  Uh, we, uh, we lived close to, uh, Summit Park, \r\nand, uh, they had a lot of dances down there and we’d go \r\ndown there and that that’s how you got to meet people.  And \r\nespecially, as you say, ‘dating’, there... we were young \r\nenough that a lot of it didn’t, uh, affect us that much.  \r\nBut, uh, uh, I... I... I just had a good time with a... a lot of \r\nguys.  Period.     \r\nAnd, uh, uh, it was a different time than it is now, \r\nyou know, this, uh, I was... I was just trying to remember \r\n----------------Page (20) Break----------------\r\nsome of the... some of the dumb things that we did that, \r\nwell, you wouldn’t ee... even think of doing it today.  But \r\nwe’d go down to the park, just to dance.  And, uh, you \r\ndidn’t have to go by yourself, I mean, there might be two \r\nor three girls, and, uh, uh, you didn’t have to have a date \r\nto... to... to go a lot of places.  Which you... you wouldn’t do \r\nthat today; you wouldn’t go out by yourself at all today.  \r\n \r\n00:20:41:09------------------------------------------------  \r\n \r\nDe Mare:  That’s interesting.  Um, can you talk a little \r\nbit about, uh, what happened when the war was over?   \r\n \r\nDiamond:  When the war was over, I remember how jubilant \r\nevery was... was because it was over.  And I could have \r\nstayed at Goodyear in the Industrial Engineering \r\nDepartment, but my folks were both sick and that’s why I \r\nwent back to Clarksburg.   \r\n \r\nDe Mare:  Was it unusual that you could have stayed in the \r\nengineering department?   \r\n \r\nDiamond:  Well, uh, no, not really.  Not really.  The, uh, \r\nthe man, uh, Mr. Zimmerman, who was in charge of, uh, of, \r\n----------------Page (21) Break----------------\r\nuh, the department that I was in, asked me if I wanted to \r\nstay because they kept on manufacturing, uh, planes.  Not... \r\nnot on the scale that they had before, but then they went \r\ninto other, uh, parts that they used the plane for.   \r\n \r\nDe Mare:  Do you... can you think about, um, is... are there \r\nways that being a Rosie, um, do you think affected you or \r\nchanged you, um, that you could talk about? \r\n \r\nDiamond:  Well, I think, given the opportunity that I had, \r\nat, uh, eighteen years of age and to be able to get on the \r\nsquad, and to go all over the plant and work with people \r\nwho were a lot more educated than I was, to me, it was a \r\nboon, and it has paid off over the years.   \r\n \r\nDe Mare:  In what ways?  I’m just curious. \r\n \r\nDiamond:  Well, uh, the, uh, you could... you... you weren’t \r\nintimidated by anything, you know.  If you wanted to go \r\napply for a job, that’s what you did.  Or if you didn’t \r\nlike it, you didn’t... you weren’t afraid to quit.  So, uh, \r\nit... it taught us a lot that there’s...  That was a time of \r\nrationing, and, uh, I’m one...  One of the gals today talked \r\nabout her shoes that left green, uh, things.  So we had the \r\n----------------Page (22) Break----------------\r\nfood stamps and so forth.  But after the war was over it \r\nwas... it was totally different.  It took a while to get back \r\nin the sw... swing of things, but, uh, it all came about \r\nnormally. \r\n \r\n00:22:50:16------------------------------------------------ \r\n \r\nDe Mare:  Now, um, you had brothers in the military.   \r\n \r\nDiamond:  Mm-hm. \r\n \r\nDe Mare:  Um, and did you feel really connected to them \r\nwhen you were working?  \r\n \r\nDiamond:  Oh, sure.  Sure. \r\n \r\nDe Mare:  Can you talk about that a little bit? \r\n \r\nDiamond:  Well, my... my oldest brother was in the Battle of \r\nthe Bulge, and that was the... the hardest one, I think.  My \r\nnext-to-the-oldest brother was, I told you, was captain on \r\nthe submarine at... on a tanker, uh, which was a precarious \r\njob at the time.  Then, uh, my-next-to-oldest brother was, \r\nuh, in the army, and I had a... a brother that was a, uh, \r\n----------------Page (23) Break----------------\r\nretired... he was in the marines until he retired, and, uh, \r\nhad two other brothers that served in Europe.  And, uh, as \r\nI say, we were a close-knit family, we had a big family, \r\nand it was a joyous thing when they would come home because \r\nthey always brought stuff home for the kids.  Say, we... we \r\nhad, uh, even today, uh, we have some of the souvenirs that \r\nthey brought home for us.  They didn’t forget us about... \r\nforget about us even though they were over there. \r\n \r\nDe Mare:  Wow, that’s beautiful.  Um, do you... do you think, \r\nI mean, I think a lot of, uh, you know, the young woman \r\ntoday standing up and saying that she’s going to vet school \r\nand she wouldn’t have been able to have these opportunities \r\nif the Rosies hadn’t kind of paved the way.   \r\n \r\nDiamond:  Mm-hm. \r\n \r\nDe Mare:  And obviously you have, um, how do you feel like \r\nit... it has affected the younger generation? \r\n \r\nDiamond:  Well, they, uh, uh, some people still today don’t \r\nbelieve that the women did what they did.  I... I know when, \r\nuh, we went back home, my sister worked for the National \r\nCarbon, and the man who was, uh, the plant manager, was \r\n----------------Page (24) Break----------------\r\nasking about the war effort and everything, and she told \r\nhim that, uh, I... I had been in industrial engineering, he \r\nsaid, “Ah, there are no women industrial engineers.”  So, I \r\nmean, that was one of the things you put up with and say, \r\nwell, check it out and see, because it was.  But that’s \r\nwhen women did get a start in... into, uh, different \r\npositions.  They weren’t just housewives and, uh, mothers \r\nand so forth.  They learned how to do an awful lot of \r\nthings.   \r\n \r\n00:25:14:16------------------------------------------------ \r\n \r\nDe Mare:  Questions from the... from the... from the group?   \r\n \r\nKelly:  Well, we kind of missed half the interview, so we... \r\nit’s hard ‘cause we don’t know... \r\n \r\nDe Mare:  No, I... \r\n \r\nKelly:  You’re great. \r\n \r\nDe Mare:  No, it’s wonderful to hear you talk.  Is there \r\nwh... was... was there any kind of, um, do you have any \r\n----------------Page (25) Break----------------\r\nanecdotes, any... any stories, um, about little things that \r\nhappened when you were at Goodyear, or, um... \r\n \r\nDiamond:  I have scars to show it.   \r\n \r\nDe Mare:  Tell... tell me the story.  How’d you get the \r\nscars? \r\n \r\nDiamond:  Well, we were crabbing out, which was inspecting \r\nthe wing on one of the F6F’s, there was a little strip of \r\nmaterial that went along, uh, one edge, so that the wind, \r\nwhen the wings came down, that they were airtight.  And I \r\nwas checking out the phenolic strip on it, and there was a \r\nfella in the cockpit, didn’t realize that we were working \r\non it, and some way he let... let something go with one of \r\nthe, uh, uh, instruments that controlled the wing. \r\nFortunately, there was another man that I was working \r\nwith that was right by me, and when it came down, it got \r\nthese two fingers here, but he was able to stand under that \r\nso it didn’t lock in, because if it had, it would’ve taken \r\nthem right off.  So that... that was my... I can tell that \r\nbecause I got the scars to show that.  \r\n \r\n \r\n----------------Page (26) Break----------------\r\n00:26:39:21------------------------------------------------ \r\n  \r\nDiamond:  (con’t) But, uh, oh, there were... there were a lot \r\nof things that happened.  Uh, you know, funny, and... and sad \r\nand, uh, but I felt the women did a tremendous job coming \r\nup with not... having to learn everything.  That was the \r\nthing.  Because I worked along with the men who were all \r\ngraduate engineers, and... but they were wonderful to work \r\nwith.  They would show you how to do it and then if you \r\nmade a mistake, or they thought maybe your time study \r\nwasn’t just right, they would say, “Well, now look here, \r\nMary Ann, you know, maybe you were too harsh on this, uh, \r\nstudy.  Maybe you were too lenient on another study.”  Si \r\nthat way you were able to equalize what needed to be done. \r\n \r\nDe Mare:  Yeah.  Is there anything looking back at that \r\nyoung woman who was, you know, so, uh, I don’t know, so, so \r\nbrave to kind of go out and... and get those jobs and... and \r\nlearn all that... is there anything you’d like to say to her, \r\nlike looking back? \r\n \r\nDiamond:  No, I thought it was a great myself and I never \r\nregretted a minute of it because we... we had a... we worked \r\nhard but we had a good time because our squad class had, \r\n----------------Page (27) Break----------------\r\nuh, uh, they had a, um, uh, organization that all the \r\nwomen- I think they must have had about five or six squad \r\nclasses.  We had a softball team, we could go out to dinner \r\nand so forth, and we didn’t have to be afraid because we \r\nhad people to go with.  So, uh, I have no regrets about \r\nanything that I did. \r\n \r\nDe Mare:  Fantastic.  And is there anything you’d just like \r\nto say to the younger generation? \r\n \r\nDiamond:  Hopefully, they will take a look at Rosie the \r\nRiveter and learn something from that because I’m afraid \r\ntoday there’s been so much eliminated that the younger \r\ngeneration doesn’t really know a lot about what the women \r\ndid in World War II.   \r\n \r\nDe Mare:  Terrific.  Terrific.  Anything else? \r\n \r\nKelly:  Yay. \r\n \r\nDe Mare:  Thank you, Mrs. Diamond.  You were wonderful. \r\n \r\n \r\n \r\n \r\n----------------Page (28) Break----------------\r\n \r\n \r\n----------------Page (29) Break----------------\r\n"}}]