[{"type":"add","id":"mathauser-twins","fields":{"identifier":"ROSIE_INTERVIEW_019","url":"/interviews/mathauser-twins","label":"The Mathauser Twins","description":"Wilma and Amelia Mathauser are twins but don’t ask them who was born first, because they don’t know.","image":"/images/ROSIE_INTERVIEW_019-interview-thumbnail.jpg","content":" 1 \r\nWilma and Amelia Mathauser \r\n \r\nThe Real Rosie the Riveter Project \r\nInterview 19 \r\n \r\n \r\n \r\nInterview Conducted by  \r\nAlexandra Naides and Elizabeth Hemmerdinger \r\nJune 26, 2010 \r\nNashville, Tennessee  \r\n \r\n \r\n \r\nFor The \r\nFor the Tamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n----------------Page (0) Break----------------\r\n 2 \r\nInterview: Wilma and Amelia Mathauser \r\nInterviewers: Alexandra Naides and Elizabeth Hemmerdinger \r\nDate: June 26, 2010 \r\nPlace: Nashville, Tennessee \r\n \r\nWilma: I’m Wilma of the Mathauser twins. And this is my \r\nsister Amelia.  We never really knew which one of us was \r\nborn first. Our mother told us that Amelia was born first \r\nand I was the youngest up until our dad and then after that \r\nshe changed it. And on our birth certificate, it doesn’t \r\ntell us who is the older. Isn’t that a shame? \r\n \r\nAmelia:  It doesn’t matter. I am me and you are you...Right. \r\n \r\nWilma: So anyway, we were born in Burwell, Nebraska, a \r\nlittle town in the sand hills of Nebraska and graduated \r\nfrom high school. And there certainly not any opportunities \r\nin a small town like that so we took the civil service exam \r\nin Grand Island to try and get jobs for the government.  \r\nAnd we had an older sister, Marie and she and Amelia got \r\njobs and they said I didn’t pass but I think I did.  So \r\nthey got to go to Washington DC and work and I stayed in \r\nBurwell and tried to earn some money to try and get out of \r\nBurwell.  \r\n----------------Page (1) Break----------------\r\n 3 \r\n \r\nAmelia: But uh, I thought it was good that Wilma was with \r\nmy parents when our oldest, only brother was lost in an \r\nairplane, a B-17.  May 6, 1942. And no- and no trace of the \r\nplane was ever found.  Ten young men. My mother would never \r\nbelieve that they never found- that he would never be \r\nfound. So that was kind of sad.   \r\n \r\nWilma: Yes that was probably true.  I was there with mom \r\nand dad when they found that out.  It was an awful time in \r\nall of our lives. \r\n \r\nRelative:  So Amelia, how long were you in DC? \r\n \r\nAmelia. We went on the 12\r\nth\r\n of February and I left in July. \r\nMy husband to be had gone to Washington sate to work and he \r\nconvinced me to go out there. Leave Washington and go \r\nSeattle to work at Boeing to be near him. So that’s what I \r\ndid. \r\n \r\nRelative:  Then Uncle Wilber convince mom to come?  Or you \r\ndid? \r\n \r\nWilma: Probably- \r\n----------------Page (2) Break----------------\r\n 4 \r\nRelative: You were looking for an escape. \r\n \r\nWilma: Yea and Wilber said, “come to Seattle and get a job \r\nat Boeing.” So my girlfriend and I went out to Seattle with \r\nmy boyfriend. \r\n \r\nRelative:  When you each left Burwell that was a big thing, \r\nright?  Had you ever been out of the county before? \r\n \r\nAmelia: Out of the county but I had never even been to \r\nOmaha before we went to Washington DC. \r\n \r\nRelative: And you left, you didn’t fly, how did you go? \r\n \r\nAmelia: By bus. \r\n \r\nWilma: And I went by bus also. Ella-May and Bob and I, my \r\nfuture husband. \r\n \r\nAmelia:  Then I came home by bus, alone and then to \r\nSeattle. \r\n \r\n----------------Page (3) Break----------------\r\n 5 \r\nRelative: From DC? Oh wow. So when you got out to Boeing \r\nwas there an interview process or was it just they needed \r\nso many people they just hired whomever walked in the door? \r\n \r\nAmelia:  I think so. \r\n \r\nWilma:  I think that they hired. \r\n \r\nRelative: Now, did you have training or did- \r\n \r\nWilma: She did but I didn’t. \r\n \r\nRelative: So what was your training? \r\n \r\n04:02:22-------------------------------------------------- \r\n \r\nAmelia: Sort of like drafting. \r\n \r\nRelative: And what was your position? \r\n \r\nAmelia: I had to belong to the mechanic union but it \r\nactually didn’t involve any mechanics.  We worked on the \r\nradio room of the B-17. Just after the skin was put on and \r\nthe skin that was sticking out would file off and if there \r\n----------------Page (4) Break----------------\r\n 6 \r\nwere any rivets- rivets that were not good, uh drill them \r\nout. And of course we wore bandanas and one time I didn’t- \r\nyou know you don’t look very good in a bandana so I left my \r\nhair sticking out here and I was drilling up there and my \r\nhair got caught in there so I learned my lesson. \r\n \r\nRelative: Ooo...scary.  And you were a riveter, mom? \r\n \r\nWilma: No I was a rivet bucker.  I held the metal on the \r\ninside of the skin on the tip of the wing.  I remember when \r\nwe came to work it was a metal frame for that last half of \r\nthe wing.  And I guess I guess I must have climbed inside \r\nand the rivet bucker put the rivet in and I just held the \r\nmetal up to it. \r\n \r\nRelative:  Did you have gloves? \r\n \r\nWilma: No. \r\n \r\nAmelia:  You had to have it straight didn’t you? \r\n \r\nWilma:  Yes, yes...there were still a lot of young men \r\nworking. \r\n \r\n----------------Page (5) Break----------------\r\n 7 \r\nAmelia: Probably 4Fs weren’t they? \r\n \r\nWilma: Well no, they hadn’t been drafted yet. It was still \r\n1942. And they had to change the names of jobs when women \r\nstarted working.  They must have had vulgar names, very \r\nvulgar names. \r\n \r\nRelative: Ah.  What were the guys like when you were \r\nworking with them? \r\n \r\nWilma:  They were great. Boy, you had a date two or three \r\ntimes but yea, I had my own boyfriend. \r\n \r\nRelative: Good numbers, uh? \r\n \r\nAmelia: I worked under a fella too and he was a nice fella. \r\n \r\n6:22:22--------------------------------------------------- \r\n \r\nAmelia: And I worked with interesting people. I remember a \r\nwoman from England was there. Worked there. \r\n \r\nNaides:  Did those fellas eventually go off to war? \r\n \r\n----------------Page (6) Break----------------\r\n 8 \r\nWilma:  Well you know, we only worked about a year, didn’t \r\nwe. And she an her husband- he got- was being drafted and \r\nwent back to Nebraska- going to go back to Nebraska and \r\nwork for his dad. \r\n \r\nAmelia:  He was a welder on the Liberty ships in Tacoma and \r\nwe lived in Seattle so he had to go 50 miles to work \r\neveryday so he decided well why don’t I move to Seattle to \r\nwork. So he quit that job. Then the draft board noticed him \r\nI think so he was supposed to go for his physical and he \r\ncame down with the mumps that day. So the doctor came to \r\nour apartment to see him twice to make sure it was the \r\nmumps.  So in the mean time, the draft board and him \r\ndecided to come back to Nebraska and help his father farm, \r\nwhich was a very big shock to me.  In high school, I \r\ndecided I didn’t want to go with farmers because I didn’t \r\nwant to live on a farm.  We had a bad impression of farms \r\nbecause our our double cousins lived on a farm in the ‘30s \r\nthings were very rough. \r\n \r\nRelative:  Well that really set your life though because \r\nreally then you spent most of your life on the farm. \r\n \r\n----------------Page (7) Break----------------\r\n 9 \r\nAmelia: So we moved to Nebraska and we were there for 20 \r\nyears until my husband got is had caught in the corn picker \r\nand had to have his right hand amputated. When he was in \r\nthe hospital he decided he wanted to become a- \r\n \r\nWilma: Hospital Administrator  \r\n \r\nAmelia: Hospital Administrator and so then he studied and \r\nbecame a Hospital Administrator.  And we were in a few \r\nlittle towns in Nebraska.  But we finally came back to \r\nBurwell the little town we were born and raised in.  I \r\ncouldn’t believe it. \r\n \r\n08:24:13------------------------------------------------ \r\n \r\nWilma:  But when they left Seattle they talked me into \r\nquitting and coming back to Nebraska too. And so then, I \r\nwent back and married my- \r\n \r\nAmelia: Cowboy \r\n \r\nWilma: My Nebraska Cowboy. And we- \r\n \r\nRelative:  And then you both ended up on the farm. \r\n----------------Page (8) Break----------------\r\n 10 \r\nWilma: No. Ranch. \r\n \r\nRelative: Oh yes the ranch. \r\n \r\nAmelia: She was on a ranch and we were on a farm. \r\n \r\nHemmerdinger:  I’d like to ask you, how much money were you \r\nmaking before you entered the defense work and then, you \r\nknow when you had those jobs? \r\n \r\nWilma: I worked at the Gamble store in Burwell then and I \r\nprobably got three or four dollars a week.  And then they \r\nstarted a tanning factory and you got some wages, 50 cents \r\nan hour maybe so that’s how I was able to save some money \r\nto be able to take the bus trip to Seattle. And and I don’t \r\nremember the wages in- \r\n \r\nAmelia: Seattle?  I don’t either. Oh in Washington DC we \r\nwere paid $1,400 a year, whichever however that comes out. \r\n \r\nRelative: And where did you work in Washington?  You were \r\nat the Pentagon? \r\n \r\n----------------Page (9) Break----------------\r\n 11 \r\nAmelia:  We were in the War Department and yes we moved \r\nover to the Pentagon before it was finished. And I worked \r\nthere a while before I left. So that one lady was here who \r\nworked in the Pentagon. \r\n \r\nRelative: Oh right, yea. \r\n \r\n09:57:16-------------------------------------------------- \r\n \r\nHemmerdinger: But when you went to defense work, did you \r\nhave a sense that you were making more money than you had \r\nbeen making? \r\n \r\nAmelia:  Oh I should say so! \r\n \r\nHemmerdinger:  What did you do with that money? \r\n \r\nWilma: To just live.  When you come there and don’t have \r\nvery much money. Why... \r\n \r\nAmelia: And buy clothes. We didn’t have very fancy clothes. \r\n \r\n----------------Page (10) Break----------------\r\n 12 \r\nWilma:  That’s right, we went shopping and you picked out \r\nsome coats and we had to have fur collars on them, \r\nremember? \r\n \r\nAmelia: Fancy. Fancy coats. \r\n \r\nRelative: SO you got married pretty quickly though because \r\nyou said you didn’t have money to buy a dress for the \r\nwedding. \r\n \r\nAmelia:  Oh I bought a dress, but she didn’t have a dress- \r\n \r\nRelative: So you hadn’t been there long enough to earn \r\nenough money to buy a dress for- \r\n \r\nWilma: I don’t remember that but you told me that. \r\n \r\nAmelia:  OH you had forgotten that? \r\n \r\nWilma: You had lent me your dress to go to your wedding. \r\n \r\nAmelia: November. We got married there- 60 in November. \r\n’42. \r\n \r\n----------------Page (11) Break----------------\r\n 13 \r\nRelative: Wow, so then the rest of the war, what was your, \r\nwhat did it feel like?  Did it feel like oh I’m not \r\nworking? I’m not helping the effort anymore? Was it that \r\nkind of feeling? How was it- What was it like? \r\n \r\nAmelia: It was to me. \r\n \r\nWilma: Well, we were raising cattle and the army needed \r\ncattle to feed the army so no, I didn’t feel that way. And \r\nmy mother-in-law was so great about making packages to send \r\nthe servicemen.  Making good candy to send to the \r\nservicemen. \r\n \r\nAmelia:  Is that right? I didn’t know that. \r\n \r\nRelative: And your mom also worked at a defense plant \r\nright? \r\n \r\nWilma: She started to work in uh a bomb plant in Grand \r\nIsland.  And she had never ever worn slacks and they had \r\nhad to war slacks of course and shoes that had metal toes. \r\nAnd she sent me picture of herself in a slack-suit and a \r\nbandana around her head and said, “Don’t I look awful?” So \r\nthat picture is in one of the Rosie books and and she must \r\n----------------Page (12) Break----------------\r\n 14 \r\nhave been allergic to the powder. She couldn’t keep on \r\nworking.  So she must of only worked a few months. \r\n \r\nRelative:  Is that when she went into nursing? \r\n \r\nWilma: Well she had been a practical nurse so then she got \r\na job in a hospital and so that was her war effort, working \r\nin the hospital. \r\n \r\nAmelia: And dad worked out of the airport.  \r\n \r\nWilma: They were in maintenance I think, wasn’t it?  \r\n \r\nAmelia: They were making the new airport. \r\n \r\nWilma: Oh. \r\n \r\nHemmerdinger: How did it feel for you ladies to put on the \r\nslacks?  Was it unusual for you too? \r\n \r\nAmelia: No, no. \r\n \r\nWilma: No. It was great to be able to wear slacks, yes.  \r\n \r\n----------------Page (13) Break----------------\r\n 15 \r\nAmelia: Growing up we couldn’t wear slacks to school. \r\n \r\n13:01:22-------------------------------------------------- \r\n \r\nRelative: Yes. But you were already wearing slacks on your \r\nown, before you had to wear them to work. \r\n \r\nAmelia and Wilma: Um uh, yea. \r\n \r\nHemmerdinger:  If you could go back in time and each of you \r\ntell it separately, tells tell that young woman or your \r\nsister something that you know now.  Do you have some words \r\nfor that young woman?  You have a lot of experiences now \r\nand each of these two young women who you were were fresh \r\nto the work force and to life. \r\n \r\nWilma: (laughs) Well we certainly were green when we left \r\nNebraska. We never had much of an opportunity to travel so \r\nI I guess it’s paying attention to to- maybe listening to \r\nelders more than we did. \r\n \r\nAmelia: Well I wish we had studied more in high school. \r\n \r\n----------------Page (14) Break----------------\r\n 16 \r\nWilma: Yea, I was thinking about that. But we we didn’t’ \r\nhave any advisors in high school and mom and dad never \r\ntried to influence us in anything that we did, did they? \r\nJust thought that we could go ahead and do anything on our \r\nown.  I I wanted to go to college in the worst way and \r\ncouldn’t afford tuition at all. Then we got married.  Here \r\nyou feel in love and that was the most important thing. \r\n(laughs) It seemed. \r\n \r\nRelative: From here does it feel like that was the most \r\nimportant thing? \r\n \r\nWilma: Yes. It still was. \r\n \r\nRelative: Cool. \r\n \r\nAmelia: Then we raised a family.  I had three boys and one \r\ndaughter. Finally had a daughter and that was important.  \r\nIt’s funny, uh our kids kind of corresponded a little but \r\nwe had, she had a son and I had a son that were born in the \r\nsame year and out of all our children there are the only \r\nones that are left handed. \r\n \r\n----------------Page (15) Break----------------\r\n 17 \r\nHemmerdinger:  How do you think- Can you give us a little \r\nwisdom on how the world had changed between then those war \r\nyears, life after the Depression, how difficult life was \r\nfor the both of you and how young women who would have be \r\nyour age now who were your age then, what would you tell \r\nthem? Or how do you see the word for young women who are \r\nmaking it now. \r\n \r\nWilma:  Like my granddaughter, she had such an advantage. \r\nShe lived in in Scottsdale and she quit high school before \r\nshe graduated but then she went on to take college courses.  \r\nShe didn’t get a GED, she she got a diploma from high \r\nschool and then has taken college courses but she never \r\nreally graduated from college. Um, she had all these \r\nadvantages but yet she didn’t have any common sense and I \r\nthink maybe growing up in a smaller town we had to do with-\r\nwithout much advantages. You learned to to appreciate and \r\ndo with what you had instead of getting your credit card \r\nout and wasting, wasting money really. And then get in debt \r\nand then have a problem getting out of debt. So I think so \r\nmaybe they had a lot more advantages but they still didn’t \r\nhave common sense and I-I think we had common sense, don’t \r\nyou? \r\n \r\n----------------Page (16) Break----------------\r\n 18 \r\nAmelia: It took us a while to get it.  \r\n \r\n(Laughs) \r\n \r\nHemmerdinger: And how would you answer that question? \r\n \r\nAmelia: I I think children need an education now much more \r\nthan we did.  They need to go to college.  If it isn’t uh a \r\nregular college a business college or community college \r\nthey call it. Everyone should go to college. \r\n \r\nHemmerdinger:  And how does society seem to you now as \r\nopposed to back then? \r\n \r\nAmelia: Oh we’re so rushed.  We have washing machines that \r\ndo everything and dishwashers and everything to help us but \r\nwe still don’t have any time.  We’re too rushed. \r\n \r\nHemmerdinger: Wonderful, wonderful. I think you guys are \r\njust terrific and that you should have lunch. \r\n \r\nAmelia: Yes. \r\n \r\nTHE END \r\n----------------Page (17) Break----------------\r\n 19 \r\n \r\n \r\n \r\n  \r\n \r\n----------------Page (18) Break----------------\r\n"}}]