[{"type":"add","id":"mazie-mullins","fields":{"identifier":"ROSIE_INTERVIEW_016","url":"/interviews/mazie-mullins","label":"Mazie Mullins","description":"Mazie started working at the age of six when she started helping her father pull out the weeds in the cornfields. ","image":"/images/ROSIE_INTERVIEW_016-interview-thumbnail.jpg","content":" 1 \r\nMazie Mullins \r\n \r\n \r\nThe Real Rosie the Riveter Project \r\nInterview 16 \r\n \r\n \r\n \r\nInterview Conducted by  \r\nAnne de Mare  \r\nJune 26, 2010 \r\nNashville, Tennessee  \r\n \r\n \r\n \r\nFor The \r\nFor the Tamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n----------------Page (0) Break----------------\r\n 2 \r\nInterview: Mazie Mullins \r\nInterviewers: Anne de Mare  \r\nDate: June 26, 2010 \r\nPlace: Nashville, Tennessee \r\n \r\nMullins:  I assure you what I tell you has really been that \r\nway as much as I know how to tell it. I don’t regret a day \r\nthat I worked to help a war. \r\n \r\nDe Mare: So why don’t we start maybe you introduce yourself \r\nto me and tell where you’re from and what you did in the \r\nwar. \r\n \r\nMullins:  I’m Mazie Mullins.  Priest was my maiden name, \r\nPreist. Mazie Priest Mullins.  And I was born in Nicholas \r\nCounty, West Virginia. Venton, West Virginia.  There’s no \r\nPost Office there now, it’s back in the country. And and \r\nafter I got older and married my address now is 375 Elk \r\nRiver Road North, Clindon, West Virginia 25045.  From \r\ngrowing up as a child, when I was a child my mom and dad \r\nlived on a farm.  They were just- they raised 13 children \r\nand one passed away at birth. We lived on a farm and he \r\nworked mines and log timber jobs and we raised everything \r\nthere.  I remember the Depression. It was hard on us and I \r\n----------------Page (1) Break----------------\r\n 3 \r\nsaid and he he was a worker.  My dad was a good man. He was \r\nreally a hard worker to provide for his family so we always \r\nhad food. So as we got older, he raised- he kept a horse, \r\nkept cows, he kept chickens, pigs.  We had our food you \r\nknow so as we got old enough the ones who were older had to \r\nget out in the fields and I mean long, big fields, no \r\nmachinery like it is today and do the work corn by hoe-by \r\nhand.  And the smarter ones like me, maybe six years old \r\nlearned to teach what the weeds around that corn hills corn \r\nand we went in front of the ones who were hoeing and it \r\nmade it so much faster for them. So when we got big enough \r\nto do something, there was always something to do and they \r\nput us to doing it.  He wasn’t hateful about it. He would \r\njust tell us to do it and we know to obey.  And we did grow \r\nup and I was about, I guess 12 years old. He he started \r\nraising fields of cane to make molasses so my older \r\nbrothers and sisters would most go to work away. So then I \r\nhad a brother at home older than me and me and him would \r\nhave to blade that cane. We couldn’t go in the shade.  We \r\nhad to work from 6 o’clock in the morning- our-my dad went \r\nwith us time to get in the fields. Work ‘till 12 go in and \r\neat dinner- we called it dinner, and back at 1 and worked \r\n‘till 5 and came in and eat our supper we called it. So as \r\nwe got older, we had to blade that cane then we had to tie \r\n----------------Page (2) Break----------------\r\n 4 \r\nthe blades up in bunches so it could be feed to the stalk. \r\nCut those cane stalks so you know.  He did most of that but \r\nwe had to help him somewhere to get it in the meal and have \r\nthe meal with the horse and put a big tongue around it  and \r\nhad cane meal to make molasses and that horse would just go \r\n‘round and ‘round like a merry-go-round.  That cane, having \r\nit running down in a big old tub or something and someone \r\nhad to sit there on a stool or something and feed those \r\nstalks to that meal. And then make cane.  My dad was a good \r\nmolasses maker.  He had the name of it...then when time come \r\nthe molasses finally get down they’d get the yellow \r\nschemers they’d call it.  So he’d fix this long poles like \r\nand them being those schemers we’d love ‘em. We’d eat ‘em \r\nand other children around the country would- we lived in \r\nthe country but now there were more molasses making than \r\njust his children there.  There was an exciting time.  So \r\nthen, I went through that and I got a little older. There \r\nwas a log camp that my dad and mom and so that lady- \r\nbecause you know back then girls worked.  I could make pies \r\nat 13, could. They taught us you know so we always went \r\nahead and did what we were supposed to do. So the lady down \r\nthere wanted to know if I would do her wash at the boarding \r\nhouse, you know, sheets, pillow cases, things they used for \r\nthe boarders. So I took that job and I would go down there \r\n----------------Page (3) Break----------------\r\n 5 \r\nonce a week if it was needful to and I would have to wash- \r\nI would have shed to big tubs- big old tubs. I would have \r\nto carry the water. Nice clear water from the creek, I mean \r\nit was nice water, clear, put them in the tubs, light a \r\nfire under ‘em, heat ‘em up then wash those sheets and \r\neverything out of one tub using a wash board.  You’ve seen \r\nthese things and maybe it would be 6 o’clock in the evening \r\nand have 24/25 sheets, pillow case things to bring in off \r\nthe line, fold ‘em up for her. I’d get a dollar a day for \r\nthat, 7 to 7. And so I thought I was really doing something \r\nbig.  Then when I got about 14 years old, we were about \r\nthree and half miles down the road- the log cabin still \r\nstands there, it’s a restaurant. Chimney Corner.  If you \r\nare ever down in that area of Head County, it’s still \r\nthere.  And my brother- there’s a service station on the \r\nopposite side of the road from that restaurant.  And my \r\nbrother, older than me, we would walk down there and he \r\nworked at the service station and I think he got $3 a week.  \r\nI washed dishes and worked in the kitchen.  Mrs. McFay was \r\na nice lady- she was the one that hired me.  I got $.75 a \r\nday for that 7-7.  So- Then I was so proud, I went down to \r\nGolly Bridge.  I knew a Mr. Lewis in the department store, \r\nknew my dad and mom so I had me two dress that were a $1 a \r\npiece and a pair of brown-white oxford shoes so I paid $.50 \r\n----------------Page (4) Break----------------\r\n 6 \r\na week on them and we had to walk about 3.5 miles to get to \r\nthis work.  So then later I went- when I was 15 I went to \r\nstay with my sister on a dairy farm. \r\n \r\n07:05:09----------------------------------------------- \r\n \r\nDe Mare: So did you work in the Department Store? \r\n \r\nMullins: No. \r\n \r\nDe Mare: No. \r\n \r\nMullins: No he just knew him. That’s where I got my things \r\nand Mr. Lewis just said pay me- you pay me $.50 a week, but \r\nI had two new dresses I was so proud of ‘em and a pair of \r\nnew brown-white and from about the time I was 14 my parents \r\nbought me as much as a shoe string.  When I was 15/16 my \r\nsister and my brother-in-law, they were about 7 miles from \r\nwhere I lived on a dairy farm, Warner’s Dairy Farm and so \r\nthey worked for Warner Stone.  She had just a little boy \r\nand little girl, just a young baby. And I went to help take \r\ncare of them and of course you know, went to school what I \r\ncould- to help them. And when she was off from the dairy, \r\nI’d go work for Mr. and Mrs. Warner in the house- do their \r\n----------------Page (5) Break----------------\r\n 7 \r\nlaundry and ironing and all that, clean house and they’d \r\npay me for that so.  And I can’t remember exactly what I \r\ngot for that but it wasn’t very much but I was proud of it \r\nyou know. Get my lun- dinner with them. So anyway, I was \r\nwith them helping them taking care of the children while \r\nthey worked and sometimes I’d go up and help her in the \r\nmilk barn- milk house they called in, barn milk.  So then I \r\nwent on and when I was about 17- I was 17 I think when \r\nPearl Harbor was bombed, heard on the radio. I could \r\nremember just standing back just as if it were yesterday \r\nlistening to that and it sounded so sad because I knew \r\nthere were American boys there from around home and \r\neverywhere- so many killed.  I really felt down and out \r\nwith that so then about another year, they moved way from \r\nthere to Ohio to get more work so when they did that, I \r\nknew a lady who went to church with us she’d come down from \r\nParkersburg and she went to Ohio and got work but it wasn’t \r\nthe aircraft you know. She had a boy and a girl. One 11 and \r\nthe boy 13 and the girl was about 11 so she told us if we \r\ncome out there we could get a job probably in the plant \r\nbecause they were really hiring ‘em. You know making war \r\nmaterial.  So my brother, when he turned 18, between 18-19, \r\nmy brother took us out there and we got a sleeping room and \r\nso I prepared applying for jobs. So the first thing I had \r\n----------------Page (6) Break----------------\r\n 8 \r\nto do was take a 6-week sheet and metal training. So I did \r\nthat. Had to go get a shot you know from the Health \r\nDepartment. Still have my receipt and everything that I got \r\nthere and so anyway I- I worked that and got the shot and \r\neverything and I was so happy about that. I thought I was \r\nready to go into work in the aircraft. I didn’t just want \r\nto (inaudible) at my job. Oh it was a big place, 35,000 \r\nworkers, five plants combined at Goodyear Aircraft. Made \r\ndifferent types of war material.  So when I went, they \r\ninterviewed me and Mr. Whetherford was my foreman. He was \r\nfrom Kentucky.  He put me on the big wings to rivet and of \r\ncourse you know that excited me. Big air hoes and rivet gun \r\nand had to have a drill and a counter stick by me. Well, \r\nwhen I got that job, the first thing I had to do when I got \r\nthat job was, I realized that I would have to get my \r\nparents signature ‘cause then you had to be 21 you see, \r\nback then, not at 18. So I had to catch a Greyhound bus and \r\ngo back home, took hours then, no interstates. So my mom \r\nand them signed it and I went back and went right to work.  \r\nI worked 6 days a week, 8 hours a day so it was it was, I \r\nenjoyed my work. But Mr. Whetherford said, “well we’ll put \r\nyou on this rivet gun” and gave me a big apron and said, \r\n“show me your freezer.” It was about 6-foot long and you \r\nhave to get your rivets out of here, different sizes you \r\n----------------Page (7) Break----------------\r\n 9 \r\nuse.  So they taught me what sizes to get so I didn’t have \r\nno problem, I learned. I guess when you’re younger you \r\nlearn things quick. So I learned how to do it and \r\neverything.  The lady that was my buddy, you know who had \r\nto be on the opposite side that wing. She had to use metal \r\nbars, all sizes would fit ‘em up through them ribs you \r\nknow.  And she was from Weldon, West Virginia.  She had two \r\nsons in that war and that made her go out and w- I think \r\nshe was a window and so uh, anyhow, she was so good to get \r\nalong with but I couldn’t hear her and she couldn’t hear \r\nme. We had to know what was doing. So we got along swell. \r\nThat was totally my job all- ‘til that war was over.  And \r\nwe’d get a wing finished- a big wing, we got it finished \r\nthere would be some inspectors- what I remember is about \r\nfour to five maybe six sometimes come in- I don’t know \r\nwhere they came from, but they’d come in go over every bit \r\nof that work we’d done and we always got good grades. And I \r\ncan’t remember but one time when one rivet just didn’t fill \r\nit just a little bit rough on one side higher than the \r\nskin.  They’d explain we had to stand back and watch them \r\ndo it so if they saw anything wrong we’d get corrected. So \r\nhe told me about it so I took the drill and just took that \r\none out (inaudible) used just a small bit and fit the rivet \r\njust on the flush of the skin, they call it skin.  So I got \r\n----------------Page (8) Break----------------\r\n 10 \r\ngood grades on it. So anyhow we’d get a wing done and so \r\nthey’d pull in off the workingmen and come take it off the \r\nj-rig and bring another for us to start on. That was my job \r\nthere. \r\n \r\n13:10:16-------------------------------------------------- \r\n \r\nDe Mare: How many of those did you do in like a day? \r\n \r\nMullins: I don’t- Oh we didn’t do one in a day. Those wings \r\nwere large. Oh they’s was- I heard those wings were maybe \r\nabout 12 to 16 feet long off of B-26s I believe. And so uh \r\nlarge. \r\n \r\nDe Mare: So you’d work on those for a number of days? \r\n \r\nMullins: Oh yea, maybe a week. So anyway when one was done, \r\nthey were inspected thoroughly. And and we got the praise \r\nfor doing a good job from our foremen. \r\n \r\nDe Mare: You did? Now, let me ask you, do you remember how \r\nmuch money you made when you got in to the- \r\n \r\n----------------Page (9) Break----------------\r\n 11 \r\nMullins: I got only- think it was about $33, $34 a week, \r\nbut I got a check from Goodyear Aircraft, It another copy \r\nof the check from one of them and I have it in my stuff \r\nthere.  Goodyear checks you know and I got my W-2 forms, \r\nyou know, to show how much I made in a year so anyway I I- \r\nMr. Whetherford he’d say “I’d tell you, if it wasn’t for \r\nthese women from West Virginia and Kentucky, we’d never be \r\nable to get this all done.” And he was going out, I mean \r\nfrom different kinds of plants (inaudible) Corsairs was \r\nmade and I got a picture of it. And uh so they’s were all \r\ncombined you know. I went through there, Plant D on a \r\nfamily day, my brother came up with me. They made motors, \r\nthey made Corsairs, they made these little planes, fighter \r\nplanes, called Helldivers. And of course I was working the \r\non the B-26/29 so anyway when the war over, just getting \r\nready to go out to lunch, you know 7 o’clock had a huge cup \r\nof tea got a pictures of the newspaper where it showed \r\nthat, it was crowded you know, the cafeteria you know. Then \r\nit was just about time for us to go, lay down our tools and \r\ngo out to eat ‘cause there were so many people working \r\nthere see so you just had to go off of some jobs there \r\nnearly were so many. So when it was time to go, you hear \r\nfrom the intercom loud and clear, “the war is over, the war \r\nis over. Lay down your tools. Come back- Turn in your tools \r\n----------------Page (10) Break----------------\r\n 12 \r\ntomorrow and check in your badges.” We had laid them town \r\nand the next day we had to come by and turn all that in you \r\nknow and everything and that- you know it just seemed so \r\nsad- had to quit, give up doing that but was so glad the \r\nwar was over.  I had seen women out there with two or three \r\nsons out there working as hard as they could work, older \r\nwomen, a lot of older women, older than me had- seemed like \r\nthey were just warring over their children so bad and I had \r\ntwo brothers in the war and uh, one was served 22 years and \r\nthe other came home but took cancer and passed away younger \r\nthan me. That wasn’t World War II though. But my brother \r\ncalled me yesterday morning, coming down here, he says, \r\n“Sis, me and you helped win that World War II.” He said, “I \r\nknew when you working in Akron, Ohio, I knew that when you \r\nwent to working helping in that war and I was in Vietnam, \r\nhe served 22 years, he said me and you help win that World \r\nWar II and he said, I’m so proud of you. So anyway the war \r\nwas over and I stayed out to Akron, I’d say three month, \r\nhunting around for jobs.  I hated to leave after so l-bad \r\nback to West Virginia because I didn’t have much to do in \r\nWest Virginia. So anyway- \r\n \r\n17:02:01------------------------------------------------ \r\n \r\n----------------Page (11) Break----------------\r\n 13 \r\nDe Mare:  What did you do when you came home? \r\n \r\nMullins: Well, when I came back, I- I knew a few people-a \r\ngirl- a girl that I worked with and stayed with me, see we \r\nknew each other from West Virginia and went to church a \r\nlot. She come back and down with her grandpa and grandma \r\nlived, they knew about a hosiery mill up in Eleanor, West \r\nVirginia. There is a Toyota plant there now so I went there \r\nand I got a job there and making hoes. Sitting at a table \r\nor something like that using the machine and I worked there \r\nbut there was so materials they were bringing in there that \r\nwere dyed and I could hardly stand it. It would make me \r\nsick sometimes and so then I got a message that Fletcher \r\nEnamel was coming making all kinds of Enamel ware, cookware \r\nand everything at Dunbar and I went up there and got right \r\non see because I had my record and everything. I worked \r\nthere until it shut down. So anyhow, but while I was \r\nworking in that war at Goodyear Aircraft, I had a boyfriend \r\nI met in West Virginia and see they drafted him and them \r\nbad. I mean, some were turned down because of their health \r\nor something but oh so many had to go and he had to go. So \r\nhe’d write to me and write me letters and I liked him he \r\nwas a nice boy. He had a good record. He’s sister, a retard \r\nschoolteacher, raised him and uh anyhow, I thought a lot of \r\n----------------Page (12) Break----------------\r\n 14 \r\nhim so when he went to war or yea, was drafted, he’d write \r\nto me and I’d let him know that I was in Akron, Ohio \r\nworking in the plants, helping build stuff to win the war. \r\nAnd he’d write to me there and once in a while he’d call. \r\nAbout February right before the war was over he called and \r\nsaid he was getting a 10-day furlough in March and says “Do \r\nyou want me to come to Akron or West Virginia?” Point \r\nPleasant, West Virginia.  I wrote him back and thought \r\nabout it and I thought, well I’ll just have him come to \r\nWest Virginia and I can see my parents and he can see his \r\nparents same trip because I didn’t get to come home very \r\noften. I didn’t want to miss work so uh, that was February \r\nwhen I got the letter and in March, I got a telegram, just \r\na few days before he was supposed to come, I was all \r\nprepared to come to West Virginia, got a telegram that he \r\nhad been killed. Oh that broke my heart nearly.  See, if I \r\nhadn’t been working out there in Akron and helping end the \r\nwar, I don’t know if I would have stood or not but it \r\nseemed that it really encouraged me to just keep on, keep \r\non. Do every bit you can to win this war because it took \r\nhim, some kind of machinery- Amarillo, Texas is where he’s \r\nat. And the letter I had wrote him to come to West \r\nVirginia, his major or whatever it was, sergeant, he told \r\nme he was with him talking to him and he told him that he \r\n----------------Page (13) Break----------------\r\n 15 \r\nwas coming to West Virginia and he was going to meet me \r\nthere and uh he had the letter on him, in his pocket. And \r\nthe sergeant said, when he was killed, he got that letter \r\nand read it, that’s how he knew to send me a telegram and \r\nhe’s the one who did it.  So I I come back to the place to \r\nsee him for his funeral you know and when I got there the \r\nfuneral- gathering at the church for the funeral at Lyon, \r\nWest Virginia, and he come and understood who I was and he \r\nwas watching for me and he escorted me up to the church and \r\nhe got me as close to that casket that I would go. And he \r\nrespected me very highly. Robert and him talked- they had a \r\nlong talk together in a little bit of spare time. He told \r\nme about the letter that he got-just got and what he was \r\ngoing to do. So uh then when it come time and the funeral \r\nservices were over with, he got me and said, “I want you to \r\nride in the ambulance right there with him to the \r\ncemetery.” And I did. And he said any ribbons, flowers on \r\nthat casket, I want you to take ‘em so I did.  I picked out \r\na big nice ribbon and flower took it with me.  It was \r\nreally hurtful, I tell you it was. I I I thought a lot of \r\nthat boy and he respected you so highly, I mean he was.  He \r\nwasn’t one to put yourself when you’re nothing. He just \r\nrespected me. And uh so anyway I kept a working until the \r\nwar ended. \r\n----------------Page (14) Break----------------\r\n 16 \r\n \r\n21:53:12----------------------------------------------- \r\n \r\nDe Mare: Let’s go back to that time, you were saying, how \r\nold were you when this happened? \r\n \r\nMullins: I was I’d say, let me see I was in there between \r\n’42-’43 and by ’45 the war was over. Well, this happened in \r\nMarch before the war was over and I was I’d say 22 or 23. \r\nAnd I came back and I got the job at Fletcher Enamel \r\ncompany Dunbar and then I met another guy and he was \r\ncoalminer. He was- all the time I was in Akron, I did go \r\nwith a soul because I couldn’t get him off my mind. I \r\nwasn’t interested in anybody. So anyway, Sunday nights \r\nafter we got out work done on Sunday, I’d go to church, me \r\nand the girls would ride the streetcar down Main Street in \r\nAkron and go to church. But when I came back to Dunbar, get \r\nthose jobs there and met this other guy and he he was a \r\ntype, he just tried to instruct you, he just seemed like he \r\nwas so settled.  So I was 26 and about 6 months old when me \r\nand him got married, July 9, 1949.  So we were married and \r\nhe had a farm near and he worked the mines and so got \r\nchildren. Had three boys and three daughters. And I \r\nenjoyed, I enjoyed them years, I really did but it took me \r\n----------------Page (15) Break----------------\r\n 17 \r\na lifetime to get over this other one, it really did. And I \r\neven flied my ribbon when I got married.  He said, “you \r\nkeep that, you keep that. Don’t you do a thing with that. \r\nYou keep it. Something for you to remember him by.”  He was \r\nvery sweet about it.  And I did. I kept it until it was \r\nabout ready to fall a part but anyway that and then I his \r\nsister that raised him was getting up in years.  She was a \r\nretired schoolteacher and her and her husband lived on a \r\nbig farm down there.  I went to visit her.  I even went to \r\nvisit her when my youngest son was about 3 years old, 4 \r\nyears old.  She was so happy. I went to visit her once or \r\ntwice before that and she made a quilt, hand-made quilt and \r\nsent it to me and she was really good to me and she told me \r\nwhat she planned to do for me.  She didn’t have any other \r\nchildren. If me and him got married and- what they had in \r\nmind for me and so I respected her very highly. Of course \r\nshe’s gone now. So, but anyway, I I just worked at anything \r\nI could work at, you know, until I got married.  Fletcher \r\nEnamel was my last real job.  Of course after my family- my \r\nyoungest son was a baby boy, was two and half and his dad \r\nhad heart trouble when he had heart attack to the \r\ncoalmines. Then uh then he he had one real bad at home and \r\nhad to go to the hospital.  He came up after his third time \r\n----------------Page (16) Break----------------\r\n 18 \r\nin the hospital.  Then the last one got him and my baby boy \r\nwas two and half years old and my oldest was about 13. \r\n \r\n25:15:21--------------------------------------------- \r\n \r\nDe Mare:  When your- when your husband died, yea? \r\n \r\nMullins:  So I raised them, kept them in school and they \r\nwere so good to me.  I mean, Faith thought I was sick or \r\nanything, it would just tear ‘em up.  So anyway, I took \r\ncare of them, they went to school and everything, got jobs \r\nand so now they really respect me.  My oldest son came to \r\nme, he brought me a rosebush, he said to me, “you’re a \r\nRosie now, so you got this rosebush now.”  He planned it \r\nand everything.  So they helped support me to get me out \r\nhere. \r\n \r\nDe Mare: Oh lovely... \r\n \r\nMullins: And then my house was getting old and everything \r\nand they got together to get me a three bedroom double-wide \r\nbecause my second son owned land and so I live in that now. \r\nSo anyway, that’s my daughter with me.  They’re very \r\nsupportive of me. And so, but they said, “Mom, we want to \r\n----------------Page (17) Break----------------\r\n 19 \r\ndo something for you. You stuck with us, (inaudible), kept \r\nus together, read the Bible to us, send us to school, and \r\nteachers and all said they had a good record do I felt like \r\nI did what I was supposed to do.  I really did. \r\n \r\nDe Mare: It sounds like it. \r\n \r\nMullins: So- \r\n \r\nDe Mare:  Now- So when you were at Fletcher Enamel before \r\nyou go married.   \r\n \r\nMullins:  Oh I was working there, I got married after. \r\n \r\nDe Mare: And after your husband died, did you go back to \r\nwork or no? \r\n \r\nMullins:  Oh I worked.  After he passed away, well I didn’t \r\nwork nowhere until my baby boy was in first grade at \r\nschool.  Then a school teacher at the school they went to, \r\nmy youngest daughter Donna, she was in her class- Mrs. \r\nHathaway and so she’d come home and say, “Mrs. Hathaway, \r\neveryday she says her mother’s in the hospital and had \r\nstroke and this and that you know and said she’s trying to \r\n----------------Page (18) Break----------------\r\n 20 \r\nfind someone to stay with her through the day while she’s \r\nteaching school.  She can’t bring her home until she gets \r\nsomebody and they wanted to release her.” And Donna said, \r\n“I told Mrs. Hathaway says that-“ She said that the teacher \r\nwould ask them every morning “do you know of anybody or \r\nhear of anybody that would want to stay with my mother.”  \r\nShe said, “that little blonde girl held up her hand and \r\nsaid my mommy probably will. She said that- cli- that my \r\nlittle brother is in school now.” And so I did. I stayed \r\nwith her nine months until she passed away. In another \r\nschool, while I was staying with her, in another school so \r\nI’d clean house and iron and everything for her. So I’d see \r\njobs like that until finally I could make it. \r\n \r\nDe Mare: Do you want to show us some of your pictures? \r\n \r\nMullins: Oh yea, now this- no I didn’t know this but my \r\nhusband, his pictures on the entertainment-TV center. This \r\nis my ration book. And then they guy from the Gazette got \r\nthat picture and put it down, I didn’t know it was going to \r\nbe in the paper. \r\n \r\nDe Mare: Yea... \r\n \r\n----------------Page (19) Break----------------\r\n 21 \r\nMullins:  There’s a whole story there and underneath there \r\nis more of it. \r\n \r\nDe Mare: Now is this a picture of you when you were \r\nyounger?  Is this you? \r\n \r\nMullins: This was when I was already going to work.  I was \r\nalready after work and I was going to work and I just \r\nstopped at a little booth on my way to work and took that. \r\nI think it was called a 10-cent booth. Oh I don’t know how \r\nmany pictures- they have my picture at California at the \r\nheadquarters of Rosie the Riveters and Kanton, Ohio and I \r\ndon’t know where all they’ve got my picture and records \r\nnow.  \r\n \r\n28:41:04----------------------------------------------- \r\n \r\nMullins: So this- my daughter bought this for me.  It folds \r\nout about five feet.  Is there a place on the table I could \r\nlay it?  \r\n \r\nShowing Pictures \r\n \r\n----------------Page (20) Break----------------\r\n 22 \r\nMullins: They all greeted us and uh that’s the Secretary of \r\nState and the Mayor in the conference room there. And uh, \r\nthat’s the man that helped Anne, that’s Rosie the Riveter, \r\nthat’s Anne and this (inaudible) man was in the house of \r\ndelegates. And the rotunda- that’s where they give each \r\nriveter, if they’ve told each what their names was and what \r\ntheir jobs was, give each one of us half a dozen roses and \r\nthere’s riveters. There’s- \r\n \r\nDe Mare:  When did you go? \r\n \r\nMullins: Charleston- \r\n \r\nDe Mare:  When did you go? How long ago? \r\n \r\nMullins: uh, it was in the last few months and uh I got the \r\ndates at home but uh it’s been recently. And that’s at the \r\nrotunda at the capital. \r\n \r\nDe Mare: What do you think the Rosies, what do you think it \r\nis that you would like the Rosies to teach the young women \r\nnow? \r\n \r\n----------------Page (21) Break----------------\r\n 23 \r\nMullins: I would like, like my doctor, I go to my medical \r\ndoctor, when my picture came up, the news from the \r\nCharleston Gazette came up and interview me- my doctor got \r\nthat picture, come out on December 27\r\nth\r\n on Sunday and that \r\npicture like you see there, that was it.  When I went- when \r\nI had to go back to the doctor, he just opened up my \r\nmedical records and he held up that picture same one as \r\nthat. He said, “Mrs. Mullins, this caught my eye when I see \r\nit in Sunday’s paper.” He say, “I was born in Chillicothe, \r\nOhio and you worked in Arkon Goodyear and he said this \r\ncaught my eye and he’s got one aisle in the lobby where \r\neveryone comes in same thing on the wall.  He said, “I \r\nwanted to put it up on the wall to show some of these young \r\npeople who walk in if they’d take the time to read that, it \r\nwould learn- teach them that they could something about not \r\ndoing anything if they wanted to do it.” And uh, I thanked \r\nhim.  I thought that was great of him doing that. And I \r\nguess it’s still hanging there on the wall.  So it’s in my \r\nmedical records, same picture. So the banker from Poca \r\nValley Banks, President of about seven or eight banks, he \r\nknew me and my family.  He called me Monday morning after \r\nthis came out on Sunday. He said Mrs. Mullins, I was so \r\nhappy to see your picture in the paper and this story.” He \r\nsaid, “It really got to me.” He said, “that is a great \r\n----------------Page (22) Break----------------\r\n 24 \r\nstory.” He said, “I know you’ve worked hard all your life \r\nand he said that is something to be proud of.” He said, “I \r\nshowed it to all my staff and all and I’m going to laminate \r\nthis and fix this to you to keep.” And he did.  I didn’t \r\nbring it with me because it’s too big to get in- He said, \r\n“I’m really proud.” He wrote a note that said, “I’m really \r\nproud to know you and your family.” And that made me feel \r\ngood you know and I got calls from Texas and I don’t know \r\nwhere all.  I got an email number on the website and some \r\nfound out they could go on the website and find it. And so \r\nit was really something. \r\n \r\nDe Mare:  I loved what you said, that after your friend was \r\nkilled how you just you worked because that’s all you could \r\ndo- \r\n \r\nMullins: Yea to help. \r\n \r\nDe Mare: You just threw yourself into it and I think that’s \r\na great lesson of what to do to find a way to be useful and \r\nfind away- \r\n \r\nMullins:  I’ll tell you, when he was killed in there and it \r\nwas such a shock, I thought it’s always going to keep me \r\n----------------Page (23) Break----------------\r\n 25 \r\nalive, working and helping save somebody’s life.  That’s \r\nthe way it felt. And I, and I worked as long as it lasted I \r\nguess because I was determined to stay with him. \r\n \r\nDe Mare: Do you feel, it’s interesting because worked \r\nbefore and you obviously since you were a very small child \r\nand I wanted to know what pie you make best because I want \r\nthat pie. \r\n \r\nMullins: Apple. \r\n \r\nDe Mare:  Apple pie? \r\n \r\nMullins: Home grown apples, canned apples. Canned, about \r\neverything had to be canned.  I sewed and when my children \r\nwere little we had diary cows and you get feed sacks with \r\nprinted like- printed material.  Beautiful material. We’d \r\nwash those sacks and you could- there was a string on top \r\nof them that you could pull on top of them and open them up \r\nand then made little girls dresses and made the boys- I’d \r\ntake a pair of my husband’s bottom of an old pair of his \r\npants that had worn out, and cut them out and take a pair \r\nof shorts and tear them apart. A new good pair. And I \r\nmeasure them and everything and I’d make my little boy’s \r\n----------------Page (24) Break----------------\r\n 26 \r\nshorts and I made him a bib, overalls.  I’ve got a picture \r\nof my baby boy at home now. He was 17 months old- no 11 \r\nmonths old and had a pair of them on.  My little girls’ \r\ndresses and I sewed.  Then I got to making quilts. This \r\npast winter I made three. And keep busy, I just keep busy. \r\nI got a little garden.  I have my little garden every year.  \r\n \r\n34:17:02--------------------------------------------------- \r\n \r\nDe Mare: Can you talk a little bit- \r\n \r\nMullins: I just kept on working. \r\n \r\nDe Mare: Yea, and I want you to talk a little bit about you \r\nknow you had done a tremendous amount of work as a young \r\nchild. You worked cooking, you worked cleaning, you worked \r\nin the fields- \r\n \r\nMullins: Laundry. \r\n \r\nDe Mare: Laundry. Everything. When you were doing the work \r\nat Goodyear Aircraft and you working on those planes that \r\nwere going out.  How did- how did that make you feel as a \r\nyoung woman. \r\n----------------Page (25) Break----------------\r\n 27 \r\n \r\nMullins: I felt like I was really doing something \r\nworthwhile. I felt proud of myself that I could do \r\nsomething. And also, uh, I would cheat middle school six \r\nweeks and I went in there and passed up everything and I \r\njust felt good in myself that I could do that and I wanted \r\nto do everything that I could possibly do.  I didn’t like \r\nto miss my work. I put in time off to go to his funeral and \r\neverything and wasn’t no problem.  I’ve even got passes \r\nbefore now that some of the workers were maybe sick of \r\nriveters or you know have a build for some reason on \r\nSundays.  They’d give me a pass of wanting me to come in \r\nand work in their place that day. I already worked six \r\ndays. I never did turn them down, not one time.  So, I’ll \r\ntell ya, I wanted to do everything I could.  It hurt me so \r\nbad to think of so many boys, and even women I knew there, \r\nolder women had two or three sons in there and I thought \r\nthat could be my son or my brother.  And I knew they were \r\nworrying over them and I wanted to do everything that I \r\ncould do to help out in that war. Like my brother when he \r\ncalled me in the morning, he says, “sis, you and me help \r\nwin the war. World War II. We helped fight that war.  We \r\nhelped end it. And said, I’m really proud of you. \r\n \r\n----------------Page (26) Break----------------\r\n 28 \r\n36:07:23--------------------------------------------- \r\n \r\nDe Mare:  I would love for you to read this.  This is a \r\nletter dated in August 1945 that you got from the Goodyear \r\nAircraft Corporation and could you read that to me? Could \r\nyou read that for me? \r\n \r\nMullins: Yes...let me see.  All of it? \r\n \r\nDe Mare: No, you can just read it when is says, “Dear \r\nemployee.” \r\n \r\nMullins:  It says, “Dear Employee, Due to cancelation of \r\nwar contracts at Goodyear Aircraft Corporation, it was \r\nnecessary to exit you from the payroll in accordance with \r\nstandard layout procedures.  Having enclosed you will find \r\nany final checks you have coming from the corporation as \r\nwell as your wage separation report.  We take the \r\nopportunity to express our sincere appreciation for the \r\nsplendid contribution you personally made in helping to get \r\nthe vital war material out to the fighting men on the \r\nvarious war fronts. We feel you should take your pride in \r\nthe fact that in the organization of which you’ve been a \r\npart of met the War Department’s schedule and \r\n----------------Page (27) Break----------------\r\n 29 \r\nspecifications on quantity and quality in getting these \r\nvital materials to our men.  In so doing you contributed \r\nyour part to the shortening war and saving American lives.  \r\nWe send our best wishes for your success and happiness in \r\nwhatever new undertaking you may pursue. Sincerely. Very \r\ntruly yours, Goodyear Aircraft Corporation. F.J. Carter.” \r\n \r\nDe Mare:  That’s wonderful.  Thank you so much.  I wish we \r\nhad more time to talk with you. I have one other question \r\nthat is purely personal.  Your hair is gorgeous. Do you do \r\nthat yourself? Do you put it up yourself? \r\n \r\nMullins: What? \r\n \r\nDe Mare: Your hair.  It’s so beautiful. You put it up \r\nyourself? \r\n \r\nMullins: It’s coming out so bad on top. \r\n \r\nDe Mare: I think it looks gorgeous.  My grandmother used to \r\nhave just- now how long is it when you take it down?  Is it \r\nabout- \r\n \r\n----------------Page (28) Break----------------\r\n 30 \r\nMullins:  It’s about right in here (gesturing to lower \r\nback.)  I’ve had one permanent when I was eleven years old. \r\nMy sister did it with hers and she went to get her hair \r\nfixed and she had mine and I didn’t like it, I didn’t like \r\nit and so I never did have it again. Now when my husband \r\nwhat living, he’d trim it up. He could cut hair good even \r\nthough he worked in the mine.  So he kept it trim and so uh \r\nI just don’t bother getting it cut now. \r\n \r\nDe Mare: I love it. \r\n \r\nNaides: Can you turn around so we can see it? \r\n \r\nMullins: Uh? \r\n \r\nNaides: Can you turn around so we can see it? \r\n \r\nDe Mare:  She wants to film the back of you, because it \r\nlooks so beautiful. \r\n \r\nMullins: Oh, (turning) excuse me. \r\n \r\nDe Mare: Oh no you’re fine. Isn’t that beautiful? \r\n \r\n----------------Page (29) Break----------------\r\n 31 \r\nNaides: Yea \r\n \r\nDe Mare: I remember my grandma had hair she could sit on \r\nher whole life and she used to put it up like that.  That’s \r\nbeautiful, you can turn around now. She used to put it up \r\nlike that. I used to watch her do it. \r\n \r\nMullins: Yea? \r\n \r\nDe Mare: I used to sit on the toilet seat and watch her as \r\na very little child and watch her turn it and turn it. This \r\nwas so wonderful.  Thank you, Mazie. \r\n \r\nThe End. \r\n \r\n \r\n \r\n \r\n----------------Page (30) Break----------------\r\n"}}]