[{"type":"add","id":"mildred-crow-sargent","fields":{"identifier":"ROSIE_INTERVIEW_012","url":"/interviews/mildred-crow-sargent","label":"Mildred Crow Sargent","description":"Mildred put herself through college and graduate school with her work as a riveter in Detroit.  ","image":"/images/ROSIE_INTERVIEW_012-interview-thumbnail.jpg","content":" 1 \r\n \r\nMildred Crow Sargent \r\n \r\n \r\nThe Real Rosie the Riveter Project \r\nInterview 12 \r\n \r\n \r\n \r\nInterview Conducted by  \r\nAnne de Mare and Kirsten Kelly \r\nJune 27, 2010 \r\nNashville, Tennessee  \r\n \r\n \r\n \r\nFor The \r\nFor the Tamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n----------------Page (0) Break----------------\r\n 2 \r\nInterview: Mildred Crow Sargent \r\nInterviewers: Anne de Mare and Kirsten Kelly \r\nDate: June 27, 2010 \r\nPlace: Nashville, Tennessee \r\n \r\nSargent:  I’m Milly Sargent but I was Milly Martin when I \r\ngrew up.  And then I married a man called Crow, Dale Crow \r\nand he died.  Then I met my husband who is a Navy man.  He \r\nand I danced well together so that was a good, good match \r\nso here we are.  And then, while I was growing up I went to \r\nHUME Fogg High School and I don’t know if you visited that \r\nor not.  It’s one of the older high schools in Nashville \r\nand it’s downtown, Broadway.  And I think it’s the greatest \r\nhigh school in the world but you know I’m prejudice.  But \r\nwhen the war started the men had to go and all we had left \r\nwas young men and old men that couldn’t do much but they \r\nhelped. They did work like we did.  I worked next to men \r\nwho were older on the-on the gigs and they did good work. \r\nSo they did their part. \r\n \r\n01:01:02--------------------------------------------------- \r\n \r\nDe Mare: Where did you work? \r\n \r\n----------------Page (1) Break----------------\r\n 3 \r\nSargent: I worked at Woodall Industry in Detroit.  And I \r\nmade the Curtiss Wright Helldiver, which was a divebomber \r\nthat travelled on shipped and then bombed from the ships. \r\nNow, I have a book written by a man about the Helldivers \r\nand he said they were an awkward plane and the pilots \r\ndidn’t really like to fly them but when they went out they \r\nknew that they were coming back because they were \r\nserviceable.  And they said that they would get shot up \r\nevery which way and they would almost always get back to \r\nthe ship.  But when they got back to the ship and here’s my \r\ntearjerker, they would push them off in the ocean.  Because \r\nI couldn’t stand it when they said they pushed my Helldiver \r\noff into the ocean. But if they weren’t, if they weren’t \r\nfit to fly again they they had to do something with them.  \r\nAnd that’s...and they pushed them off.  And they didn’t have \r\nanything to fit them with. And I understand that. But it \r\nreally did hurt to think that my Helldiver was going in the \r\nocean. \r\n \r\nDe Mare:  I bet it did. \r\n \r\nSargent: But they did say that they were were really good \r\nwork with, to get back to the ship. They were serviceable.  \r\n \r\n----------------Page (2) Break----------------\r\n 4 \r\nDe Mare: Now when you grew up, you grew up around \r\nNashville, Tennessee.   \r\n \r\nSargent:  Yes I did. \r\n \r\nDe Mare:  And what did your parents do? What did your \r\nfather do? \r\n \r\n02:27:19--------------------------------------------------- \r\n \r\nSargent: They were just- my mother was a textile worker. Ya \r\nknow, poor folks but good folks.  I had a marvelous mother.  \r\nAnd my- my father was a good man. \r\n \r\nDe Mare:  Now, when you began, when you began to work in \r\nDetroit, can you talk a little bit about, hum, the \r\ntransition coming from Nashville going to Detroit. What \r\nthat was like as a young woman? \r\n \r\n \r\nSargent:  Well it was really hard because we had to wear \r\npants to work in and I understand that was necessary but in \r\nNashville at that time, nice girls didn’t wear pants. And I \r\nhad never worn pants in my life. So the first thing they \r\n----------------Page (3) Break----------------\r\n 5 \r\nsaid when I got there was ‘put pants on.’  And that was \r\nhard to do.  And the uniforms...we had to wear twill uniforms \r\nand they were heavy with long sleeves because the aluminum \r\nshavings would infect our arms if we didn’t. But we had to \r\nwear them but they were hot and there was no air \r\nconditioning at that time. But it was good place to work.  \r\nIt was a small industry on McNichols Road in Detroit.  And \r\nthey were good to the workers. And they had union there.  \r\nDo you want me to tell about the union? My experience? \r\n \r\nDe Mare: Absolutely.  \r\n \r\nSargent: I liked the union. I think it did a lot for the \r\npeople.  At that time and before they have done a lot of \r\npeople. But during war the rules- the same rules do not \r\napply for me.  They might for other people but not for me. \r\nBut they came around- I was the fastest riveter and I have \r\npapers to show that I was the fastest riveter on both \r\nshifts.  And I had really great pride in doing that.  I was \r\njust 19, ya know.  So I thought I was really doing a good \r\njob.  And so this union man came around and said ‘you are \r\ngoing to have to slow production.  You’re setting a \r\nproduction heavy day.’ And I said ‘those soldiers are not- \r\nthey don’t have a union.  And they can’t slow production.  \r\n----------------Page (4) Break----------------\r\n 6 \r\nIf someone comes at them with a gun they’ve got to shoot.’ \r\n‘And I have a gun so I’m going to shoot.’  And they didn’t \r\nbother me anymore but they did try-well they didn’t get \r\nreally bad with me but they said, you’re setting \r\nproduction...  Well it kind of made you feel a bit odd but \r\neveryone else felt the same way, they just didn’t say it, \r\nyou know.  Didn’t have opportunity to say it. \r\n \r\n05:09:02-------------------------------------------------- \r\n \r\nDe Mare: Now how did you...do you remember how you found \r\nabout the work in Detroit. \r\n \r\nSargent: By, on the radio.  We didn’t have television at \r\nthat time.  But I was ironing when- when they announced \r\nthat they needed workers badly in Detroit, and- women and \r\nmen. And I had a young son who was about 19 months old.  \r\nAnd uh, my husband had a job very near there.  I mean we \r\ndidn’t really need to go for work but we decided that if \r\nthey needed people and we could understand that there, uh, \r\nespecially women you know and I was an able body woman that \r\nthat we should go. So we packed up and left and went. And \r\nuh uh had no trouble getting work. The first job I applied \r\nfor.  And we had to take two week training session for \r\n----------------Page (5) Break----------------\r\n 7 \r\nriveting and uh, I had a wonderful person working with me \r\nwho was called the Bucker. And she did good work, didn’t \r\nchip the rivet tails on the underneath. So we got a lot of \r\nwork and a lot of good work because she was a good worker.  \r\nEthel Clapin was her name. And uh, so it-it was a wonderful \r\nexperience and when I left there after the war ended, I \r\nworked there until the war ended.  When I left there, I \r\nwent to back to Nashville and it was not long until the \r\nKorean War came along. And I-I go over to Vultee, which was \r\nat the airport at that time, Vultee Aircraft. And and, uh \r\nstarted riveting again on the B52.  And this little plane \r\nthat I did, it was a very big plane but the B52, I worked \r\non the wing section of that, and boy that thing went across \r\nthe plant.  So I had really come up in the world as far as \r\nwhere I riveted but uh, yea that was good experience too. \r\n \r\n07:09:13------------------------------------------------- \r\n \r\nDe Mare:  Let me ask you...you said you had a 19 month old \r\nson, when you first went- \r\n \r\nSargent: 19 months, yes.  \r\n \r\n----------------Page (6) Break----------------\r\n 8 \r\nDetroit: Now, um who took care of him when you were \r\nworking? \r\n \r\nSargent: Now this is another story.  We lived in a house \r\nwith my in-laws.  My mother-in-law and my daddy-in-law both \r\nworked at at um- Dodge at um...I think she made parachutes \r\nand I don’t- he made something in the war but I- anyway uh, \r\nhe had three sons and they all lived there with ‘em. We we \r\nrented a big apartment.  It was a hard to find a place to \r\nstay with youngsters. People- you know there were a lot of \r\npeople coming in and it wasn’t hard to rent a place so they \r\ndidn’t want youngsters.  So we we rented a big apartment \r\nand all of us lived in the same house just had separate \r\nbedrooms and ate together so that’s how we managed that. \r\nAnd... \r\n \r\nDe Mare:  And who would take care of your son while you \r\nwere at work? \r\n \r\nSargent: That that was an extra advantage to that because \r\nthere was always someone there to look after the kid folks. \r\nSo my mother-in-law mostly but when I wasn’t there she. \r\n \r\nDe Mare:  Hold on one second... \r\n----------------Page (7) Break----------------\r\n 9 \r\n08:17:04--------------------------------------------------- \r\n \r\nSargent:  Am I not beautiful in there? \r\n \r\nKelly: No you’re beautiful. \r\n \r\nDe Mare:  You’re gorgeous. You’re gorgeous.  \r\n \r\nKelly: No you look great. \r\n \r\nSargent:  She says I’m not beautiful but I look great.  \r\n LAUGHS \r\n \r\nKelly:  You are beautiful. \r\n \r\nDe Mare: So um, so let’s let’s go backwards just a little \r\nbit. So you moved from Nashville to Detroit with your young \r\nson? \r\n \r\nSargent: Yes. \r\n \r\nDe Mare: And you were working- \r\n \r\nSargent:  Mid- Afternoon shifts. \r\n----------------Page (8) Break----------------\r\n 10 \r\n \r\nDe Mare: Afternoon shifts and you were making the Hellcats? \r\n \r\nSargent: Yes, the Helldiver. \r\n \r\nDe Mare:  The Helldiver.  Sorry, Helldiver.  \r\n \r\nSargent:  There was a Hellcat so don’t get mixed up. \r\n  \r\n LAUGHS \r\n \r\nDe Mare:  Now, how old were you when you started doing \r\nthis? \r\n \r\nSargent: 19 when I started... \r\n \r\nDe Mare: 19. So you had finished high school? \r\n \r\nSargent: Yes. \r\n \r\nDe Mare:  But you hadn’t gone to college. \r\n \r\nSargent: No. \r\n \r\n----------------Page (9) Break----------------\r\n 11 \r\nDe Mare: Not yet...So when the war was over, what did you do? \r\n \r\nSargent:  Well when that war was over, of course, I raised \r\nanother child.  And I had two that died. And..I I, then \r\nthey started the Korean War and I went up to Vultee \r\nAircraft in Nashville and worked at the aircraft plant in \r\nNashville and I worked on the B52.  Now that was a step up \r\nbecause that wing went all across that plant.  It was a \r\nhuge thing, I don’t remember how many feet.  You know how \r\nbig that thing was. And I was so proud when we put those \r\nthings out.  And they would leave us.  I was a trustworthy \r\nperson I guess and they would my partner and I at night to \r\nwork without inspections. And they would depend on us if we \r\ngot a bad rivet, we wouldn’t close it up, ya know, put the \r\nskin over it without some inspector seeing it. And that has \r\nalways been a matter of pride for me, that that they could \r\ndepend on us to do that.  \r\n \r\n10:10:00--------------------------------------------------- \r\n \r\nSargent: After we lived- after I left that, my children \r\nwere growing up.  I had two sons and they were growing up \r\nand uh I had been putting back a little to send them to \r\ncollege but they had other notions, you know, at that time.  \r\n----------------Page (10) Break----------------\r\n 12 \r\nSo I said, ‘well if they’re not going to use it, I am.’ \r\nBecause I always wanted to go to college and I never felt \r\nthat I could because I was from poor people.  And I thought \r\neducation was just ahead of me because they didn’t give \r\nscholarships to women at that time.  I don’t care what you \r\ndid, you didn’t get a scholarship. Not many men did but not \r\nwomen for sure. So I said, ‘well I’ll just take that and go \r\nto school myself.’  Well, well I thought I’d try it one \r\ntime.  UT (University of Tennessee) had a night school \r\ndowntown and I thought I’d try it as see what I could do \r\nbut when I came in with As.  This is for me. I love school.  \r\nI was in the top 15 in my graduating class and I went on to \r\nget a masters.  And I went on to work on my doctorate and \r\ngot all the hours I needed and then I got- I did the two \r\nterm period of a- internship they called it.  And I did all \r\nof that and then my husband died.  He got sick and I had to \r\ngo Florida.  I couldn’t take my orals and get my degree. \r\nYou know...they had just started to do my dissertation. And \r\nso that has been a big disappointment in my life but I have \r\nI have published three scholarly books and I think \r\nsometimes that somebody up there will think about me and \r\nsay that she deserves and honorary degree.  Don’t you \r\nthink? \r\n \r\n----------------Page (11) Break----------------\r\n 13 \r\nDe Mare: Absolutely \r\n \r\nSargent:  I was always on the Honor Roll and I don’t know \r\nwhy and I couldn’t do it now because I waited too long.  My \r\nmemory is not what it used to be.  You understand that and \r\nI’m 88 years old. And but it was a dream of my mother’s. \r\nShe really pushed me in school.  And I- she was a wonderful \r\nmother.  And I would like to do it for her if nothing else. \r\nJust to say ‘here mom, I got it.’  But I have- my mother \r\nwas an angel, ya know.  You have mothers that you think \r\nabout as angels but she was a super angel. Golden wings.  \r\n \r\n12:54:02------------------------------------------------ \r\n \r\nDe Mare: Can you talk a little bit about, because you \r\ntalked about, you grew up poor in Tennessee and if you are \r\n88 years old, you grew up in the Depression.  Um, and your \r\nmother was a textile worker. What was it like for you to go \r\nstart earning the kind, do you remember how much money you \r\nearned? \r\n \r\nSargent: Well it wasn’t really a lot.  I think maybe 35 \r\ncents an hour, wasn’t it?  When we first went there?  It \r\nwasn’t a whole lot.  But I had- we had bought, my husband \r\n----------------Page (12) Break----------------\r\n 14 \r\nand I had bought a little house.  It was actually a little \r\nstore that they moved onto a lot.  It-it was a house ya \r\nknow.  And so I was able to pay for that house from what \r\nearns were there because both he and I were working and we \r\ncombined our food and our stamps and all.  So everyone got \r\nby cheaper in living and then we were combing our rent too \r\nand so I was able to but that house cost a $1,000.00.  It \r\nhad two bedrooms but it had cost a $1,000.00. And so in \r\nabout a year I had paid that house and my uncle was so \r\nsurprised because he had already sold an oat. I bought it \r\nfrom my uncle and he said, ‘you haven’t saved that much \r\nmoney.’ I said yes but we didn’t-there wasn’t many places \r\nto spend money. We could go to the movies but that was \r\nabout it, ya know?  There wasn’t many places that you could \r\nspend money. So it was- we could save. And then of course \r\nwe were saving where we living.  And I didn’t have to pay \r\nfor childcare.  That was a plus.  And I didn’t have to \r\nworry about my child not being looked after. And um, we had \r\ncarpools because not everyone had a car and there was not \r\ntransportation to the factories.  They had streetcars on \r\nthe main roads but getting out to the factories was a \r\ndifferent story.  But uh, we had carpools and um, people \r\nwould pick us up from work and take us home.  And there we \r\n----------------Page (13) Break----------------\r\n 15 \r\nwere. We had to pay a little bit, I had forgotten. It \r\nwasn’t a lot though. \r\n \r\nDe Mare:  Can you can you explain because I don’t think a \r\nlot people understand what it was like in terms of so many \r\npeople moved to the areas that had the jobs at that point, \r\ntemporarily.  Can you talk a little bit about the kinds of \r\npeople you met and what it was like for you to be form \r\nTennessee and meet people from all over and what that \r\nexperience was like?  \r\n \r\n15:19:20------------------------------------------------ \r\n \r\nSargent:  Well it was different from what I was expecting \r\nbecause we had always thought that the Civil War thing that \r\nYankee’s were just not nice people.  And so I go to work \r\nwith this young girl and it is a very close relationship \r\nbecause she down in the-the speed ring that I was working \r\non and I’m outside. And I have to depend on her, how she \r\nhits that rivet as to how hard I’m going to shoot it.  And \r\nI have to have confidence in her but she was a very nice \r\nperson and I really did like her and the the North/South \r\nthing soon disappeared with her. Besides there were a lot \r\nof people form the South there too, ya know. We don’t, \r\n----------------Page (14) Break----------------\r\n 16 \r\ndidn’t have much industry in the South so the southern \r\npeople who could work went to Detroit. So there were a lot \r\nof Southern people there. And um, the one thing that was a \r\nlittle different than I had expected, there was a black man \r\nworking on the next jig.  Well that was a little bit hard \r\nfor me to take right at first but I began to like him and \r\nyou know they had the Race Riots there while I was there \r\nand uh that poor man, I felt so sorry for him. He had eight \r\nchildren and he couldn’t leave, he was afraid to leave his \r\nwife and family at home and yet he needed to work because \r\nhe couldn’t feed them without it.  And I really did feel \r\nsorry for him and so it really made me feel differently \r\nabout black folks than I had before. But otherwise I \r\ncouldn’t I couldn’t complain about the way I was treated, \r\nno. \r\n \r\n16:55:19------------------------------------------------ \r\n \r\nDe Mare:  Can you- for someone who- because you were there \r\nduring the time of the Riots, can you talk to us about that \r\nand explain what happened? \r\n \r\nSargent:  Well, you know, it’s all rumor what you read in \r\nthe paper and sometimes uh- the papers- uh try to do a good \r\n----------------Page (15) Break----------------\r\n 17 \r\njob I think but you know they listen to this and that and \r\ntry to make the best out of it.  And I know I’ve taken \r\nreporting. Um, there’s not much I haven’t taken ‘cause I \r\nlike to study and I like to read and I like to learn. So \r\nI’ve taken some uh uh some editorial work. And so but the- \r\nmy understanding is that there was some young people on \r\nBelle Isle which was the major um entertainment isle then.  \r\nThey have other places now but I think that was the main \r\none then. And and um, one of the black students, not \r\nstudent, boys...uh...in one of the groups said something to a \r\nwhite girl and what he said, who knows you know.  He said \r\nsomething to her and when he did the white guys felt it was \r\nthere place to take up for her honor. And so it started and \r\nit just spread and it was just a terrible thing because \r\nlike I say this poor black man that was working next to \r\nme...he didn’t know what was going to happen to his family at \r\nhome because they were going inside a house.  And my \r\nhusband at the time said that he went down on the major \r\narchway and I have forgotten what that is but there was a \r\nlittle girl, she said that she was about four years old and \r\nsome- a little black girl and he said that someone had cut \r\nher with knives.  A little child standing there bleeding. \r\nNow that was terrible. You know, I think that I developed \r\nmore compassion for black people as a result of that than I \r\n----------------Page (16) Break----------------\r\n 18 \r\nhad before.  I had not, I didn’t really feel prejudice \r\ntowards them because we didn’t live far from uh- black \r\ntown, you called it then and they went through the alley by \r\nmy house and sometimes I’d wave and the little girls and \r\nstuff so I wasn’t uh, prejudice and my mother didn’t teach \r\nme that.  She taught me to be kind to people.  So but there \r\nwas a difference there because I knew nobody associated \r\nwith them ya know. And so it it- that brought out the best \r\nin me I think. \r\n \r\n19:31:20------------------------------------------------ \r\n \r\n \r\nDe Mare: And what was it like to work with the men so \r\nclosely?  You know because men and women didn’t work \r\ntogether at the time either. \r\n \r\nSargent:  They did at that time. Like I said there was a \r\nblack man on the jig next to me. \r\n \r\nDe Mare: Right...Right... \r\n \r\nSargent: Now he was doing repair work.  He wasn’t, his his- \r\nwe were doing new work and when it had to be repaired it \r\n----------------Page (17) Break----------------\r\n 19 \r\nwent over to him and he laid it on the floor and did it. So \r\nhe was right next to us, a black man. And so there was... and \r\nthey had, they had rest periods for women, um, I’d say \r\ntwice a day and maybe ten minutes at a time, which was \r\ndifferent. Now we did have one instance of black \r\nrelationships that caused a little problem but it didn’t \r\nlast long because most of the people were like me.  They \r\nwere broadminded about that. And and um, when, um \r\nRoosevelt, his wife mostly said if you don’t hire women in \r\nthe war work, we need them, if you don’t hire black women, \r\nwe’re going to take your contract.  So it didn’t take long \r\nfor them to hire black women. And so when they came in the \r\nwhite women, some of them went down to the office and \r\nprotested and they wanted me to go and I said, ‘no, I wont \r\ngo with that.’  But they said that they went down there and \r\ncomplained that they didn’t want the black women in the \r\nrestroom with them.  They said that they’d be dirty in the \r\nrestroom.  Now this is what I heard, I don’t know.  It’s a \r\nsilly thing isn’t it?  Why would they be anymore (dirty) \r\nthan we were. But that was one incident that we had but it \r\ndidn’t amount to anything ‘cause they didn’t listen to them \r\nin the office.  We had- well they had to- in order to keep \r\ntheir contact they had to keep them. \r\n \r\n----------------Page (18) Break----------------\r\n 20 \r\nDe Mare:  So- so what union did you belong to? \r\n \r\nSargent: AF of A I’m sure...yes. \r\n \r\nDe Mare:  And do you remember what you did? Did you pay \r\ndues?  Do you remember? \r\n \r\nSargent:  Yes.  I don’t remember ever going to a meeting \r\nbut my sister who worked in Nashville at Vultee.  She was a \r\nsecretary in the office. She did belong to the union and \r\nwas a secretary for the union here. But I never talked to \r\nher much about it and she’s dead now so I can’t.  I did \r\nhave connections with the union here.  But I believed in \r\nthe union...you know I was a history teacher.  After I went \r\nto college, I taught at Two Rivers High School and uh and \r\nuh I- you know I taught about the unions how they developed \r\nand how much good they had done.  No one knows what, unless \r\nthey worked in a plant that didn’t have a union, how people \r\nmistreated my husband worked in a plant...and he said if the \r\nboss didn’t like your looks he’d say, ‘fire that man.  I \r\ndon’t like him.’  Only they’d use tougher words than that. \r\nAnd the man hadn’t done anything and it’s just that- the \r\nunion made a difference.  You had to have some reason for \r\nhi-firing a man. And they really did help.  So...what \r\n----------------Page (19) Break----------------\r\n 21 \r\nhappened to me had nothing to do with me feeling the union \r\nwas a good thing. It was just what they were doing to me \r\nwas not what I would accept. \r\n \r\nDe Mare: Right... \r\n \r\nSargent: And so they accepted what I said and left me \r\nalone. \r\n \r\nDe Mare:  Can you tell that story about you being the \r\nfastest riveter?  Can you tell that story for me? \r\n \r\nSargent:  Well I had this paper there but it’s- they timed.  \r\nThey were always timing people.  How much it took for this \r\nand how much time it took for that. And they timed the \r\nnight- the day shift workers first and then they timed the \r\nnight shift.  And I- everyone agreed that I driving anymore \r\nrivets than anyone else. So I beat the day shift. Two or \r\nthree rivets a minute. So...and I’ve got the thing that tells \r\nexactly how many rivets but that’s not important really.  \r\nBut I had a great deal of pride in in because I had grown \r\nup without any advantages myself and having a place in the \r\nmaking of history and the winning of the war and all this \r\nwas very, gave me a lot of pride.  I had great pride in my \r\n----------------Page (20) Break----------------\r\n 22 \r\nwork.  And sill, I got a model of the Helldiver in my \r\nbedroom.  I look at the thing at night. LAUGHS. But it’s \r\nit’s...I’ve based a lot of my life on pride.  Even though I \r\ncame from a poor section, I was determined to have an \r\neducation and I almost have a doctorate. And that’s...and \r\nthat’s a good accomplishment. And I then, I know that I did \r\na good job on my work, my war work. \r\n \r\n24:44:08------------------------------------------------- \r\n \r\nDe Mare:  And do you feel...So I’m going to ask you this and \r\nI think that you’ve answered it but I would love it if you \r\ncould talk about it.  Doing that work and the work was so \r\nimportant that you were doing. You know working on the \r\nHelldiver and working you know on the B52s, which I can’t \r\nbelieve just the scope of that. \r\n \r\nSargent: Oh yes. \r\n \r\nDe Mare:  Can you talk about how that helped you in your \r\nlife personally? \r\n \r\nSargent: Well of course it made me self-supporting even \r\nthough I had a husband who worked.  I could feel that I \r\n----------------Page (21) Break----------------\r\n 23 \r\ncould contribute to the welfare of my family.  And of \r\ncourse, if I had not worked I would never have been in the \r\nposition ever to go to college or send my kids to college \r\nbecause you know one person could not make enough to do \r\nmore than just take care of us. So it did make a difference \r\nin my life.  \r\n \r\nDe Mare: And um... \r\n \r\nKelly: Sorry. We have about five minutes. \r\n \r\nDe Mare:  Ok, so we only have a little bit more time \r\nunfortunately so what we want to get to is just if you \r\ncould tell us the story of what you did to help with the \r\nWar Memorial and with getting the Rosies recognized.  \r\n \r\n25:54:02------------------------------------------------ \r\n \r\nSargent:  Well Fran has done most of what has been done to \r\nget them recognized.  I give her credit for really doing a \r\ngood job.  And she has done most of that.  But for the \r\nWorld War II memorial that was a thing close to my heart \r\ntoo.  And I would get out on street corners and pass out \r\nthose little pamphlets that they gave to have you send in \r\n----------------Page (22) Break----------------\r\n 24 \r\nmoney. And do that.  I also wrote articles in the \r\nnewspaper.  Every time I could get somebody to accept it I \r\nwould write another article. Opinion page or what-have-you, \r\nI wrote it. And then I would uh, what else did I do, John?  \r\nLAUGHS. \r\n \r\nKelly:  John, you can say it now because she’s not talking. \r\n \r\nJohn:  Uh? \r\n \r\nSargent:  I wrote to different people who had money like \r\nGates and Oprah and his plant and uh, uh my husband’s \r\nplant.  And say here, ‘He was a veteran and he helped win \r\nthe war and you better send some money to help us build a \r\nmemorial to him.’  And they all gave ‘cause we we had a \r\npool inside the office there.  A young man who liked us and \r\nhe would tell us when checks would come in that I helped to \r\nget.  He would tell us about it so we got a lot of things. \r\nThey have made another commentary of me. And it was made, \r\nwhat about ten years ago? On CBS. \r\n \r\nJohn: A bit before she... \r\n \r\n----------------Page (23) Break----------------\r\n 25 \r\nSargent: And that was about the time I was working so hard.  \r\nI had, I went to Washington several times. Maryland, places \r\naround to make speeches to raise money.  And um, that’s \r\nwhat he’s talking about.  They made a commentary of that \r\nand you might want to look back in the archives and find \r\nthat. \r\n \r\n27:48:00------------------------------------------------- \r\n \r\nDe Mare: Now what was done at the memorial to honor the \r\nRosies? Can you tell us? \r\n \r\nSargent:  Well they have a a system set up with all the \r\nnames and you can go there and punch in the name you want \r\nand they will tell you can locate it and they are honored \r\njust like the men.  It’s a wonderful thing, a wonderful \r\nthing. And it’s the first time that women have been honored \r\nin any memorial and that- that was really a plus to me but \r\nI wanted the men honored too because I lost an uncle in \r\nOkinawa. And um, it’s... uh, the War Memorial, it’s a special \r\nthing for me.  It feels I feel that I own part of it. I \r\nhelped...and I say to myself and that’s really stretching the \r\npoint but I say to myself, I helped build that that little \r\narticle there or that one, you know and just pretend to \r\n----------------Page (24) Break----------------\r\n 26 \r\nmyself. But of course I know what little I did didn’t touch \r\nmuch but it helped.  \r\n \r\nDe Mare:  I think it did... \r\n \r\nSargent: And there were wonderful people working there, \r\nwonderful people.  Bob Dole was in charge of it at the time \r\nand he’s a really nice person and uh, uh, I can’t name all \r\nof the persons but he was the head of it. So that was a \r\ngood experience of me because they brought me up there \r\nthree or four times to make speeches and stuff and I felt \r\nso honored.  Here I am, this little girl out of the sticks, \r\nand they are bringing me up here to make speeches to these, \r\nyou know there were these people with these degrees and \r\nwhat-have-you up there. Rich people.  That I was telling \r\nthe story... \r\n \r\nKelly:  Why was it so important to you to get that monument \r\nbuilt? \r\n \r\nSargent: Oh yea it was really was.  And and I felt so \r\nhonored that what I did, such a little bit I did such a \r\nlittle bit that did was helping to do that. And you go over \r\nthere and see it, it’s such wonderful place. Have you seen \r\n----------------Page (25) Break----------------\r\n 27 \r\nit?  You you just can’t imagine what it does to me. You \r\njust can’t imagine.  And I had a cousin who her father got \r\nkilled in service and she wanted to go when I- when they \r\ndedicated the grounds and it was just wonderful to watch \r\nher. How- Because her father was being honored more than \r\nother people might say because it was her father. The whole \r\nthing, the whole experience was just wonderful for me. And \r\nthe Rosies, I feel a kinship with them because they were \r\nthere working with me.  I didn’t see all of them but they \r\nall had their little part to do and without the Rosies we \r\ncouldn’t have done it.  And when you think about it the \r\nworld was on its knees. Europe was down you know.  England \r\nwas gone and and France was gone and he we were.  Our men \r\nwere off everywhere. All over the world.  Most of our Navy \r\nwas gone, except the carriers and the plan I built flew \r\nfrom a carrier.  Now, now that’s a wonderful story.  My \r\nlittle plane could help bring us out of that.  It was a \r\nlittle plane but it did it- it was noisy.  It it blasted \r\nthem.  And the Navy, the fact that most of it got destroyed \r\nin Pearl Harbor but we still, our aircraft carriers were \r\noutside.  And our little planes that I helped build helped \r\nto win the war. It didn’t win it but it helped. And, and...it \r\nmakes me feel really important sometimes when I think about \r\nit, I think well you shouldn’t be so self-satisfied well \r\n----------------Page (26) Break----------------\r\n 28 \r\nnot self-satisfied it’s just that without us the men \r\nweren’t there. Without us, they couldn’t have done it.  \r\nEngland had nobody left.  They were being bombed to bits.  \r\nWho could do it but us? And we were there and we did it. \r\nAnd the Rosies are the being complemented for what they \r\ndid.  We had some great Rosies. \r\n \r\nKelly:  Thank you. \r\n \r\nDe Mare: Thank you so much. \r\n----------------Page (27) Break----------------\r\n"}}]