[{"type":"add","id":"robey-girls","fields":{"identifier":"ROSIE_INTERVIEW_008","url":"/interviews/robey-girls","label":"The Robey Girls","description":"Marilyn Dawson, Doris Corrigan, and Marge Frederiksen talk about life and work on the home front in the small Midwestern town of Newaygo, Michigan.","image":"/images/ROSIE_INTERVIEW_008-interview-thumbnail.jpg","content":" \r\n \r\n \r\n \r\n \r\nThe Robey Girls: \r\n \r\nMarilyn Dawson, Doris Corrigan & Marjorie Frederiksen \r\n \r\nThe Real Rosie The Riveter Project \r\n \r\nInterview 8 \r\n \r\n \r\n \r\n \r\n \r\n \r\nInterview Conducted by \r\n \r\nAnne de Mare & Kirsten Kelly \r\n \r\nMay 7, 2010 \r\n \r\nNewaygo, Michigan \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\nFor The \r\n \r\nTamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\n      New York University \r\n \r\n \r\n \r\n \r\n \r\n \r\n----------------Page (0) Break----------------\r\n \r\n \r\nInterview: Marilyn Dawson, Doris Corrigan & Marjorie Frederiksen \r\n \r\nInterviewers: Anne de Mare & Kirsten Kelly \r\n \r\nDate:  May 7, 2010 \r\n \r\nPlace:  Newaygo, Michigan \r\n \r\n \r\n \r\nDawson: Hi I'm Marilyn Cornell Dawson, and I was born in 1925, \r\nDecember 10\r\nth\r\n, and 2010 I will be 85 years old. I had a good life and \r\nstarted to work for Mr. Robey's factory, Mr. Robey's factory in 1944 \r\nand worked there 'til after the war. And during that time, Bill \r\nEdwards, who I was engaged to was killed and – do you want stuff like \r\nthis? – and Mr. Robey had to come in to tell me and took me up to his \r\ndad's house. I mean up to his dad's house and that. But anyhow, so I \r\nworked there until after the war – what else do you want I don't \r\nknow, that's ok? \r\n \r\nKelly: Yeah, that's great. \r\n \r\nDawson: So that was the tragedy of that time. But a wonderful, just a \r\nwonderful fella, and, but twenty some years later, thirty five, \r\nthirty seven years later I married his cousin, Philip Dawson, and had \r\na wonderful life with him, ok. And that's my life. \r\n \r\nKelly: Thank you, thank you so much. Do you want to introduce \r\n----------------Page (1) Break----------------\r\nyourself, and a little bit of your... \r\n \r\nCorrigan: I'm Doris Crosser Corrigan and in 1944 I married my \r\nhusband, Ray. We've now been married 65 years, good years. And when I \r\ngraduated out of Newaygo High school in 1944, I started looking for a \r\njob and I tried here and there and then I heard about Robey's and so \r\nI got a job there and worked there 'til uh, let's see, I worked there \r\n'til the following year. \r\n Ray and I started going together in 1943 and then we decided to \r\nget married in 1944. But of course he was away in the Navy and so he \r\nhad a five day leave in October and so he said “We'll get married \r\nthen.” So I told Mr. Robey, who was sometimes hard to get along with, \r\nand but anyway, I said to him “I need five days off to get married in \r\nOctober,” you know. And he turned around, and someone else said “She \r\nwants five days off to get married.” But anyway, so that's what \r\nhappened. \r\n And, so anyway, but and at Robey's, when I first started there, \r\nthere were of course quite a few people, but Ruby Edwards and Willie \r\nGillette were two of them that I got acquainted with real quick and \r\nwe remained friends forever, and they were just really sweet people \r\nand then Marilyn came to work there too a short time after that, and \r\nso... \r\n \r\nDawson: We've been good friends ever since. \r\n \r\n----------------Page (2) Break----------------\r\nCorrigan: We've all been friends ever since. \r\n \r\nFrederiksen: My  name is Margie Frederiksen and I'm 83. Been married \r\n63 years - the same guy, and I worked in Robey's from, for about a \r\nyear and a half. I left, my now husband came home from the service \r\nand he went to Michigan State, so off we went to Michigan State, so \r\nwe have had a wonderful 63 years. \r\n \r\nDawson: She really has, she really has. \r\n \r\n00:04:11:20--------------------------------------------------------- \r\n \r\nDawson:  In Robey, when we'd be working we'd go to the post office \r\nand get our mail – we probably had five minutes to run across the \r\nstreet in Newaygo. And I was - we'd go to the bathrooms and I'd read  \r\na letter from my boyfriend, Bill, who his dad - in fact I got a \r\nletter from someone that he had wrote to another fellow in Newaygo \r\nsaying I'm going to be home to marry my girlfriend Marilyn in \r\nNewaygo. And his dad was going to get an engagement ring, your \r\ngrandpa, Bunny, and uh it just never happened. But I was still part \r\nof the family all those years and I always will be, but I guess, I \r\ndon't know. \r\n Oh, well, then Robey, Mr. Robey, would send his wife, Mrs. \r\nRobey, who became a teacher later, my children had 'em, and he'd say \r\n“You go in and tell them to get out here. They're in there reading \r\n----------------Page (3) Break----------------\r\ntheir mail from the boys.” And Olive had to come in one time and say \r\n“Marilyn.” So I had to put the letter away, and I wanted to finish \r\nreading that letter so bad, but we had to get back to work. We were \r\nworking piece work then. We didn't stop. Oh, just... \r\n \r\n00:05:37:02--------------------------------------------------------- \r\n \r\nKelly: Were you all from, you said you were from Chicago. \r\n \r\nCorrigan: They were in Newaygo. \r\n \r\nDawson: Well, we came up and spent our summers. That's how I got to \r\nknow so many people and know my husband that I married after he came \r\nback from the war. And Margie too. Margie's my cousin, and she lived \r\nwith us after her mother passed away. Had a wonderful father, I'll \r\ntell you the best – well we both had good fathers. But my mother and \r\nher dad were brother and sister. \r\n So every summer for three months, we got out of school, we'd \r\ncome to Newaygo out to one of the lakes, called Emerald Lake and we \r\nhad a cottage there and my dad would come up every two weeks, bring \r\nour friends up, cousins, and that's how I met Ray, her husband the \r\nfirst time, never think anything of it, but I became best friends \r\nwith his wife. And Margie met her husband here and married him after \r\nthe war too. And Bob and it's just a wonderful town to grow up in. So \r\nI was already graduated in Chicago, and Margie and my brother \r\n----------------Page (4) Break----------------\r\nfinished up here in Newaygo, so, 'cause my sister married someone \r\nfrom Newaygo here and that's how we got to Newaygo to live, you know, \r\npermanently.  \r\n \r\n00:06:54:17--------------------------------------------------------- \r\n \r\nCorrigan: You know I noticed that none of us have told you how many \r\nchildren we had, so she had, what, four boys? \r\n \r\nDawson: Four boys that were raised in Newaygo and all retiring now, \r\nexcept my youngest. They played in the band, played football. It was \r\n– that' s why my dad wanted to get us out of Chicago, so and Margie \r\nand I both went to the same high school. It was a girl's school. And \r\nmy brother went to a boy's school, so, but they did good, Margie \r\nand... Yep, now I've got a bunch of grand – a lot, a lot of great \r\ngrandchildren now. \r\n \r\n00:7:34:01---------------------------------------------------------- \r\nKelly: Are you from Newaygo, did you grow up here? \r\n \r\nCorrigan: No, well just about, we moved to Newaygo, my family did, \r\nfrom Mount Pleasant in 1936, so I've been here a long time, and \r\nanyway, we have three children, Carol our oldest one, and then Steve \r\nour son and Sherry, our youngest one, so we have three. We had eight \r\ngrandchildren and let's see, I can't remember how many there are, \r\n----------------Page (5) Break----------------\r\ngrandkids - about 14 great grandkids I mean. So anyway, but, so we \r\nhave a wonderful family. \r\n Last October we celebrated with every single one of them was \r\nthere, some came from as far away as Florida, but we had a party for \r\nour 65\r\nth\r\n wedding anniversary and had our pictures taken and all of \r\nour kids and grandkids were there. So that... \r\n \r\n00:08:24:17--------------------------------------------------------- \r\n \r\nKelly: So I want to take you, I want to talk a little bit about your \r\nlives before you went to work, before the war. What was this town \r\nlike and what were your lives like here before you went to work. \r\n \r\nDawson: In Chicago, we had, on the corners, in fact we were head of a \r\ngroup of the kids to plant something for the war days, 'cause in my,  \r\nChicago, the houses were right on top of each other. But good \r\nfriends, you know everybody was such good friends. We played in the \r\nstreets and everything else there. And a park, big park, but and then \r\nwe had [Shinpucks?] where we could just buy so much. \r\n And then high school too, and cooking class. One they made, I \r\ndon't even want to say it was brains we had to cook, it was awful. I \r\nthink it was something like that. It smelled up the whole classroom \r\nin Chicago. I don't know what Margie – she was probably making \r\nstrawberry shortcake, or something good in her class. \r\n But we had a good thing going in Chicago for the war effort. \r\n----------------Page (6) Break----------------\r\nYep, planted gardens. Everybody planted gardens in Chicago, and \r\nNewaygo too I think they did that. \r\n \r\n00:09:49:03--------------------------------------------------------- \r\n \r\nCorrigan: Well I guess life here was probably like any life in you \r\nknow a small town. I mean everybody knew each other 'cause it was a \r\nsmall town and... \r\n \r\nDawson: We'd all walk to work, down that hill. \r\n \r\nCorrigan: Yeah, we didn't have far to get to work. \r\n \r\nDawson: No cars.  \r\n \r\nCorrigan: But anyway, I had something in my mind a minute ago I was \r\ngoing to tell them. But oh, one day, while we were at work, we had, \r\nwe were making shovel carriers, they called them. And they were, it \r\nwas, we had big sewing machines, not like ladies have, but big ones, \r\nand then, and this material for the shovel carriers were heavy it was \r\nheavy stuff, you know, and it was hard, really hard sewing now, one \r\nday I ran a needle... \r\n \r\nclock chimes \r\n \r\n----------------Page (7) Break----------------\r\nKelly: I'm going to hold you just a sec 'til this is done otherwise \r\nit will cover your... \r\n \r\nCorrigan: One day at work I ran my needle down, right down through \r\ninto my finger and Mr. Robey, that time he was gentle. And he come \r\nand he had to take the needle out of the machine and with the needle \r\nstill in my finger he took me down the street to Doctor Moore's who \r\nwas the town doctor, you know, and had it taken out and then he took \r\nme home and told me I could have the rest of the day off. And so, but \r\nanyway, his wife, Mrs. Robey, the one that we, you know, years later, \r\nwe all thought the world of her. He had a real feisty personality, \r\nbut she was just the opposite. \r\n \r\nDawson: Yeah, she was a sweetheart. \r\n \r\nCorrigan: Anyway, but I enjoyed my work there. And just my life, \r\nperiod, has been good.  \r\n \r\n00:11:35:22--------------------------------------------------------- \r\n \r\nKelly: Can you talk about when the war broke out, can you talk about \r\nthat? \r\n \r\nFrederiksen: Oh yes, I can. \r\n \r\n----------------Page (8) Break----------------\r\nCorrigan: Pearl Harbor. \r\n \r\nDawson: I was in high school - go ahead Margie. \r\n \r\nFrederiksen: I was in school and we all went from church to church \r\nwhen they announced the war was over and everybody celebrated. The \r\nwhole town became one and it was great. \r\n \r\nKelly: And that was when the war was done? \r\n \r\nFrederiksen: Yes. \r\n \r\nCorrigan: Oh, when it was done. \r\n \r\nDawson: I was going to say, no, before the war. \r\n \r\nFrederiksen: When it was done. Before that we weren't here.  \r\n \r\nDawson: Yeah, no, I remember.  \r\n \r\nFrederiksen: We weren't here then, so...  \r\n \r\nDawson: Yep, I'm trying to think what song I had to sing for, we went \r\nto a girls school, we went, and I'm trying to think what song I was \r\nsupposed to sing and I got the mumps and I couldn't sing it in the \r\n----------------Page (9) Break----------------\r\nassembly and boy was I, I was so nervous, but played in the band in \r\nhigh school. Marched down the boulevard in high school in Chicago got \r\na picture of that. I don't even know, the drum and bugle corp. It was \r\njust a good life in Chicago too, but the war really, we felt it more \r\nwhen we came up to Michigan 'cause they were drafting, then, kids we \r\nknew and like my boyfriend was drafted, Margie's Bob I don't know... \r\n \r\nCorrigan: Both those were in my class. \r\n \r\nDawson: They didn't finish high school because they had to go to the \r\nwar so it really hit hard. Yeah, and I just can't remember if Bill \r\ngraduated or if he went 'cause we all said goodbye to him – Bonnie \r\nwas just a little girl. \r\n \r\nFrederiksen: He was... \r\n \r\nDawson: And we said goodbye to him at the railroad. I don't think you \r\nwere born yet, Bonnie, were you?  \r\n \r\nOff Camera: I was born... \r\n \r\nDawson: 'Cause your dad was gone. And we all went to Grand Rapids and \r\nsaid goodbye to him after he was home on leave and that was the last \r\ntime Bill, until he came home after the war. That was terrible, \r\ndevastating, really was. And, but it was after we moved here that \r\n----------------Page (10) Break----------------\r\nreally it hit bad because our young 18 years old were being drafted \r\nright away. \r\n \r\nCorrigan: Well yeah, that's why I wanted to tell you that both Bob \r\nFrederiksen and Bill Edwards were both in my class. The class of \r\n1944. When each one of them had their 18\r\nth\r\n birthday, even though they \r\nwere in school, they immediately were drafted into the service. \r\n \r\nFrederiksen: No, Bob enlisted. \r\n \r\nCorrigan: Yeah but he went ahead of time because... \r\n \r\nFrederiksen: Bob enlisted. \r\n \r\nCorrigan: Yeah. \r\n \r\nFrederiksen: And then the government class, they all, there were the \r\n'sinful six' and they taught them government, so they could graduate. \r\nAnd my husband was the president of the class so he always felt bad \r\nhe missed that part but he wanted to go into the air force and that's \r\nwhy he enlisted. So he could go where he wanted to. \r\n \r\nCorrigan: That's why I said about Bill Edwards. He was a super nice \r\nguy. And of course I went all through school with him, we did. But he \r\nwas her boyfriend, and my classmate and Ruby's brother in law, so we \r\n----------------Page (11) Break----------------\r\nall had an attachment there. \r\n \r\n00:15:26:07--------------------------------------------------------- \r\n \r\nKelly: It's a small town, isn't it? Where everybody just... \r\n \r\nDawson: Oh yeah. \r\n \r\nFrederiksen: Oh yeah. \r\n \r\nDawson: Well we lived up right on the hill and we walked down that \r\nhill in Newaygo to work. Then I also worked at Rowe's factory, but he \r\nwasn't making things for the war. He was before it. But we'd see the \r\nprisoners come across the bridge from Germany and they had a place in \r\nFreemont where they stayed, uh huh. And they were on the back of a \r\ntruck and they worked the fields they would work in Grant. \r\n \r\nFrederiksen: They worked for Gerber's. \r\n \r\nDawson:  The prisoners of war were there. \r\n \r\nFrederiksen: Baby's food. \r\n \r\nDawson: That would be it. \r\n \r\n----------------Page (12) Break----------------\r\nCorrigan: The summer before that I worked at Gerber's and... \r\n \r\nFrederiksen: I did too. \r\n \r\nCorrigan: And while I was over to Gerber’s, we seen prisoners, the \r\nGerman prisoners, and it was kind of scary... \r\n \r\nDawson: There was some. \r\n \r\nCrrigan: But you know they put them to work at this and that, but \r\nanyway, it was kind of scary to see German prisoners when we were at \r\nwar with Germany you know. \r\n \r\nDawson: But I don't know where their camp was in Freemont, I can't \r\nremember that. \r\n \r\nCorrigan: I don't know but we seen them around Gerber's when we were \r\nover there. \r\n \r\nDawson: They'd come across the bridge and I worked for my brother in \r\nlaw in a big factory as you cross the bridge going into Newaygo it \r\nwas right where the bridge... \r\n \r\nCorrigan: Yeah, Rowe's factory. \r\n \r\n----------------Page (13) Break----------------\r\nDawson: And it was a great big Rowe's factory there and so I worked \r\nfor my brother in law. But they were making nothing for the war, I \r\ndon't think, for the war. It was all wooden parts and stuff. And, \r\nbut, yep, it was really sad. \r\n \r\nFrederiksen: I think... \r\n \r\nDawson: Well and Bob Sherwood was the first one - no Bob was the \r\nfirst one that got killed going to Vietnam, 'cause my son joined the \r\nmarines. He was two years in Vietnam he was. Right now you can feel \r\nfor these parents and these young boys going over there. I don't \r\neven... It's terrible. I know what they're going through and the \r\nparents are going through losing their sons. \r\n \r\nCorrigan: I would like to say that the... \r\n \r\nDawson: I'll start crying here pretty soon. \r\n \r\nCorrigan: That the people at home, whether they were Rosie the \r\nRiveter or anybody else, you know... But the real heros of course \r\nwere the service men and women, and especially those that died. \r\n \r\nFrederiksen, Dawson: Right. \r\n \r\nDawson: Now a friend of ours in Newaygo, Joe Adams had saved all \r\n----------------Page (14) Break----------------\r\nthese letters. Saved one of Bob Frederiksen's that he wrote home \r\nduring the war and Nancy Carlson... \r\n \r\nKelly: Excuse me, just one second... \r\n \r\n00:18:01:06---------------------------------------------------------- \r\n \r\nDawson: Wait, oh yes. So he died a couple of years ago, and his \r\nnieces and two - Nancy Carlson and Patty Gustom - were going through \r\na lot of things to help the niece 'cause Patty Gustom knew her real \r\nwell, Joe's niece. And they came across these letters and Nancy \r\nCarlson copied one, sent it to me, that Bill had wrote Joe Adams. And \r\nBob had got one before I knew that I had, was on one, and that's when \r\nhe wrote “The war is hell. Join the navy,” and he said “All we do is \r\nlearn how to kill.” and that's, yeah, and he was not a killer. And as \r\nsoon as they landed on Okinawa he got wounded and two other fellas \r\nfrom Newaygo told me about it later. I guess he got shot in his face. \r\nHe didn't make it. They'd just landed on Okinawa and it was terrible. \r\n \r\nCorrigan: That was one of the worst ones. \r\n \r\nFrederiksen: I think w... \r\n \r\nDawson: But Bob wrote a letter to Joe and he kept my cousin's, Bob's, \r\nletter too, and gave that to Bob. Bob was telling about us when we \r\n----------------Page (15) Break----------------\r\nwere up to... \r\n \r\nCorrigan: Can you bring me that scrapbook? \r\n \r\nDawson: And then, um, yep, and you sent me - last year she sent me - \r\na picture of Bill in a heart and she knew how much it meant to me to \r\nhave that. So its in my Flor... I wanted to bring it home, I wanted \r\nto keep it here. It's in my trailer. It was on for my Christmas tree \r\nyou sent it to me. \r\n \r\nCorrigan: I just wanted to show you that I... \r\n \r\nFrederiksen: We live in a small town. It's much more personal. \r\n \r\nDawson: Who was the first one that got killed? He worked at the gas \r\nstation in Newaygo. \r\n \r\nCorrigan: I don't remember. \r\n \r\nFrederiksen: You know, coming from a small town everybody knows \r\neverybody, good and bad. \r\n \r\nKelly: Everybody's involved. Anything hits very hard. \r\n \r\nDawson: Yeah, everybody in a small town. The senior class, this one \r\n----------------Page (16) Break----------------\r\nat Vietnam and it was Bob Sherwoood and he was killed right away and \r\nhis mother just lives  round the corner to me now, and his sister \r\nworks for the city. But the night of the football game they said a \r\nprayer for him, that he'd passed, got killed. It was the saddest \r\nfootball game and everybody was crying there, you know. It just, in \r\nmemory of Bob Sherwood. God. Young, young fella. \r\n \r\nCorrigan: This is, I've been putting this together for the last \r\nseveral years and you asked me if I had a scrapbook. But I just \r\nwanted to show you some of the things so you girls can see them in \r\nperson. I started going through this the other day and low and behold \r\nhere's one of the first pictures I had put in here, Rosie the \r\nRiveter.  \r\n \r\nDawson: Can they see that. \r\n \r\nKelly: I think what we'll do is that we'll have you hold up certain \r\nthings for us and then we might get close-ups later on. \r\n \r\nCorrigan: Oh, ok. \r\n \r\nKelly: So if you want to hold it like you just did. And so, can \r\nsomeone talk about exactly what you did at the, at the Rosie the \r\nRiveter factory? \r\n \r\n----------------Page (17) Break----------------\r\nDawson: Oh yes. Well the strap carriers that we had to hold the... \r\n \r\nCorrigan: That's to carry the shovels in, you know. \r\n \r\nDawson: Ok, they were about this wide and we had to sew all that \r\ntogether. There was a buckle on each end, so probably that's what you \r\n– maybe if something happened - but if you hit that you broke a \r\nneedle. Then there was somebody else – I wish I could – somebody must \r\nhave had one of those. Someone in Newaygo told me they did have and \r\nI've got - I think we'll have to call around and check. \r\n \r\nCorrigan: A shovel carrier you mean. I'd love to know. \r\n \r\nDawson: And but I swear that somebody either, it was after they were \r\nmaking the [junction], 'cause you could not sew those together. \r\nSomeone I swear was by that window, like stapling, not stapling, what \r\ndo I want to put a little... \r\n \r\nFrederiksen: Well John Botchirk worked... \r\n \r\nDawson: Yeah, but he was in charge of, maybe he...  \r\n \r\nFrederiksen: And Bill, Bill Corben \r\n \r\nDawson: And Bill Brown was there - his wife was teach... – principal \r\n----------------Page (18) Break----------------\r\nup to the high school. They called her Tillie, in fact I don't even \r\nremember her last name – but her last name was Brown. \r\n \r\n00:22:25:07--------------------------------------------------------- \r\nKelly: Was it unusual for women to be working at this time? \r\n \r\nDawson: Yes, I think so, in a factory. 'Cause Mr. Rowe never hired, I \r\nwas the, during the war I worked there, and he called me Cinderella \r\n'cause I was the only girl there at the factory. With all these older \r\nmen. I was only 18 years old, and so. But people in Newaygo were all \r\nso close, so close. Everybody was close, you know. \r\n \r\nKelly: So what was that like as you all went to work, and many times \r\nit was really going to work for the first time? \r\n \r\nDawson: Well we realized we were working for the war effort. Boy \r\nRobey let you know that. “Hey, this is something they need, these \r\nfellas.” Oh, I know, my cousin Howard said, on Okinawa too, he dug a \r\nfoxhole and never knowing we were, after the war I heard that, and \r\nthat we had made those. Probably other states were making 'em too, \r\nbut our little town had that contract to make the shovel carriers so \r\nthat was important to us. We felt, hey we were doing something for \r\nthe war and then just... \r\n \r\nCorrigan: Hand me over my diary. I mean I've got a diary there. \r\n----------------Page (19) Break----------------\r\n \r\nDawson: Your what? \r\n \r\nCorrigan: That diary there. 'Cause I had it in there. I was just \r\nreading through there and I put...  \r\n \r\nDawson: This gal has saved everything from high school. \r\n \r\nCorrigan: I save everything. That's how come I've been married so \r\nlong – I save everything. \r\n \r\nDawson: No, I think it's great. \r\n \r\nCorrigan: Anyhow, on September 27\r\nth\r\n in 1944 it was a Wednesday. And I \r\ngot up early, went to work. Mr. Robey was gone today. We finished the \r\ncontract, so that was over, and told, and we were told we could come \r\nback on Monday. She must have gave us a few days off. But anyway, so \r\nI mention that we had a contract with the government for that. \r\n \r\nDawson: So they must have got another one then too because I worked \r\nthere too... \r\n \r\nCorrigan: And here was a ration book, a real one. Some years back I \r\nmentioned to some of my relatives, “I wish I'd've saved a ration \r\nbook.” And one of them said, “Oh, I've got a couple of them.” I said, \r\n----------------Page (20) Break----------------\r\n“I'll give you five bucks for one.” And so I have one. This is what \r\nthey looked like. You girls will remember them. \r\n \r\nFrederiksen: I don't really, no. I don't remember, but I can \r\nremember, you know, my aunt and my mother... \r\n \r\nCorrigan: This was my aunt that this one come from. \r\n \r\nKelly: So what did you, so what did you do with... Do you remember \r\nhow much you earned? And what did you do with the money that you were \r\nearning. \r\n \r\nCorrigan: Well, I have to tell you something funny about that. I have \r\na sister, older than me, and she's in a nursing home in Grand Rapids \r\nnow, but anyway, I told her the other day about we were going to have \r\nthis meeting, and I said, “They tell us we are part of the Rosie the \r\nRiveter.” You know, and then she said, “Well, I was too, then,” she \r\nsays. “Because I worked...” She only worked there about two weeks, \r\nand she had applied at the telephone company in Freemont, which then \r\nafter she was at Robey's two weeks they called her so, she quit there \r\nand so she was only there a couple of weeks. But anyway... \r\n \r\nClock chimes. \r\n \r\nKelly: Wait a minute. Just a sec. \r\n----------------Page (21) Break----------------\r\n \r\n00:25:36:12--------------------------------------------------------- \r\n \r\nCorrigan: Ray had just had surgery and his brother Bill, who during \r\nthe war Bill was on the Hornet when it was sunk by the Japanese. And \r\nthe ship was sunk and they, a lot of the sailors were killed and then \r\nthe rest of them had to jump into the water. And they were in the \r\nwater for several hours before they were picked up. \r\n And Bill told us recently that – 'cause he didn't want, most of \r\nthem didn't want to talk about it, you know, that much. But he said \r\nthat a buddy of his saved his life because when a ship came up to \r\npick them up that there's great big wheels, which I didn't know, \r\nunderneath the ship going like this, and Bill was so anxious to get \r\nup close to the ship that he got too close and almost got sucked into \r\nthat. Which would have killed him, except that his, one of his \r\nbuddies pulled him away from it. So that was a story. \r\n But anyway, while Ray was recuperating from surgery one time, \r\nBill came up and he brought Ray some magazines to read, or whatever, \r\nand then he had this big packet of papers. And I said, “What is \r\nthat?” And he said, “Well, Freida saved these.” That's his wife. “She \r\nsaved these during the war.” And I still have them in the other room, \r\n'cause I made copies of them. \r\n And it was copies of almost all the boys in Newaygo – and some \r\nwomen – in Newaygo county who had served in World War II. There's \r\nstories and letters from their parents and back and forth. And I \r\n----------------Page (22) Break----------------\r\nsaid, “This is a treasure!” \r\n And I called her up and they were raggedy edges and everything, \r\nand I said, “If I'm careful with these, can I go and get them \r\ncopied?” You know, which I did. Took them to a copy shop. So I've got \r\ncopies of all the boys that were, you know, that, in Newaygo county, \r\nso it was other towns around here too. So that was a real thing, \r\nfind. \r\n Also recently, they've been telling World War II veterans that \r\nthey want their stories, you know. And so Ray wrote his story, and \r\nthen he... and Tom his... There were three... There were nine \r\nCorrigan boys, and four girls – big family. But three of them went in \r\nthe service. And Tom went first, and then Bill and then Ray was the \r\nyounger one. And he quit school right after Pearl Harbor, and he \r\njoined the navy. But anyway, so then these guys wrote their stories, \r\nand then they were put in the veterans place out here in Newaygo. \r\nThey put a veteran in each month in their monthly paper, and so these \r\nguys were in. So here were the three Corrigan boys, handsome too, \r\nevery one of them. \r\n \r\nDawson: I cut that out of the paper, you know, saved it. \r\n \r\nCorrigan: So this was their stories, you know, that they wrote up \r\nabout their experiences in the war. \r\n \r\n00:28:29:20--------------------------------------------------------- \r\n----------------Page (23) Break----------------\r\n \r\nKelly: Do you remember, so when you started working at the factory, \r\nat the Robey factory, do you remember how much you got paid? And \r\nwhat, what did you do with the money? \r\n \r\nCorrigan: Oh this is what I first started and didn't finish. When I \r\nsaid my sister said to me just the other day, “I remember,” she said, \r\n“that when I worked there,” but she was only there a short time, but \r\nshe said, “I told Mr. Robey one day,” - we got paid for how many we \r\ndid. \r\n \r\nDawson: Yeah, it was piecework. \r\n \r\nCorrigan: Yeah, piecework. And so at the end of the day you would go \r\nup and tell the office girls how many you did. But she... And they \r\nwould write it down, and you got paid accordingly. But anyway, so, \r\nbut my sister, Frances, went up, and she told me “I told Mr. Robey \r\nhow many I did today, and he said, 'Oh,' he said, 'Well then I'll \r\nprobably have to cut your wages.'” And so I said to her, “Don't ever \r\ntell him how many you did.” You know, and so she still remembered \r\nthat, you know. That was something. That was funny. \r\n \r\nDawson: But he must have trusted us if that's... I can't remember how \r\nwe did it. \r\n \r\n----------------Page (24) Break----------------\r\nCorrigan: Yeah, yeah we did. We had to turn it in to Arlene how many \r\nwe did, and they paid you accordingly. \r\n \r\nFrederiksen: Yes, yes. \r\n \r\nCorrigan: But as far as what'd we do with the money, huh, I mean, I \r\nsaved as much as I possibly could, because when we got married then I \r\nstarted getting a check from the navy for $50 a month, which was a \r\nlot, seemed like a lot. And then all the money that I earned I put \r\nwith that so that one year later when Ray, the war was over, and Ray \r\ncame home, I had saved $1,000 which, then, was quite a lot. \r\n \r\nDawson: Yes, it would have been a lot then, oh yes. \r\n \r\n00:30:16:18--------------------------------------------------------- \r\n \r\nKelly: And what did you, do you remember what you did with that money \r\nthat you saved? \r\n \r\nCorrigan: Well, when he got home? Well of course, we had to just \r\nstart out. We didn't have anything, you know. And the jobs were \r\nscarce after all those millions of people from the service came home. \r\nYou couldn't, there just weren't any jobs. Ray started out taking \r\nsome really lousy ones at first, you know. But eventually he got into \r\na good place and from then on he did well through the years. \r\n----------------Page (25) Break----------------\r\n \r\nDawson: He got to be a electrician. \r\n \r\nCorrigan: Yeah. \r\n \r\nKelly: And so talk about when, you know, when the war ended and you \r\nstarted talking about the jobs were scarce 'cause all these people \r\nwere coming home. Was there any, so all stopped working? And what \r\nhappened after you stopped working, and what was it like? \r\n \r\nCorrigan: You started keeping house and having babies. \r\n \r\nDawson: No. Well, I wasn't married yet but after the war I worked \r\ndown – it was a dime store, Newaygo Curly's Dime store, and Glenna \r\nButler and I worked there, and I think fourteen dollars a week, and \r\nthat was eight hours a day and every day. We had Thursday afternoon \r\noff, and I remember, Marge, we paid my mother so much. And I saved so \r\nmuch, 'cause my mother bought all the food. And my brother. I live in \r\nthe house now that we moved into. And Marge's husband had lived in \r\nthat house at one time, rented it, and now then they have a nice home \r\nup on the hill by a crick where we used to go swimming. \r\n But I saved it 'cause I had bought a war bond, and then there \r\nwas after, was it, after I was married and Mr. Henning worked at the \r\nbank he said, “You know, you have a savings account here.” I think \r\nthere was about twenty-nine dollars in it. I had forgotten. I guess \r\n----------------Page (26) Break----------------\r\ngetting married just shook me up or something. And I said, “Oh, I \r\ndo?” And I couldn't remember that I had savings in there. So we must \r\nhave saved a little bit of our money, you know. And so that came in \r\nhandy after I got married. If he hadn't told me, maybe it'd have \r\nincreased a lot of interest through the years. I'd've been a \r\nmillionaire. But there was, and the fellas, when they come home, it \r\nwas so good to see the ones that survived and came home. \r\n \r\nCorrigan: I made some copies of this that John got us into a couple \r\nof years ago. And over here... \r\n \r\nDawson: It was just last year. \r\n \r\nCorrigan: No, it was two years ago, wasn't it? \r\n \r\nDawson: No, it was last summer. \r\n \r\nFrederiksen: Last year. \r\n \r\nDawson: When we were the Robey Girls. \r\n \r\nCorrigan: Was it last year? \r\n \r\nFrederiksen: Last year. \r\n \r\n----------------Page (27) Break----------------\r\nDawson: This last Labor Day. \r\n \r\nCorrigan: Anyway... \r\n \r\nDawson: Doris! \r\n \r\nCorrigan: Well, yeah, I'm kinda forgetful. Anyway, this is... he got \r\nus together, made us ride in a buggy with horses and get in the Labor \r\nDay parade. So there was the write up about that. \r\n You know how that all got started was when Willie died, that was \r\nhis, John's, mother, they had, the family had, put a little piece in \r\nthe paper, in the Indicator, that they would like to hear from other \r\npeople any thoughts they had of Willie. And of course, that didn't \r\ntake me long to start putting something together because we had \r\nworked with her, you know, and been friends ever since. So then I \r\nwrote up a little story, which I guess, and I had sent it to his \r\nfamily. I sent it to Willie's address 'cause I knew some of them were \r\nliving there, but anyway, and I guess they gave it to John, whoever \r\nwas there, and then he took it from there and decided that we ought \r\nto be in that parade, as the... \r\n \r\nDawson: Well that was the honor, what'd they call... \r\n \r\nCorrigan: Well, they called us the 'Grand Marshals'. \r\n \r\n----------------Page (28) Break----------------\r\nDawson: Grand Marshals. And every year - Margie and Bob were the \r\nGrand Marshals one year. \r\n \r\nCorrigan: Oh, they were? \r\n \r\nDawson: Weren't you Margie? Yeah. \r\n \r\nFrederiksen: Yes.  \r\n \r\nDawson: And so that's an honor. \r\n \r\nCorrigan: And so I made some copies of this for you girls. \r\n \r\nDawson: We didn't expect and John had us all, has us all up there. \r\n \r\n00:34:18:13--------------------------------------------------------- \r\n \r\nKelly: And that was because you were the Robey Girls. \r\n \r\nDawson: Yes, and that was on this thing that says 'The Robey Girls' \r\nright there. \r\n \r\nCorrigan: Grand Marshals of the 'The Robey Girls of World War II' \r\nanyway... \r\n \r\n----------------Page (29) Break----------------\r\nDawson: And a lot of people didn't know anything about the Robey \r\nGirls until... \r\n \r\nCorrigan: Yes, and so that's why... \r\n \r\nFrederiksen: No. \r\n \r\nDawson: Even just having lunch. \r\n \r\nCorrigan: A lot of them said to me afterwards, “Well what were you \r\nsupposed to be?” So I wrote a letter over to the editor, who you'll \r\nget to know real well. \r\n \r\nDawson: Nice guy. \r\n \r\nCorrigan: He's always around with his camera. Rich Weeder. And \r\nanyway, so I wrote him a letter, so he puts the whole letter in here, \r\nand telling them that a lot of people didn't know what we were, these \r\nold ladies in this carriage were supposed to be, you know. So I \r\nexplained it to him, but then he put it in the paper. So there's a \r\ncopy of that. And there was a picture he took, we didn't know he had. \r\nThat he had taken of us. \r\n \r\nDawson: I don't know who took that. Was it him? \r\n \r\n----------------Page (30) Break----------------\r\nCorrigan: His, right here see, photo by Rich Weeder. \r\n \r\nDawson: Oh, ok, because I got one... \r\n \r\nCorrigan: Well you were sitting down to this end.  \r\n \r\nDawson: But then I have another one that Joe North took, and it was \r\njust the opposite side, but its good, a real nice one. \r\n \r\nCorrigan: But anyway, so I... \r\n \r\nKelly: So you want a little drink of water? \r\n \r\n00:35:25:01---------------------------------------------------------- \r\n \r\nFrederiksen: No, that's not Newaygo... \r\n \r\nCorrigan: No, that's not Newaygo, I don't know what this is. \r\n \r\nOff Camera: What did my mother tell me one time, Doris, that Mr. \r\nRobey got so angry about something and he threw... \r\n \r\nFrederiksen: A machine. \r\n \r\nOff Camera: That he knocked a machine over? \r\n----------------Page (31) Break----------------\r\n \r\nCorrigan: Yes, he was... I heard though, after the war, that he \r\nstarted going to church and he made a total change in his life. But \r\nhe was... \r\n \r\nOff Camera: Really? \r\n \r\nCorrigan:  But he was... Yeah, that's what I heard. \r\n \r\nKelly: We would love to hear that story. \r\n \r\n00:35:52:05--------------------------------------------------------- \r\n \r\nCorrigan: Hand me over that, that little chest which I want to show \r\nher. \r\n \r\nDawson: Here I'll get it. \r\n \r\nOff Camera: No no, I got it. \r\n \r\nDawson: Do you want the chest? \r\n \r\nCorrigan: Yeah. \r\n \r\nOff Camera: Oh God, that's a treasure! \r\n----------------Page (32) Break----------------\r\n \r\nCorrigan: It is a treasure. \r\n \r\nDawson: No, I'm getting too old. It's ok, I'm just teasing... \r\n \r\nCorrigan: No, I said 'it is a treasure.' \r\n \r\nKelly: She's a joker. I can tell. \r\n \r\nCorrigan: No, but I said, “It is a treasure, inside.” \r\n \r\n00:36:19:22--------------------------------------------------------- \r\n \r\nKelly: I would love to talk about even the story about Mr. Robey, and \r\nalso about his wife being a supervisor and kind of how... \r\n \r\nDawson: He had a temper – tell her about the temper. \r\n \r\nKelly: ...the views of men or, men or women... \r\n \r\nCorrigan: Well, when I first started there, when I first started \r\nthere I was, really got scared of him. Because he was, let's see, \r\nvery temperamental. He got mad... \r\n \r\nDawson: Well, he was a drinker. \r\n----------------Page (33) Break----------------\r\n \r\nCorrigan: And I didn't know that, but he wasn't on the job... \r\n \r\nDawson: Not on the job, but when he got home... \r\n \r\nCorrigan: Well anyway, he'd get upset real easy if we took a little \r\ntime off that he – like the day we all cried about Bill being killed \r\nand all that. And, she had left – somebody'd come got her, and the \r\nrest of us were still in the ladies room and then he come banged on \r\nthe door and said “Get out here and get back to work you can't... \r\nsitting in, standing in there bawling isn't going to help win the \r\nwar.” And so he put us back to work. \r\n But he was really very, and he'd get angry real quick. And the \r\nsewing machines we had were big sewing machines. Like I said, it was \r\ncanvas – that's what those carriers were made out of, shovel \r\ncarriers. And they were really hard sewing and everything, so but \r\nanyway, so we had lots of broken needles, and then of course he had \r\nto fix anything went wrong with the machine. But I remember one day \r\nthat he couldn't get one back together again. He gets up and just  \r\nshoves the thing and stuff just flew all over the room. We had a new \r\ngal, her name was, remember, Marie Dijon or something? \r\n \r\nDawson: Oh yes. \r\n \r\nCorrigan: She had just started and when he did that her eyes was just \r\n----------------Page (34) Break----------------\r\nhuge. So I told her later, “You'll get used to it after a while.” And \r\nso... \r\n \r\nDawson: Well he'd tip them right over, he'd get so mad. And then he'd \r\nstorm out but then later, he got, when Fisher was my minister, and he \r\nhad swore or something... Bill Martin said, “That's alright, I've \r\nheard worse.” He joined our church and directed the choir and I was \r\nin the choir for twenty years with him. \r\n \r\nCorrigan: Isn't that something. \r\n \r\nDawson: Well, maybe ten. I was in the choir long before that when we \r\nfirst moved to Newaygo, but... Yeah, and he was a whole different \r\nperson. But it was the drinking I think, putting up with all these \r\nwomen? I, maybe he had a reason to go home. \r\n And when my son was born, the day before my second son was \r\ncoming, they were coming, Bob, her Bob, and Ed Longcore they were all \r\nto my dad's house having a drink and talking about the war. Her \r\nhusband was on a bomber, Ed Longcore flew the bombers, and Earl was \r\non an island with a good friend of... lives in White Cloud now, three \r\nyears they were together... and he set Earl J. up, 'cause I was going \r\ninto labor, but he set my son up at the sink and he started to cry – \r\nprobably about the first time I ever... - and he said, “You have no \r\nidea what hell we went through.” \r\n And then I started to cry. And he said all they needed was one \r\n----------------Page (35) Break----------------\r\nbomb here to drop and they'll know what we were doing. And that's, he \r\nnever talked about it again. But I think the emotion from them all \r\ntalking, in fact they'd been downtown – it was Labor Day – and he's \r\ncoming up the po... – Bob, Margie's Bob, went home already – and I \r\nsaid, “Earl, I think I'm in labor.” \r\n He turned around. Ed Longcore turned around, walked home up the \r\nhill. He wasn't married yet. And Earl turned around and we marched \r\nhome and I went to the hospital that night. But he was feeling good. \r\nSo he got sick, and the nurse, she was an old time nurse. Old lady, \r\nI'd say at the time too, but she said, “Oh your husband's so worried \r\nabout you.” And I thought, “Hell, he's drunk.” I didn’t even swear \r\nthen. “He's not sick over me. He's sick 'cause he drank too much.” \r\nThat you can cut out. \r\n But that's the only time Earl really said it. And when my son \r\nwas in Vietnam he wrote, and I just gave him his letters, “If \r\nsomething happens to me I want him...” And he sent one home, a three \r\npage letter and he said, “Dad, if you feel mother should read \r\nthis...” I never did. Earl said, “I don't...” And he was in the \r\nmarines in a tank. It was really... And when I gave it back I said “I \r\ndidn't read it. Your dad really thought I shouldn't.” But that was \r\ntwo years of hell, he said to... But you know people... That's what I \r\nthink about these young kids dying over there now, and it's very sad. \r\n \r\n[In the background, while Dawson is talking: \r\nFrederiksen: Doris, how many women worked there? \r\n----------------Page (36) Break----------------\r\n \r\nCorrigan: I say maybe thirty, thirty five. \r\n \r\nFrederiksen: That many? \r\n \r\nCorrigan: I think so. Maybe there weren't that many. Probably not \r\nthat many. \r\n \r\nFrederiksen: How many girls were there?] \r\n \r\nCorrigan: What their families go through, you know. In fact I was \r\ngoing to say, having lived through, I don't mind that I'm eighty-five \r\nyears old because things that are history to the younger people are \r\nthings that we went through, starting with the great depression. \r\n \r\nDawson: Yes. \r\n \r\nCorrigan: Lived through all of that and then that went right into \r\nWorld War II, you know. So, but, anything that the people at home, \r\nwhether the women went to work, or whatever, didn't even, I mean it \r\nwas, the heroes were the soldiers. \r\n \r\nDawson: Yep, that's right. \r\n \r\nFrederiksen: Yes. \r\n----------------Page (37) Break----------------\r\n \r\nDawson: Well, even during the depression in Chicago if it wasn't for \r\nthe democrat, or Roosevelt with the WPA... \r\n \r\nCorrigan: That stood for 'we putter around.' \r\n \r\nDawson: I mean we had good jobs. People were killing themselves, and \r\nI was probably – I don't know how old we were – 'cause you lived \r\nupstairs grandpas, and we lived across the street then. So your \r\nmother was still alive, Margie, and I can remember then my, that her \r\ndad had a good job, and my dad. We were one of the 'lucky one.' But \r\nso many... And my grandpa worked for the post office, so he had a \r\nincome to help everybody, and my uncle, two uncles worked, so but it \r\nwas terrible, the news in Chicago during depression too. \r\n So we grew up with that and these kids now a days you can't even \r\nfind someone for ten bucks to do your lawn and the Towers that own \r\nthe big store downtown here, they come over with their lawnmower, \r\nDoug Towers, for three bucks and do my whole lawn. \r\n \r\nCorrigan: That was then. \r\n \r\nDawson: You know and these kids today, they're home watching TV. I'd \r\nget out and do my own lawn if I could now, but it's hard to find, and \r\neven in Florida, your Mexicans are all working on that field. You \r\ncouldn't get a high school kid out there now. And our boys in Newaygo \r\n----------------Page (38) Break----------------\r\nwent to high school, they would ride their bikes to Grant and make \r\nvery little in the fields. They did. Earl did and a lot of the kids \r\nfrom Newaygo went there to earn some money. We worked, what, about \r\ntwo hours for somebody, we called my mother, “Come get us.” We were \r\nfrom Chicago, we were going to pick string beans. \r\n \r\nCorrigan: You know Ray's sister Pat, you know, and I, one day before \r\nI went to Robey's, we were trying to find a job around, and we heard \r\nyou could work in the onions. What a job. So we went down there. And \r\none day was enough. It was hot. I mean horrible work. And so anyway \r\nwe both quit at the end of the day. That was enough of that, working \r\nin the onions. \r\n \r\nDawson: We didn't even last that long. \r\n \r\nCorrigan: Home sunburned and oh, it was awful, but anyway one day of \r\nthat was enough. So I was looking around, I didn't go to Robey's \r\nbecause they were, I didn't know they were going to be doing any war \r\nwork. It was a place I found a job, so. \r\n \r\nDawson: It was good. We had good years growing up. Good memories. \r\n \r\nCorrigan: But we had fun, made good friends and so. It doesn't matter \r\nif he was grouchy. Mrs. Robey was just the opposite, she had the \r\nopposite kind of personality, you know. \r\n----------------Page (39) Break----------------\r\n \r\n00:44:20:06--------------------------------------------------------- \r\n \r\nKelly: And she was a supervisor at this time? \r\n \r\nCorrigan: Well I don't know that she was a supervisor, but she was \r\naround there. \r\n \r\nDawson: I wouldn't call her a supervisor. She was there. She didn't \r\nwork in the office, I don't think. \r\n \r\nFrederiksen: No. \r\n \r\nCorrigan: No, she was just around there. \r\n \r\nDawson: I don't know what she was doing... \r\n \r\nCorrigan: Maybe she wasn't there everyday. \r\n \r\nDawson:...but I think now probably to keep peace when he'd get so \r\nangry. But, I can see him. And he turned out to be one of the nicest \r\nfellas you could ever know. You know, just I think everything was \r\nstrained to get all this done, you know. He had a quota, too, you \r\nknow. \r\n \r\n----------------Page (40) Break----------------\r\nFrederiksen: But he had... There were thirty women working, and... \r\n \r\nDawson: I'm through talking. I've talked too much now. \r\n \r\nFrederiksen: ...if thirty women - going with trying to keep them all \r\nat the same level. I could see why he could pick up a machine and \r\nthrow it. \r\n \r\nCorrigan: I remember when we got into the war, of course, was right \r\nafter Pearl Harbor. And I remember it was a Sunday afternoon when I \r\nheard it on the radio. You know what had happened. And that was \r\nDecember 7\r\nth\r\n, 1941. And Roosevelt immediately declared war on Japan \r\nand Germany because Winston Churchill over in England had been trying \r\nhis best to get us into the war to help them, you know, because of \r\nthe problem with Hitler. And so anyway, so that war started then. \r\n And then, but when it ended, after four years of it, you know, \r\nthat night, we lived up on the hill, and Marilyn lived just down the \r\nstreet a little bit, up on the, I call it the school house hill, but \r\nanyway, my sis..., we were eating supper and it come on the radio \r\nthat the war had just ended. And my sister and I forgot all about \r\nsupper and we went running downtown, as everybody did. Marilyn beat \r\nus down there. She was, there was, the men was either young or old. \r\nThey had a song going around then, “They're either too young or too \r\nold.” I mean, if you was looking for the marrying age. \r\n \r\n----------------Page (41) Break----------------\r\nDawson: I think they blew that fire whistle too. \r\n \r\nCorrigan: Oh yeah. But it was, everybody, it was just wild. And I \r\nhear it was this way all over the world, not j..., you know, all over \r\nthe world. \r\n \r\nDawson: We had to go to the show then, to see the newsreel what was \r\ngoing on. We had a theater down town. In fact, Robey's factory was a \r\nmovie theater. We'd come up from Chicago, and that had turned into a \r\nskating rink, during the war, and then he bought it. Now it's the \r\nMasonic Temple. \r\n \r\nCorrigan: The, well, but that night, anyway, it seemed like everybody \r\nrushed down town, you know. \r\n \r\nDawson: It was a little movie theater. \r\n \r\nCorrigan: The cars were going up and down the streets on the wrong \r\nside. It was just wild. But you know what, I told somebody, all I \r\ncould do is stand there and think, “He's coming home.” \r\n \r\nDawson: Yep, well you had Ray... yep. Oh that was cheering all over. \r\nAnd then you'd see it on the newsreel, you know, when you went to the \r\nshow, and everybody in Chicago, I can, you know, they were, oh all \r\nover, State Street there and the sailors mostly too. But it was an \r\n----------------Page (42) Break----------------\r\nexperience you... \r\n Oh, I know what I was going to sing in school. It was 'White \r\nChristmas.' It was Christmas time. And I must have sang it once \r\nbefore the parents all came for our concert, and then I played in the \r\nband too. But I can remember standing up there singing 'White \r\nChristmas', oh God. I never got up again. I didn't have that kind of \r\nvoice to be singing either. \r\n \r\nCorrigan: Well, look what you're doing now, with the camera. \r\n \r\n00:48:07:18--------------------------------------------------------- \r\n \r\nKelly: Do you, can you think back how that time... \r\n \r\nDawson: It was hard. \r\n \r\nKelly: ...changed you as a person? How going to work as women \r\nsupporting the role, can you think about or talk about how that might \r\nhave changed the rest of your life or changed you as a person? That \r\nexperience? \r\n \r\nDawson: I think it did probably everybody. \r\n \r\nFrederiksen: Yeah. \r\n \r\n----------------Page (43) Break----------------\r\nCorrigan: Well, it felt good to be doing something for the war. \r\n \r\nDawson: Yeah, that's, I think we were bragging a little bit too. \r\n \r\nCorrigan: Yeah. \r\n \r\nDawson: Couldn't help it. We thought we were doing... They dug, they \r\nused them in the foxholes, many of them. I know Howard, our cousin, \r\nsaid boy, when he was in Okinawa, and those Japs came in, and that's \r\nwhen our boys were landing and that's, and they talk about Okinawa \r\nnow, too, just a while ago, something, there's a cemetery there too. \r\n \r\nFrederiksen: I think it was foremost in our mind because most of us \r\nhad a loved one that was in the service... \r\n \r\nDawson: In fact I think it bothers me today with this going on and \r\nall. Oh, I'm sorry... \r\n \r\nFrederiksen: ...so I think that kept us focused to do what we could \r\ndo. \r\n \r\n00:49:31:05--------------------------------------------------------- \r\n \r\nDawson: Well see, in Chicago I was able to get a job, like at \r\nWalMart's, it was a... Not WalMart, Weeble, or Goldblatt's, and then \r\n----------------Page (44) Break----------------\r\nMargie was in school, I had already graduated. Well, I was working \r\nafter school and Saturdays and so I had a little extra money two days \r\na week working there. My mother worked in Montgomery Ward too. \r\n \r\nFrederiksen: I worked I think it was we all worked in the summer at \r\njobs and my kids did too. So, but the kids, kids nowadays. \r\n \r\nDawson: (talking over Frederiksen)I can't remember if you worked \r\nthen, Margie or not. Afterwards, in high school. Well we had our own \r\nmoney to buy stuff. \r\n \r\nCorrigan: Yeah, I know, they're lazy now. \r\n \r\nDawson: But you could buy a pair of shoes for two dollars. \r\n \r\nCorrigan: Just a few years ago, some of the fellas that were in the \r\nwar, that I talked to, and one was Ted Holton – all of these folks \r\nknow Ted Holton – and he died now. But he was at Pearl Harbor. And he \r\nsaid that sixty years later, every day of his life, he couldn't get \r\nthat scene out of his, out of his mind. What it was like when those \r\nplanes hit. I think his, yeah, his ship was sunk too. They had to \r\njump in the water. And he said they swam up to shore. And of course, \r\nas you've probably seen movies of Pearl Harbor, what it was like. But \r\nanyway, he said that [...] they tossed a great big gun to him, that he \r\ndidn't really know much about it, because they were trying to shoot \r\n----------------Page (45) Break----------------\r\nthe Japanese planes out of the sky, you know. \r\n \r\nDawson: Well when I was in Hawaii, we was on a tour, we were there \r\nthree weeks, and we took this boat out to see, the one that was,  \r\nI can't even remember what it was now, it's only probably four or \r\nfive years ago I was there, but the sunken ship. \r\n \r\nCorrigan: The memorial there for... \r\n \r\nDawson: Yeah, the memorial, and it's really something. \r\n \r\nCorrigan: I've got a picture of it in this book, in that book. \r\n \r\nDawson:  It's so, and you can see the ship down there. And probably \r\nthere was bodies on it left, I mean, it was sunk. \r\n \r\nCorrigan: Oh yeah. They say to this day there's still a little bit of \r\noil still coming up to the surface.  \r\n \r\nDawson: And it had a big... Oh it's really... and a movie we watched, \r\nthey had that there. If you ever get to, you've got to go. \r\n \r\nCorrigan: I've got a picture of it, back there. I got a picture in \r\nthat scrapbook. \r\n \r\n----------------Page (46) Break----------------\r\nDawson: Have you? \r\n \r\nCorrigan: Mmm hmm. Of the memorial. \r\n \r\nDawson: It's really something. Well, I've probably got them in mine \r\ntoo, 'cause I've got everything when we were in Hawaii. But I \r\nremember the first time you went, I thought, Oh is she lucky to get \r\nout of Newaygo, isn't that something. \r\n \r\nCorrigan: We went to, we took a trip to Japan. Ray was working for a \r\ncompany that made big machines and they sold them around the world \r\nand they had sold one to Japan, and then he was the one to go fix it \r\nif something went wrong with it. So he went to Japan, and then they \r\nwanted him to come again. And the next time he wanted to take me with \r\nhim, so I went with him. I had sisters that would take care of my \r\nkids. And, but anyway, that was quite an experience over there in \r\nJapan. And some of the Japanese that he worked with, they were all \r\nfriendly and everything. But they, but one of them, a young guy said \r\nto me one day right out of the blue, “That was an awful thing, that \r\nbomb.” And you know I said, I wasn't as mouthy then as I am now, but \r\nI should have said, “There'd have been no bomb if there'd've been no \r\nPearl Harbor.” You know, that's what I should have said to him. \r\n \r\nDawson: That was terrible, it was so terrible. \r\n \r\n----------------Page (47) Break----------------\r\nFrederiksen: But it saved a lot of American lives. \r\n \r\nDawson: You can see old movies, probably, of... \r\n \r\nKelly: What were you saying? \r\n \r\nFrederiksen: It saved a lot of American lives. The bomb. No matter \r\nwhat you say about it. \r\n \r\nCorrigan: In my scrapbook I've got pictures of a lot - Truman. He \r\nhad, that man had to make the biggest decision anybody ever had to \r\nmake. \r\n \r\nDawson: The atomic bomb. \r\n \r\nCorrigan: To use that bomb. Yeah, but he said it saved millions of \r\nAmerican lives. \r\n \r\nDawson: Definitely. \r\n \r\nCorrigan: Because so many of those islands, like Okinawa, where Bill \r\nwas killed. The Japs, I mean, they were just infested with \r\nJapanese... \r\n \r\nDawson: All over. \r\n----------------Page (48) Break----------------\r\n \r\nCorrigan: ...and they couldn't get rid of them all on all of those \r\nislands. \r\n \r\nDawson: Look what the Germans... \r\n \r\nCorrigan: And we were just losing so many lives. \r\n \r\nDawson: Look what the Germans did to the families and everything. It \r\nwas, it was hell. That's all I've got to say. It was a terrible \r\nthings that happened there. \r\n \r\n00:54:11:12--------------------------------------------------------- \r\n \r\nDawson: Well, I got the original. The Sun paper, and it's the date, \r\nand a picture, and it was taken on Maude Fox's porch, and I don't \r\nremember, but I must have sent it to the service men. We wrote to \r\neverybody, everybody in Newaygo. \r\n \r\nCorrigan: Yeah, you wrote to them, they told you to write to a lot of \r\npeople besides... \r\n \r\nDawson: And our little post office. They, I think the girls in \r\nNewaygo... \r\n \r\n----------------Page (49) Break----------------\r\nCorrigan: ...our boyfriends. \r\n \r\nDawson: ...'Cause we wrote to all our friends, you know. And Squint \r\nAbbot, I have a card gift from him, George Abbot, and yeah, I've kept \r\nall those things, isn't that something? And from Bill Edwards, I have \r\nhis letters and a tape he made on a little 45, yep, I've got that. \r\nHis voice is on that, maybe you should hear it sometime. But anyhow, \r\nWhat was I saying, I lose track. \r\n \r\nKelly: The pin-up girl.  \r\n \r\nDawson: Oh, that. \r\n \r\nKelly: How you became a pin-up girl. \r\n \r\nDawson: No, I just. He said to get it out, and this is here, in 1946. \r\n \r\nKelly: Can I hold the paper bag, so it doesn't... \r\n \r\nDawson: Oh, oh ok. Well, I'll just take this stuff out, that's all. \r\nBut here's a picture in the Chicago Sun, 1945, and here's the picture \r\nhere. That's all it said. My mother must have kept it – I didn't. And \r\nthen the bottom part of it... \r\n \r\nCorrigan: This is the picture, here? \r\n----------------Page (50) Break----------------\r\n \r\nDawson: Yeah. It was taken at Maude Fox's. \r\n \r\nde Mare: Can you, can you hold it still for this? \r\n \r\nDawson: Yeah, can you, you want to see the original Chicago Sun? Oh \r\nwait, I can open it up. Probably very fragile. \r\n \r\nde Mare: That's you on the bottom? \r\n \r\nDawson: Right, right here. Uh huh. That's the one. \r\n \r\nCorrigan: So how did it get to be a pin-up girl, by...? \r\n \r\nDawson: Well, there was quite an article about it, and then I got the \r\nother half of it, and then I got the other half of it. I couldn't \r\nfind it at first, but it was in a picture frame in the basement. \r\n \r\nCorrigan: Where was it put up, in a barracks or something? \r\n \r\nDawson: No, then the other one well, I'll tell you that one. Yeah, \r\nsomeone found it – you'll have to read it. And this is the one in \r\n1946, April four... Uncle Sam's sailors in hunt for Miss Hula Hula. \r\nWell, I came in second and then who was it that had the thing \r\ndowntown? He said, “Pretty these pe[...] prove our point that the \r\n----------------Page (51) Break----------------\r\nRepublican,” that was the name of our paper, “That let us assure you, \r\nit is a judgement that cannot be lightly set aside, we refrain for \r\nthe good of the service...” Well anyhow, but he thought we should, I \r\nshould have been Miss Hula, I came in second. That was another, I \r\ndon't know how we got in it. I haven't read it in so long. But I had \r\nthis made so my kids could read it. They didn't even know anything. \r\n \r\nKelly: That you were in a contest, for a... a beauty contest? \r\n \r\nDawson: Yea, well, you know, yeah, so now I said to my kids, I made \r\nfour copies, and they're all going to get one, so what their mother \r\ndid at one time. That's a play in Newaygo, the Flintstones, that was \r\nin the Muskegon paper, us kids in it. That's all. \r\n \r\nKelly: Do you have any... \r\n \r\nCorrigan: I want to just show you... \r\n \r\nDawson: Oh, here's the original one from the paper that was written. \r\nThat's our Republican. But see my mother saved all these things, and \r\nMargie, we all... It took me a year to get through all her stuff. \r\n \r\nKelly: Yeah, I think we'll go, we'd like to go through your books, \r\njust have you talk about a few of the pictures by yourself, I think. \r\n \r\n----------------Page (52) Break----------------\r\nCorrigan: Oh, but that's not what I wanted to show you. \r\n \r\nKelly: Oh, ok. \r\n \r\nCorrigan: I wanted to show you what I have in here. This is every \r\nletter and telegram that I got from Ray. \r\n \r\nKelly: Oh, what a treasure. Can you grab that bag for me. \r\n \r\nDawson: I'm sorry. \r\n \r\nKelly: No, it's fine, it just, it crinkles on the thing. So can you \r\nsay that again, Mrs... Every letter... \r\n \r\nCorrigan: This is all the letters and telegrams that I got from Ray, \r\nwhile, after I started going with him and until he came home. There's \r\nlots of them in there. \r\n \r\nKelly: That's your treasure chest. \r\n \r\nCorrigan: That's my treasure. And I put them in a treasure chest. \r\n \r\nDawson: I remember. \r\n \r\n00:58:25:05--------------------------------------------------------- \r\n----------------Page (53) Break----------------\r\n \r\nKelly: Is there any last, is there any favorite memory, or favorite \r\nkind of just anecdote from that time during the war that you haven't \r\ntalked about yet that you think, “Oh this would be a cute little \r\nstory,” or “This would be an important thing for them to know?” \r\n \r\nDawson: I guess everybody was in the same boat, and just I don't \r\nknow, I just, made lots of friends during that time, and many happy \r\nones afterwards, you know. \r\n \r\nCorrigan: I have them in the other room, but I've been writing poems \r\nfor about the last thirty years, or most of them, and, just off and \r\non, 'bout different subjects, but I started it after I took a trip to \r\nthe holy land, which is a never to be forgotten experience, as you \r\ncan see up there, you know, when you stand in the Garden of \r\nGethsemane, and all that, you know, and, but anyway, so when I came \r\nhome then that Christmas, I wrote a Christmas poem about it, and then \r\nI started writing 'em, so anyway, so I had a poem book published in \r\nthe '80s that had just 36 poems in it. \r\n \r\nDawson: I have that. \r\n \r\nCorrigan: And now I have one that, they just finished it now, \r\npublishing it, and its got 95 poems in it, and that wasn't all of \r\nthem, 95 poems and seven songs. The words I wrote for seven songs, \r\n----------------Page (54) Break----------------\r\nso, I just got that, so... \r\n \r\nKelly: And was it, it was the World War II one in there? \r\n \r\nCorrigan: And the one about World War II, yeah. \r\n \r\nDawson: And the last one was it a week ago, and see I probably missed \r\nthat paper coming home from Newaygo. But one time I called her and I \r\nsaid, “Hey, the Chronicle's having a test for poems and such, Doris, \r\nsend him one of your poems.” And you came in first place. \r\n \r\nCorrigan: Well, no, not first place. But I got that newspaper, yep, \r\nit was... \r\n \r\nDawson: I thought it was first place. I told everybody first place. \r\n \r\nCorrigan: Well, it was, I'll tell you what it was. They said they got \r\nsent in 114 people sent in poems, and they picked 14 that were all \r\nwinners, and they were all on the front page of the paper. \r\n \r\nDawson: And your name was on it – must have been. 'Cause I've got it. \r\n \r\nCorrigan: Yeah, and that one's in this book too. \r\n \r\nDawson: Yeah, I've got one of her other little... yeah and I said I \r\n----------------Page (55) Break----------------\r\nwanted to buy one of the books, I said, “Keep one, you know for me.” \r\n'cause the poem about your mother in it, they're just beautiful \r\npoems. You've got to read them every once in a while because you \r\nforget them, but I always get a poem from her that she's written, or \r\nthey're in the paper and you can cut them out and I save all those. \r\n \r\n01:01:16:18--------------------------------------------------------- \r\n \r\nde Mare: Can you talk a little bit about how it was to be here kind \r\nof in the middle of the country, and, I mean, working for the war \r\neffort, how you felt about things? \r\n \r\nCorrigan: Well, first of all, that wasn't the only factory. Rowe's  \r\nManufacturing was a much bigger factory. But they didn't do any war \r\nwork. \r\n \r\nDawson: Yeah, but they didn't do any war effort, that's what I said. \r\n \r\nCorrigan: Yeah, but she said that was the only one in town, so it \r\nwasn't. It was just a small outfit. \r\n \r\nDawson: I guess you didn't think about it, 'cause you knew Muskegon \r\nwas Capitol Wide Cannon, and but we just felt we were nothing, just \r\ndoing our war effort, you know, that's about, that's what I felt. \r\nHey, we're making these shovel carriers for the boys. But the other \r\n----------------Page (56) Break----------------\r\nones were making engines for the planes and Capital Wide Canon had, \r\nbrought all kind of help up during the war. They was probably ten \r\npeople in a garage, 'cause they needed the help. 'Cause the boys, \r\nyoung boys, were all gone. \r\n Now that's all gone, that big, big, big foundry and it's a \r\nshopping center now. My husband worked there for years. Yeah. Retired \r\nfrom there. But, I guess you just didn't think being in a little town \r\nthat, that we were just, so this has been something, when we got to \r\nbe Grand Marshals, John, and think, here we are how many years later.  \r\n \r\nCorrigan: I hope he's not going to dream up something else here. \r\n \r\nDawson: I think we gave our history of our life. \r\n \r\nCorrigan: Can I go just a minute, I wanted to I wanted to show you \r\none of the books. I got, the people, of course, the publishers own \r\nthe books now, but they gave me fifty that I could, of course I paid \r\nto have them published too, but anyway... \r\n \r\nDawson: Yeah, I know you did. \r\n \r\nJohn: Watch that cord. Whoop, whoop... \r\n \r\nDawson: Yeah, careful with that wire, yeah, look, I... \r\n \r\n----------------Page (57) Break----------------\r\nCorrigan: Well I just wanted to show you one. But anyway, they gave \r\nme fifty to just give away to friends and family and such. But, and \r\nI'll just show you one. \r\n \r\nDawson: The other one is just a paper one she had done up, but... And \r\nMargie, then you went to Gerber's to work, didn't you, after the war \r\nand that. Oh, after that, 'cause then I worked to Rowe's and you were \r\nworking to Gerber's yeah, when he finished his contract down town. \r\n \r\nFrederiksen: And Grandpa Edwards took me to Freemont every day. He \r\nwas so... \r\n \r\nDawson: Yeah, well when the war was over, I was on the bus going to \r\nFreemont, when we got word, and boy they were cheering on the, it was \r\na little local bus back and forth, and... \r\n \r\nFrederiksen: He was so nice. \r\n \r\nDawson: I lost my other hearing aide, so I can't hear good. \r\n \r\nFrederiksen: Then I went to... \r\n \r\nDawson: Oh is this what your new one looks like, Doris? \r\n \r\nCorrigan: This is my new book. \r\n----------------Page (58) Break----------------\r\n \r\nDawson: Oh, that's neat. Let me see. \r\n \r\nCorrigan: Yeah, oh and then the publishers put in, he put in... \r\n \r\nDawson: Different pictures. \r\n \r\nCorrigan: ...different pictures and stuff which made it really nice. \r\n \r\nDawson: Yeah, oh I like that. Yeah. \r\n \r\nCorrigan: So it's in... there's the one that was, well that was the \r\none about spring. \r\n \r\nKelly: Do you have the World War II poem? \r\n \r\nCorrigan: The World War II poem is in here, too. \r\n \r\nKelly: Is it? \r\n \r\nCorrigan: Mmm hmm. But I've made a copy for you girls. But I was \r\nthinking today, I think I'll add another verse about Rosie the \r\nRiveter. And so, but anyway. \r\n \r\nDawson: I guess I don't have to go. Are you done taking pictures now, \r\n----------------Page (59) Break----------------\r\nare we through with this? \r\n \r\nCorrigan: But anyway, that was my new book. \r\n \r\n \r\n----------------Page (60) Break----------------\r\n"}}]