[{"type":"add","id":"shirley-clark","fields":{"identifier":"ROSIE_INTERVIEW_021","url":"/interviews/shirley-clark","label":"Shirley  Clark","description":"Shirley Clark had to quit school to work when her father severely injured his arm.  During the war, she was unknowingly part of the team that built the Atomic Bomb.","image":"/images/ROSIE_INTERVIEW_021-interview-thumbnail.jpg","content":" 1 \r\nShirley Clark \r\n \r\n \r\nThe Real Rosie the Riveter Project \r\nInterview 21 \r\n \r\n \r\n \r\nInterview Conducted by  \r\nKirsten Kelly \r\nJune 28, 2010 \r\nNashville, Tennessee  \r\n \r\n \r\n \r\nFor The \r\nFor the Tamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n----------------Page (0) Break----------------\r\n 2 \r\nInterview: Shirley Clark \r\nInterviewers: Kirsten Kelly \r\nDate: June 26, 2010 \r\nPlace: Nashville, Tennessee \r\n \r\nClark: My name is Shirley Clark.  I’m 82 years old.  I’m \r\nfrom Flat Rock, MI and I was born and raised in Chicago. \r\nDuring the war years, in the beginning, I started working \r\nfor um Chrysler Corporation and it was like a mailroom in \r\ndowntown Detroit over a USO facility. We used to go in the \r\nback way and we didn’t know at the time but it was secret. \r\nBut there were architects and draftsmen on different floors \r\nand we delivered the mail to them.  Then later on I was \r\ntransferred out to Lynch Road, Dodge main plant where I was \r\nin the accounting department and um didn’t know what we \r\nwere doing but just worked in the accounting department. \r\nOne of the things that I remember vividly is that we didn’t \r\nmake a lot of money in those days but they asked us to \r\ncontribute to war bonds and id said I didn’t want tot do \r\nthat.  My father cut his arm and nearly lost it so my \r\nsister and I quit school and got jobs so we could help my \r\nmom and dad.  So we needed the money that I made but it was \r\nmandatory.  They took it out of our pay. They said we had \r\nto support the war so we had to have a bond out and they \r\n----------------Page (1) Break----------------\r\n 3 \r\ntook it in increments out of each pay. And I only took home \r\n$37.50 every two weeks.  \r\n \r\nKelly: And how much was the war bond?  How much would they \r\ntake out of your pay? \r\n \r\nClark: Well I think they took it out in like four pays. You \r\nknow and it was $18.75 for a $25.00 war bond. But... so the \r\nday they dropped the bomb, the day after, they called us \r\nout into the factory and there’s a lot of dignitaries and \r\nthey announced that Atom Bomb had been dropped and that we \r\nhad been a part that, making that, manufacturing part of \r\nthat bomb. And we all got one of these pins, a round pin \r\nthat says “atom.”  So... \r\n \r\nKelly: Can you take me through that day when you found out \r\nand what was the feeling and what was? \r\n \r\nClark:  Well we were stunned of course you know. Young.  We \r\nwere young. But I went home and told my parents and we \r\ntalked about it and um and then all the people were killed-\r\num I mean then it had an impact.  It bothered me.  It \r\nbothered me but my dad said, they were building one too.  \r\nIt could have gone the other way. It was war and those \r\n----------------Page (2) Break----------------\r\n 4 \r\nthings happen you know. So the more we talked about it the \r\nmore I understood it. But like I say when you’re so young \r\nit’s- at first you don’t think about that, it just grows on \r\nyou.  But even I understand the pilot of that plane took \r\nhis own life eventually. It was awful. You see those \r\npictures. It bothered me. \r\n \r\n03:43:00------------------------------------------------ \r\n \r\nKelly: How old were you when, when this happened? \r\n \r\nClark: Um about 18-about 17/18.  I was young, yea, yea. \r\n \r\nKelly: I mean to learn, to go through this so young.  \r\n \r\nClark: Well, so many of the Rosies were that age you know \r\nand I’m sure some of them even worked on the plane that \r\ncarried that bomb. I wonder how they felt.  I’d like to \r\nmeet somebody that you know did that. Probably never will \r\nbut.  \r\n \r\nKelly: It’s...to look.. \r\n \r\n----------------Page (3) Break----------------\r\n 5 \r\nClark:  What did you think about when you studied it?  What \r\ndid you think about that happening? \r\n \r\nKelly: It’s interesting because my dad flew B-52 bombers in \r\nVietnam so it’s something he of course didn’t want to talk \r\nabout. \r\n \r\nClark: No, no. \r\n \r\nKelly: And you know he said, I’d rather be in the sky than- \r\nyou know because he loved airplanes, but he was- I mean I \r\nknow he didn’t drop a nuclear bomb but he he- \r\n \r\nClark: Right. \r\n \r\nKelly: So you know I think to live with that is is a \r\nchallenge in our world. I can’t imagine being so young and \r\nlearning that.  How do you think changed your life for you? \r\n \r\nClark: Oh I don’t know. I’d like to think that it made me \r\nbe more thoughtful but I don’t know, that’s pretty far \r\nfetched.  I don’t know, Uh, I- when I looked at Japanese \r\npeople after that, I wasn’t full of hate I just felt sorry \r\nbecause I felt maybe they had a relation that was killed.  \r\n----------------Page (4) Break----------------\r\n 6 \r\nYou know it didn’t- it may have changed my outlook there.  \r\nIt did. They rounded up. “Cough” - excuse me. I know that \r\nthey rounded up all the Japanese descendant people and put \r\nthem in confinement, which I thought was terrible they had \r\nnothing to do with that. So you know, I had compassion for \r\nthem. ‘Cause they- we were doing what we had to do and they \r\nwere doing what they had to do. \r\n \r\n06:18:04------------------------------------------------- \r\n \r\nKelly: What is it- I’m interested to know because this was \r\nsuch a big part of your life from such a young age, what \r\ndoes it make you feel about war now? \r\n \r\nClark: It’s such a different war. It’s such a nasty- I’m \r\nfrightened for our young people.  I don’t think this \r\nterrorism will ever stop. It’s the unknown. We can walk out \r\nof the hotel and a bus could be there and bomb. You know \r\nand in those days war was tanks and planes and it was in \r\nEurope. It wasn’t here but we’re getting a taste of it here \r\nnow and that’s very scary.  I’m frightened for my \r\ngrandchildren. (Shrugs) That’s...I don’t know. \r\n \r\n----------------Page (5) Break----------------\r\n 7 \r\nKelly: What- So what’s, let’s go back to- What was your \r\nlife like back before you became a Rosie? \r\n \r\nClark: Before I worked, I was very young. I don’t know I \r\nhad a wonderful upbringing, you know my mom, my dad and my \r\nsister, loving grandparents and uh went to school and um \r\nand when I was very young, I took dancing lessons. And you \r\nknow, my dad took us camping; we just had a great, great \r\nupbringing. A great childhood. And um my dad was brick-\r\nlayers in Chicago and occasionally he would bring home one \r\nof the laborers to eat and it’d be a black man so my sister \r\nand I were exposed to black people and living in Chicago we \r\ndidn’t have the same feeling as people living in the south \r\nso I’ve always been very respectful of black people like I \r\nsaid, we had- I had a wonderful childhood.  \r\n \r\nKelly:  I lived in Chicago for a while.  Where did you \r\nlive? \r\n \r\nClark: South side. Roseland.  Are you familiar with Payless \r\nPark.   \r\n \r\nKelly: Yea. \r\n \r\n----------------Page (6) Break----------------\r\n 8 \r\nClark: My father built all those stone steps. Yea, that’s \r\nquite a thought. And we used to go to Star Rock. We’d pile \r\nin the car and my mom would pack sandwiches and we’d go you \r\nknow.  In those days, you didn’t go into restaurants. \r\nNobody could afford it. Yea we went through the depression.  \r\nMy dad peddled handbills and cleaned Pullman cars anything \r\nto make a living. We were on relief. We had to take that \r\npaper to the grocery store. Get our groceries. My sister \r\nwould never go.  She was so ashamed.  But I guess I didn’t \r\ncare. (Laughs) But we had a loving bringing up. \r\n \r\nKelly: And do you have brothers and sisters? \r\n \r\nClark: I have- I had a sister. I lost her about four years \r\nago.  \r\n \r\nKelly: And how- It sounds like your dad was a pretty great \r\nguy. \r\n \r\nClark: He was. He was... \r\n \r\nKelly: How how were the- during those times, how was the \r\nfeeling about women and women working as you went into \r\nwork- \r\n----------------Page (7) Break----------------\r\n 9 \r\nClark: You mean during the war? Yea... \r\n \r\nKelly: Yea, or just leading up to the war. Like was it like \r\nfor women. \r\n \r\nClark: Well, my mom didn’t work you know. Well I should \r\ntake that back. Years ago, my mom worked in the laundry \r\nwhen we were very young. But my mom didn’t work later \r\nyears. But when the war came and she did get a job in the \r\nfactory and my dad tried to join the Merchant Marines but \r\nya know he was too old, they wouldn’t take him, but he felt \r\nreal strong about that. Um but he was all for women going \r\nin and working. He felt that it was necessary. And uh he \r\nraised rabbits and he had a victory garden. And he he was \r\nsupportive. \r\n \r\n10:31:16--------------------------------------------------- \r\n \r\nKelly: So were you- did you move from Chicago to Detroit to \r\nbecome a Rosie? Can you talk about that? \r\n \r\nClark: No, I I I um I was 10 ten when I moved from Chicago. \r\nMy father came here because of work. Like I said he was a \r\nbricklayer and then my mother came and I stayed with my \r\n----------------Page (8) Break----------------\r\n 10 \r\ngrandparents for a couple of years. And then my sister and \r\nI came here and went to school and that’s you know, then I \r\nstarted working here. \r\n \r\nKelly: How did you hear about the jobs? \r\n \r\nClark: Through my uncle- well through my step-grandfather. \r\nI called him my uncle. My step-grandfather worked for Dodge \r\nand he put a word in for me and that’s how I got the job. \r\nHe made it easy. \r\n \r\nKelly: Do you remember your first day? \r\n \r\nClark: My first day? Yes, I was frightened- I was scared to \r\ndeath. And they put me in a car and I had to go to another \r\nplant for an interview and then they took me downtown to \r\nthis building and I started that same day and and I was \r\nfrightened but everyone was very kind. The woman in charge \r\nwas a - she had it all together. She was full of authority, \r\nyou know. But kind to me. There was a young man who also \r\nworked there and I can remember he had he had health \r\nproblem. She was very very thoughtful of him. SO it was a \r\ngood experience. \r\n \r\n----------------Page (9) Break----------------\r\n 11 \r\nKelly:  So for someone who doesn’t know what that was like, \r\ncan you talk through the details of what you did on that \r\nfirst job.  What did you do as your job? \r\n \r\nClark: well, a truck would come with mail, like big manila \r\nenvelopes, packages and that would be delivered and we \r\nwould sort it and then we would get on an elevator. You \r\nknew what floor to go to. Um we couldn’t go into the areas \r\nthough we could only go up to the door and there would be a \r\nbox there and you’d lay the mail there and we had no \r\ncontact with the men at all. It as all men there were no \r\nwomen. So I did not know if they didn’t have women \r\narchitects in those days or drafts- I want to say draftsmen \r\nbut I don’t know, there were none there. And there I’d just \r\ngo back downstairs you know and do whatever else I was \r\nasked to do.  It was simple. It wasn’t a hard job.  It \r\nwasn’t like riveting. \r\n \r\nKelly: Did you- Was there a feeling that you understood \r\nsomething secretive was going on? Or was that just how you \r\nthought things were? \r\n \r\nClark:  No, I just I just thought that’s the way it was. We \r\nweren’t to bother anybody, that’s what I thought. You know, \r\n----------------Page (10) Break----------------\r\n 12 \r\nwe weren’t allowed to bother anybody. So it never dawned on \r\nme that it was secretive. \r\n \r\nKelly: Was there I’m curious at the time that you may not \r\nhave known that this place, but was there talks about the \r\nwar and anything new developing other places? \r\n \r\nClark: Umum. Never, nothing.  \r\n \r\nKelly:  So this idea of this nuclear bomb, totally took \r\npeople by surprise when it happened? \r\n \r\nClark: I think so. Maybe people in the factory weren’t that \r\nsurprised but people around me were. So- It just never \r\noccurred to us and then we’d leave the building across the \r\nstreet, there were prisoner’s of war from Germany. They \r\nwere working in the yards. They had big POWs on the back of \r\ntheir shirts.  And they’d hand on the fence watching us. It \r\nwas a little scary but it was pretty contained.  \r\n \r\nKelly: Do you know what they did for work in the camps? \r\n \r\nClark: I think, oh maybe loading trains or trucks, things \r\nlike that, just manual labor. Yea.. \r\n----------------Page (11) Break----------------\r\n 13 \r\n \r\nKelly: What happened, I, what happened with the camps so \r\nclose to you, what happened when the war was over. Did they \r\nget shipped back? Or what- \r\n \r\nClark: I imagine they were shipped back to their country, \r\nyea, the Germans. I don’t know but that’s what I would \r\nsurmise. \r\n \r\nKelly: What happened when you found out the war was done?  \r\nWas it that day? Or was it- did you keep working? \r\n \r\nClark: I kept working for a while, yes. I kept working \r\nuntil I got married and then I quit. My husband was in the \r\nNavy. He was on a destroyer escort. We were married before \r\nhe went to service and he was torpedo man in the Pacific. \r\nSaw a lot action. So we were fortunate that he came back. \r\n \r\nKelly: And what happened- What did you do? What did you \r\nboth do after the war? \r\n \r\nClark: Before he went in, he worked as a mechanic. He did \r\nbreaks and so he came back and he did get his job back but \r\nit didn’t pay him very much so my dad taught him how to lay \r\n----------------Page (12) Break----------------\r\n 14 \r\nbrick. And made a brick layer out of him and he made a \r\nbetter wage that way too.  \r\n \r\nKelly: And you stayed around the Mich-the Detroit, Michigan \r\narea.  \r\n \r\nClark: Yes we did. Then we moved out to um a suburb, South \r\nGate, we had five children. (Laugh) Yea, Yea. So we had a \r\nlovely family. \r\n \r\nKelly: Did you have, uh, what was the, your children? Boys? \r\nGirls? \r\n \r\nClark: I had a boy, a girl, a boy, a girl, a boy. (laughs) \r\nyea, yea. \r\n \r\nKelly: What was it like for you after- do you think that \r\nthe Rosie experience influenced you in how you raised your \r\ndaughters?  \r\n \r\nClark: I don’t think the Rosie experience influenced me as \r\nmuch as my education.  I wanted my daughters to have an \r\neducation, and my sons and they all did.  That influenced \r\nme. I felt that that was important.  When I was young, \r\n----------------Page (13) Break----------------\r\n 15 \r\neducation was for the very rich. You had to have money to \r\ngo to college. My reason for quitting school was my father, \r\nbut a lot of young people didn’t go onto school because \r\nthey couldn’t afford it, but uh, I’m uh, my children are \r\neducated. I’m happy about that. \r\n \r\nKelly: Did you, if you could look back on the time when you \r\nworking during the war and you look at yourself during that \r\ntime, would you- what would you say to that young girl? \r\nWould you give her any piece of advice or say anything to \r\nher at this time in your life now? \r\n \r\nClark: Yes, because I know about education now, I would \r\nhave said you know wait a while to be married, get to \r\nschool, further your skills because I was limited. I was \r\nself-taught but get some skills so when and if you are ever \r\nleft alone with a family you can support them because that \r\ncan happen. That’s what I would have done. I didn’t take \r\nthe opportunity. I just went on and got married and I was a \r\nstay at home mom and I’m not ashamed of that, a little \r\ndisappointed that I didn’t have more education so but. \r\n \r\n----------------Page (14) Break----------------\r\n 16 \r\nKelly: Was there- were there times in your life after Rosie \r\nthat you- there were certain things you wanted to do or \r\ncertain jobs that you wanted to try? Is there something... \r\n \r\nClark: I can’t say that. \r\n \r\nKelly: Yea, \r\n \r\nClark: I can’t say that. \r\n \r\nKelly: Yea \r\n \r\nClark: Nope. Pretty plan. \r\n \r\nKelly: Ok so let me- just a couple more questions about um \r\nthe time during the war. Do you- were there any- what were \r\nthe feelings about all these women going to work at the \r\nsame time? What do you think the world felt about that? \r\nMen? Or women themselves? \r\n \r\nClark: Uh it it was strange because like my sister and I \r\nrode the streetcar to work. My sister worked in the same \r\nplant as I did and it was strange because it was all women \r\non the streetcar, you know in the morning. And a lot of us \r\n----------------Page (15) Break----------------\r\n 17 \r\nhad curlers in our hair or put bandanas on and when we got \r\nto work you know then we’d rearrange ourselves and but very \r\nfew men on the streetcar you know where there used to be \r\nmen waiting on the corner to transfer. You know what I mean \r\nwhen I say transfer? You get a streetcar so far and then \r\nyou have to get another one but I remember it was mass of \r\nwomen all the time. And and we’d go to USO dances you know \r\nand uh a lot of women and not many men of course and uh but \r\nwe, yea it was a big difference, big difference. \r\n \r\nKelly: Is there- I remember my grandmother was a Rosie too \r\nand she talks about going to the dances and that’s that’s \r\nreally when women started dancing with each other. In a \r\nway- \r\n \r\nClark: Oh yea because you stand there and stand there and \r\nfinally are just like, “let’s dance.” Being a wallflower is \r\nno fun but most- the men that were there were lonely and \r\nthey’d dance.  I always felt good about going. \r\n \r\nKelly: Were you hearing from your friends or other women-\r\ngirls who were Rosies- did they experience challenges as \r\nfar as going to work for the first time and gender \r\n----------------Page (16) Break----------------\r\n 18 \r\nrelations at all or was it- did you hear any stories of any \r\nchallenges? \r\n \r\nClark: No. No I didn’t. I really didn’t. Most of them you \r\nknow, their parents encouraged them and uh no I- there were \r\nnever any conflicts like that. They were happy to be \r\nworking you know. I was delighted to get a paycheck. \r\n \r\n21:48:00--------------------------------------------------- \r\n \r\nKelly: Do you remember- what did you do with the money that \r\nyou were making? \r\n \r\nClark: I gave it to my mother. My sister and I both because \r\nmy dad couldn’t work and my mother didn’t work. So I turned \r\nmy paychecks over to my mom and she would give me an \r\nallowance you know. And if I needed anything, she would see \r\nthat I got it. That’s the- That’s the way it was. \r\n \r\nKelly: And when did you meet your husband? Was he already \r\nin the Navy? How did you meet him? \r\n \r\nClark: I met him before he went into the service. I met \r\nhim- it was kind of a blind date. I shouldn’t have even \r\n----------------Page (17) Break----------------\r\n 19 \r\nbeen on it but my sister had a girlfriend who played in \r\nbands. She played the accordion. And she played in these \r\nlittle neighborhood taverns and whenever she would get a \r\njob, she would go to see what it was like so this one \r\nevening they were going to go see what this one place was \r\nlike and I begged to go with and uh they said okay. And we \r\nwere walking and it was quite a walk cause in those days \r\nyou just walked. And uh like a delivery truck pulled up, a \r\nvan, with a light and we yelled at the man, “give us a \r\nlift, give us a lift” and he did. I mean, we jumped in and \r\nhe took us.  We met these three men at this tavern and one \r\nof them was my husband. And he had been brought along to be \r\nwith my sister well, I wasn’t let my sister going to let my \r\nsister have him. So I met him, we spent the evening \r\ndancing. I lied about my age.  And uh so he- I saw him a \r\nfew times and he came to my house for my birthday and I had \r\nto tell him how old I was and I thought I’d never see him \r\nagain but it was okay. \r\n \r\nKelly: So what was the age- What did you tell him and how \r\nold were you? \r\n \r\nClark: I told him I was 18 and I 16. (laughs) So but that’s \r\nwhat we did. We just loved dancing and we’d go to a tavern, \r\n----------------Page (18) Break----------------\r\n 20 \r\na neighborhood tavern. I don’t know if your parents ever \r\ntalked about that. They’d always have little bands and I \r\nwould have a rum and coke and it would sit on the table all \r\nnight. I was a very reasonable date. So... \r\n \r\nKelly: You were there for the dancing. \r\n \r\nClark: Yes we were. Yes we were.  Till he died, we loved \r\ndancing. Yea, it was one of our favorite things to do. \r\n \r\nKelly: How long were you married? \r\n \r\nClark: 40 years. Mmuh. And he died at a dance so. He died \r\ndoing what he enjoyed.  There were three things that my \r\nhusband liked. You may not want to do this but he liked \r\ngolf, Budweiser and me. I was in the top three. \r\n \r\nKelly: That’s an amazing thing that always happen with \r\nevery relationship does it. That was lucky. \r\n \r\nLaughs. \r\n \r\nKelly: Uh I just wanted, because a lot this is learning the \r\nhistory work- \r\n----------------Page (19) Break----------------\r\n 21 \r\n \r\nClark: I know, I’m sorry. \r\n \r\nKelly: No, no no. This is all- It’s also the history of how \r\nlife has evolved so it’s great. I want to just before I \r\nhave to let you go because I know we’re tight on time, I \r\nwant to talk about your move from one place to the other \r\nand when you came to be working in the accounting \r\ndepartment. And what was that change like for you and what \r\ndid you do day-to-day when you moved the accounting \r\ndepartment? \r\n \r\nClark: Well, I typed ledger sheets. They had huge \r\ntypewriters. And I was frightened because you know I hadn’t \r\nbeen through it home and I had it in school and my speed \r\nwasn’t great but I had to fake it to keep the job and uh I \r\nworked real hard at it. But what we did was type columns of \r\nfigures and it was with carbon paper and you probably don’t \r\neven know what carbon paper is and if you made a mistake \r\nyou had to go back through everything and erase it. Oh it \r\nwas terrible and you had to balance these great big sheets.  \r\nYou had to balance all of these columns and add them all up \r\nand count and it was freight- it was intense at first. I \r\nwas really thinking maybe I shouldn’t be doing it for a \r\n----------------Page (20) Break----------------\r\n 22 \r\nwhile you know. And my mom and dad said, “just keep working \r\nat it,” keep trying, you know. And I did have a very nice \r\nboss. So finally I got there. \r\n \r\nKelly: How long did you do that particular job? \r\n \r\nClark: Several years, yea very nice. It was a nice \r\nfacility, you know. \r\n \r\nKelly: And what did you wear to work? And and- \r\n \r\nClark: Always skirts. We didn’t wear pants in the office.  \r\nThe factory, they had to wear pants but I always wore a \r\ndress of a skirt and hoes. You dressed up to go to work. \r\n \r\nKelly: Did you have panty-hoes all the way through the war? \r\nOr did you have to draw lines? \r\n \r\nClark: My mother would go and stand in line when they were \r\nhanding out hoes for us. So that we would have something \r\nfor work. On the summer, you know girls would paint their \r\nlegs but in the winter it was cold and we needed nylons and \r\nshe would go stand line for us, bitter cold.  I hadn’t \r\nthought about that in years. Yea, everything was rationed, \r\n----------------Page (21) Break----------------\r\n 23 \r\nyou know, sugar, gas. I still have some ration books that \r\nmy mom had. \r\n \r\nKelly: A little bit different than now, uh? \r\n \r\nClark: Oh yea. Yea, so different. And when you talk about \r\nthese things sometimes, my grandchildren are at an age \r\nwhere they are interested in the history, you know. And \r\nthey ask me questions, you know. It’s kind of fun. \r\n \r\nKelly: Well life is like we learn from generations. What do \r\nyou think- There seems to be a patriotisms, there was a \r\nunification during the war that is very different form now. \r\n \r\nClark: Oh yea. Right. \r\n \r\nKelly: Do you have thoughts about that and what- \r\n \r\nClark: OH yea. Right I just-I’m upset that we don’t show \r\nmore patriotism than we should. I’m very patriotic. I just \r\nlike the events. I sing. I’m astounded that young people \r\ndon’t take off their hats. They are so disrespectful.  And \r\nthat should be taught in the home. I’m sorry, that’s- and \r\nthey’re so lucky to be here. I just want us to really love \r\n----------------Page (22) Break----------------\r\n 24 \r\nour country and and stand up for it. And speak out for it. \r\nAnd be committed to it, you know. So I think in that era we \r\nwere. We were very patriotic and a few years back, remember \r\nwe went through a sprit. Remember the flags were up and the \r\nsongs were out and we lost that again. \r\n \r\n29:28:23---------------------------------------------- \r\n  \r\nKelly: How do you-I just want to keep talking to you \r\nbecause you’re so wise, why do you think that is? What has \r\nchanged? What in your opinion are some things that have \r\nchanged? \r\n \r\nClark: I don’t know if it’s the- life is so fast right now. \r\nPeople don’t have time for just the common things. There is \r\nno commitment, you know. I shouldn’t say young people \r\naren’t committed. You’re a young person; I don’t mean to \r\ninclude you. ON the whole there’s not a whole lot of \r\ncommitment from young people. I don’t know. I don’t know \r\nwhat the answer is except that we, as the older generation \r\nhave to instill that in our grandchildren and I do. I do. I \r\nhave a little story. I have a grandson in Cincinnati and he \r\nhad as son who just had a birthday and rather than these \r\nbouncy things he built and an obstacle course in his \r\n----------------Page (23) Break----------------\r\n 25 \r\nbackyard, invited all the little neighborhood boys and he \r\nwas a drill sergeant and they had to go under fences and \r\nthrough water and salute the flag and he sent me a picture \r\nof all these little boys saluting the flag and it was just \r\nso patriotic and just so nice to see. And they were \r\nfollowing rules.  He was teaching them things as well as \r\nhaving fun. Now I like to see things like that and I like \r\nto encourage it so I tell people that. You know, don’t take \r\nthem to a shooting gallery, do something in the yard. \r\n \r\nKelly: That’s a great story. \r\n \r\nClark: Yea. Oh, it was so sweet. Seven years old, you know, \r\nvery impressionable. He has a tree house that his daddy \r\nbuilt him with a big American flag hanging from it so \r\nthat’s kind of nice. His dad was in the Coast Guard so, and \r\nmy son was in the, in the Academy. Uh not the- The Air \r\nForce Academy. \r\n \r\nKelly: The Air Force Academy, wow!  That’s really \r\nimpressive.  It’s really hard to get into. \r\n \r\nClark: Mmuh, it was, very hard. \r\n \r\n----------------Page (24) Break----------------\r\n 26 \r\nKelly: What did he do in the Air Force then? \r\n \r\nClark: He didn’t stay in.  He was in for two and a half \r\nyears. It just wasn’t for him but he had a good experience, \r\na good education too. Yea, but he chose to come out. \r\n \r\nKelly: Is there, Elizabeth, is there questions sitting over \r\nin the corner that you have? \r\n \r\nHemmerdinger: No, I feel so lucky that we had time. \r\n \r\nClark: I don’t feel like I’ve done anything.  It’s just \r\nbeen fun talking to you.  You’re sweet, so sweet. \r\n \r\nKelly: Well, the interesting thing is that I’ll say to you \r\nthat the majority- the best interviews we get are usually \r\nthe shyer people who don’t want to talk.  And to talk to \r\nyou about this huge event in your life that happened when \r\nyou were so young. \r\n \r\nClark: Yes. The older I get the more I realize what it was.  \r\nYou know, at first you’re just too young to realize it but \r\nas you go along you think oh yes you know and Donnaleen is \r\nso dedicated. She’s a wonderful leader.  Yea, I like her. \r\n----------------Page (25) Break----------------\r\n 27 \r\n \r\nKelly: It was exciting to sit in that meeting yesterday and \r\nhear the numbers grow from 3,000 to 4,000. \r\n \r\nClark: Yes, wasn’t that something and you have helped us to \r\ngain new members. That’s wonderful. I hope to see you in \r\nSeptember.  \r\n \r\nKelly: Yea, well we hope to be there. \r\n \r\nClark: Yea, that would be great. \r\n \r\nKelly: Well, thank you Shirley. \r\n \r\nClark: You’re welcome.  Thanks for having me.  \r\n \r\nThe end. \r\n----------------Page (26) Break----------------\r\n"}}]