[{"type":"add","id":"signe-nakashima","fields":{"identifier":"ROSIE_INTERVIEW_010","url":"/interviews/signe-nakashima","label":"Signe Nakashima","description":"Singe Nakashima worked at Lockheed Aircraft Corp. as a riveter during the war, in the same plant as her husband.  ","image":"/images/ROSIE_INTERVIEW_010-interview-thumbnail.jpg","content":" \r\n \r\n \r\nSigne Nakashima (and Barbara Miller) \r\n \r\nThe Real Rosie The Riveter Project \r\n \r\nInterview 10 \r\n \r\n \r\n \r\n \r\n \r\n \r\nInterview Conducted by \r\n \r\nAnne de Mare & Kirsten Kelly \r\n \r\nJune 27, 2010 \r\n \r\nARRA Convention, Nashville, Tennessee \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\nFor The \r\n \r\nTamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n \r\n----------------Page (0) Break----------------\r\nInterview: Signe Nakashima (and Barbara Miller) \r\n \r\nInterviewers: Anne de Mare & Kirsten Kelly \r\n \r\nDate:  June 27, 2010 \r\n \r\nPlace:  Nashville, Tennessee \r\n \r\n \r\n \r\nNakashima:  My name is Signe Nakashima.  I was born and \r\nraised in Nebraska, a little farm near Comstock, Nebraska. \r\n \r\nDe Mare:  And can you tell me a little bit about your \r\nchildhood? \r\n \r\nNakashima:  I was born to a... the most wonderful parents in \r\nthe world.  They were patient.  They never yelled at each \r\nother.  They were good to us kids.   They gave us plenty of \r\nfreedom, but good enough discipline.  And I grew up very \r\npoor but I didn’t know it.  I was rich.  I had everything I \r\nneeded. \r\n \r\nDe Mare:  How many were in the family? \r\n \r\nNakashima:  Um, older brother and then me and my sister and \r\nmy younger brother.  All within four years.  So we grew up \r\ntogether. \r\n----------------Page (1) Break----------------\r\n \r\nDe Mare:  And what did you father do?  What did your father \r\ndo for a living? \r\n \r\nNakashima:  We were on a farm.  He was a farmer.  He was \r\nraised in Sweden.  At seventeen he came to this country all \r\nby himself, came through Ellis Island, and settled in \r\nNebraska.  I don’t know why, but land... lived on a dry land \r\nfarm. \r\n \r\nDe Mare:  And what did you farm?  What did you grow? \r\n \r\nNakashima:  Uh, corn and alfalfa, to feed the stock and \r\njust whatever we had.  We had a potato patch and a big \r\ngarden and cattle, pigs, chickens.   \r\n \r\nDe Mare:  A lot. \r\n \r\nNakashima:  A lot of things.  A lot of work. \r\n \r\nKelly:  I’m getting a lot of glare in her glasses. \r\n \r\nDe Mare:  Okay. \r\n \r\n----------------Page (2) Break----------------\r\n00:01:25:14------------------------------------------------ \r\n \r\nDe Mare:  So, uh, so your father was a farmer. \r\n \r\nNakashima:  Mm-hm. \r\n \r\nDe Mare:  You said you grew up very poor but you didn’t \r\nknow it. \r\n \r\nNakashima:  That’s right. \r\n \r\nDe Mare:  Now, could you tell me the story of how you found \r\nout about the work during the war?  How you got your job \r\nand then what you did during the war as a Rosie? \r\n \r\nNakashima:  Well, my... I married a high school sweetheart.  \r\nHe was drafted before Pearl Harbor.  He was a pre-war, a \r\npeacetime draftee.  Right after Pearl Harbor his feet \r\nswelled, he couldn’t walk so that- he could walk but he \r\ncouldn’t march- so they decided he’d be better off in the \r\nwar work than in military.  He came home; we got married.  \r\nAnd we wanted to get into defense work, to help win the \r\nwar.  So we moved from Nebraska to California.  And I hired \r\ninto Lockheed Aircraft Corporation as a riveter.   \r\n----------------Page (3) Break----------------\r\n \r\nDe Mare:  How did you... how did you learn about the job?  \r\nHow did you find out about it?  Do you remember? \r\n \r\nNakashima:  Yes, his brother had already been in California \r\nfor a year, and a couple friends, and they talked us into \r\ngoing there.  It was a hard move ‘cause it was a long ways \r\nfrom home.  They said, “You gotta come to California for \r\nthe big wages, y’know: sixty cents an hour.  That was big \r\nwages.  So we went out and we... we lived in an apartment \r\nwith them.   \r\n \r\nDe Mare:  So you were earning sixty cents an hour as a... as \r\na riveter. \r\n \r\nNakashima:  Riveter. \r\n \r\nDe Mare:  And can you explain for some... for someone who \r\ndoesn’t know what riveting is, what it is?  What did you \r\nactually do? \r\n \r\nNakashima:  Well, airplanes are held together a lot with \r\nrivets.  So you’d drill a hole, put a rivet in, and I ran \r\nthe rivet gun, and you put, uh, flat-nosed end against the \r\n----------------Page (4) Break----------------\r\nrivet, and then somebody on the other side put a bucking \r\nbar, and you shoot.  It was an air gun and it would \r\nvibrate, and that would make the river... rivet squish up \r\nfrom the other side.  That was how, what a rivet was and \r\nthey used a lot of them in airplanes.   \r\n \r\n00:03:30:02------------------------------------------------ \r\n \r\nDe Mare:  And what was your husband do... what? \r\n \r\nKelly:  Sorry.  See if she could maybe use that... \r\n \r\nDe Mare:  Oh. \r\n \r\nKelly:  It is just crinkling. \r\n \r\nDe Mare:  It’s crinkling.  And she said that...  (laughter) \r\n \r\nKelly:  It’s crinkling, I was like, what is that?  It \r\nsounds about ten times louder in my ear, so we... we... \r\n \r\nDe Mare:  That’s very funny.   \r\n \r\nNakashima:  I won’t crinkle any more. \r\n----------------Page (5) Break----------------\r\nDe Mare:  No, no.  Don’t crinkle any more.  Don’t crinkle.  \r\nSo, and what did... what did your husband do?  He worked at \r\nLockheed as well? \r\n \r\nNakashima:  Yes, we hired in together.  He was hired in.  \r\nHe was very insulted.  They high... hired him in as a filer \r\nand burrer.  And I was a riveter. I had a big name.  But \r\nvery shortly after, he became a sheet-metal worker, which \r\nwas fine.  He was in the same building but in a different \r\ndepartment than I was. \r\n \r\nDe Mare:  And, um, do you... did he make the same amount of \r\nmoney an hour as you? \r\n \r\nNakashima:  Yes.  Actually, we both a... agreed to work on \r\nthe swing shift so we got an extra six cents an hour, and \r\nswing shift was from four in the afternoon ‘til midnight.  \r\nThen we’d get off at midnight, go to the swing shift movies \r\nthat lasted ‘til about four in the morning.  And then, uh, \r\ngo to work the next day at four pm.   \r\n \r\nDe Mare:  What is it... I’m just curious what it was like as \r\na young bride to be starting your life in the middle of \r\nthis war?  Um... \r\n----------------Page (6) Break----------------\r\n \r\n00:04:50:14------------------------------------------------ \r\n \r\nNakashima:  Well, I’d actually worked since I was fourteen.  \r\nI had to leave home to go to high school. I’d get jobs to \r\nwork my way through high school.  So I was not just first \r\nout of the home, you know, I’d been working for about five \r\nyears before I went... before I got married. \r\n \r\nDe Mare:  What kind of jobs did you do? \r\n \r\nNakashima:  Housework for people, and they would be in town \r\nworking at the dime store, where I’d liked to have been.  \r\nAnd I would do her housework for her, for three dollars a \r\nweek.   \r\n \r\nDe Mare:  Three dollars a week.  So sixty cents an hour was \r\na lot of money. \r\n \r\nNakashima:  Oh, it was a lot of money. \r\n \r\nDe Mare:  A lot of money. \r\n \r\nNakashima:  Mm-hm. \r\n----------------Page (7) Break----------------\r\n \r\nDe Mare:  Um, did you have any, um, any other family or \r\nanyone else in the service other than your husband?   \r\n \r\nNakashima:  Um, my two brothers.  My older brother was in \r\nthe army air corp, and my younger brother was in the navy, \r\nand, uh, cousins and other relatives. \r\n \r\nDe Mare:  And so can you talk a little bit about if you... \r\nhow you felt connected with the work you were doing to the \r\nmilitary?   \r\n \r\nNakashima:  Oh, definitely.  We were building airplanes to \r\nfly over and bomb the enemy.  I worked on B-17 bombers, P-\r\n38 fighters, they were going over there to get the war over \r\nso we could bring our boys home.  That was the big thing.  \r\nEveryone said, “Bring the boys home.”  That was the, \r\nbesides the victory sign, that was the thing. \r\n \r\nDe Mare:  Do you remember any event that happened when you \r\nwere working on the floor, any, um, funny thing that \r\nhappened, or dangerous thing that happened, or tragic thing \r\nthat happened- just an anecdote of your experience as a \r\nRosie when you were working? \r\n----------------Page (8) Break----------------\r\n \r\n00:06:36:16------------------------------------------------ \r\n \r\nNakashima:  Well, there were several.  We were in the air, \r\nuh, corridor of Grand Central Airport, a training field, \r\nand I worked on the swing shift.  The next day when I came \r\nto work, everybody was buzzing with excitement.  On the \r\ngraveyard shift, right after mine, a fella was landing and \r\nhe accidentally hit the wrong button and he strafed our \r\ndepartment.  There were holes in toolboxes and workbenches, \r\nbut I wasn’t there.  It didn’t happen to hit anybody, but \r\nwhen he landed, they said he was white as a sheet and \r\nwondered how many people he had killed.  It wasn’t on my \r\nshift but it was pretty exciting.   \r\n \r\nDe Mare:  Wow. \r\n \r\nNakashima:  Also, we needed to cover all our hair with what \r\nwe call “snoods”.  And the song was, “When you were in the \r\nmood, wear a snood.”  And one lady insisted on leaving a \r\nlittle bunch of hair out because she was feminine.  She \r\ndidn’t wanna cover her hair.  She... we used twelve inch \r\ndrills and one got away from her and caught her hair and \r\npulled a bunch of hair out.  It was quite a bloody mess.  \r\n----------------Page (9) Break----------------\r\nAnd things like that happened.  Accidents.  That was the \r\nworst one I can think of.   \r\n \r\nDe Mare:  Yeah.  What was it, um, you mentioned, you know, \r\nyou were, you wanted to be feminine even though you had to... \r\nCan you talk a little bit about that, about how... ‘Cause it \r\nwas the first time a lot of women wore pants, and it was \r\nthe first time... can you talk about what that was like for \r\nyour... you as a young girl? \r\n \r\nNakashima:  Well, I may be in a different category.  I was \r\non the farm.  I wore bib overalls a lot on the farm.  But \r\nin town, or anywhere we went, ladies had to wear skirts.  \r\nHere we are having to wear slacks, or coveralls, and it \r\nwasn’t humiliating, in fact, I felt kind of at home in \r\noveralls.  But it was kind of hard on some ladies to have \r\nto put on men’s clothing, you know.  That’s what they were \r\nthought of as.   \r\n \r\nDe Mare:  Yeah.  When you talk about the relationship \r\nbetween the men and the women at the plant, if, uh... what it \r\nwas like to work with the men, if you worked mostly with \r\nmen or mostly with other women?  Can you just talk about \r\n----------------Page (10) Break----------------\r\nthat relationship?  Because I know it was the first time a \r\nlot of people were thrown together in that way to work. \r\n \r\n00:09:01:14------------------------------------------------ \r\n \r\nNakashima:  I think it was pretty much fifty-fifty, as far \r\nas men and women- maybe more women than men in our \r\ndepartment.  But they just blended very well.  The men were \r\nvery good to us.  They didn’t, uh, act like we were \r\nsubmissive and they were domineering or anything.  They \r\nwere good in my department.  I don’t know if it was that \r\nway in other places. \r\n \r\nDe Mare:  And were there, were there any people of color \r\nworking there?  Was it... \r\n \r\nNakashima:  There were some, yes, and, uh, I worked with a \r\nMexican lady.  And she said, “You just don’t what it’s like \r\nto have dark skin.”  She wouldn’t feel that way now, but it \r\nwas pretty, they, she felt discriminated against.  I sure \r\ndidn’t feel that way toward them.  They were very nice \r\npeople.  Black... a black lady worked in the tool crib, and \r\nshe was sweet as could be and...  They all got along fine.  \r\n----------------Page (11) Break----------------\r\nWe didn’t... did... ‘course, this was in California.  It’s not \r\nin the Deep South or anything like that.   \r\n \r\nDe Mare:  Was there a union at the... at the... \r\n \r\nNakashima:  Yes. \r\n \r\nDe Mare:  And were you a member of the union? \r\n \r\nNakashima:  My husband belonged to the International \r\nMachinists Union, and I belonged to the Ladies Auxillary of \r\nthe International Machinists Union.  Yes. \r\n \r\nDe Mare:  And what were the... what... what was... what was it \r\nlike to... did you have to join the union before you got a \r\njob?  Can you just talk a little bit about what it was \r\nlike? \r\n \r\nNakashima:  Well, I don’t remember much about that.  We \r\njust belonged.  Maybe we signed a piece of paper, I don’t \r\nknow.  But I didn’t think much about the union.  It didn’t \r\nreally have a lot to do with what I did at work. \r\n \r\nDe Mare:  Yeah. \r\n----------------Page (12) Break----------------\r\n \r\n00:10:38:04------------------------------------------------ \r\n \r\nNakashima:  There were no strikes.  Nobody thought of that.  \r\nThis is wartime.  Everybody’s working.  You didn’t work for \r\nmore wages.  You worked to get the boys home.  So the union \r\ndidn’t really mean a whole lot to us. \r\n \r\nDe Mare:  Um, can you talk a little bit about when the war \r\nwas over, what happened?  If you, you know, once the war \r\nended... \r\n \r\nNakashima:  Yes. \r\n \r\nDe Mare:  ...how your work... what happened? \r\n \r\nNakashima:  Uh, first we had V.E. day, “Victory in Europe”, \r\nwhich was in April, and shortly after I was laid off.  \r\nLockheed was starting to reduce their force.  I was ‘rift’, \r\nin other words: reduction enforced.  And then, uh, I think \r\nit was in July, my husband was laid off.  So we were \r\nthrough with work at Lockheed.  But we had heard about a \r\nNavy base opening up on the Mohavi Desert.  It started in, \r\nin 1943; we got there in 1945.  Drove a hundred and fifty \r\n----------------Page (13) Break----------------\r\nmiles up to the desert, and, uh, got there on August 13th, \r\nchecked into housing, which was a dormitory for me and \r\nmarine barracks for my husband.   \r\nThe next day we hired in to work and before noon, and \r\nthey sat me down to a desk, and everybody left, and I \r\ncouldn’t figure out why, and my boss said, “Aren’t you \r\ngoing home?”  And I said, “It isn’t time to go home yet.”  \r\nShe said, “The Japanese just surrendered, and the president \r\njust gave us two days off with pay.”  That was my \r\nintroduction to my new job.  And then, um, eventually on \r\nbase I became an electronic technician, worked on the bench \r\nwith the guys, which was very natural to me.  I had worked \r\nat Lockheed and that opened up the way for me to work on \r\nthe bench with guys on the base.   \r\n \r\nDe Mare:  Do you think that, um, can you talk a little bit \r\nabout how you think the Rosies going in and taking over \r\nthat work and doing those jobs while the men were gone, how \r\nthat changed things for, like, your daughter as she was \r\ngrowing up?  \r\n \r\n00:12:51:02------------------------------------------------ \r\n \r\n----------------Page (14) Break----------------\r\nNakashima:  I think it did a lot to change things for \r\nseeing women in the work force, doing men’s jobs.  When I \r\ngot to Lockheed, I don’t think they thought women really \r\ncould do this work, because women came in, bless their \r\nhearts, housewives had never seen hand tools, and I had \r\nbecause I worked on the farm.  It’s not a brag, it’s a \r\nfact.  And they had me teach the ladies how to use hand \r\ntools.  And then they said, “Could you, as an experiment, \r\nwe want to put you in this section, it’s called the re-work \r\nsection.”  Where a part would be damaged that we had to \r\ndecide whether it could be repaired or scrapped.  And they \r\nwanted to see if a woman could do that.  So, I went in, and \r\nto me it was easy.  You just use a little common sense, you \r\nknow, and decide and then...  So then, after that, they put \r\nsome other women in that department. \r\n \r\nDe Mare:  So you were like... you were the trial women to get \r\nin. \r\n \r\nNakashima:  Well, in that particular place I was, yes.  But \r\nthey had such, uh, an outlook, or look on women that, \r\n“Well, maybe they can’t do this kind of work.”  And we \r\nshowed them we could.  Women were welders and all... just, \r\nrailroad, uh, operators in stations and all that, you know.  \r\n----------------Page (15) Break----------------\r\nAnd they showed men that, “Yes, we could do it.  Yes, we \r\ncan.”  And that had a lot to do with opening it up for \r\nwomen, like, on the Navy base.  I started out with men, but \r\nthen more and more women came in and they could look back \r\nat the Rosies and see that, yes, they could do it.   \r\n \r\nDe Mare:  Do you think that it affected you personally?  Do \r\nyou think it changed you to do that kind of work?  I mean, \r\nI know that you said you’d already been on the farm and... \r\nBut can... do...  \r\n \r\nNakashima:  I don’t know.  I think whether I’d been a Rosie \r\nor not, I’d probably... I’m the kind that barges in, does it \r\nif it’s to be done but I think it gave me more confidence \r\nto go into whatever was opened up for me. \r\n \r\nDe Mare:  Yeah. \r\n \r\nNakashima:  And now my daughter is on the workbench.  She \r\nbecame an electronic technician after me.  Hopefully, I had \r\nsomething to do with it. \r\n \r\n00:15:22:12------------------------------------------------ \r\n \r\n----------------Page (16) Break----------------\r\nKelly:  What, um... is there... You have a, a, terrific \r\ndetailed memory and... and just... I imagine this space that, \r\nthat you worked in so completely.  What was it... can you \r\njust talk through a typical day when you were working as a \r\nriveter, like... \r\n \r\nNakashima:  Well, yes.  Um, we had to use ‘jigs’, they \r\ncalled them, it would be a... a frame, uh, sort of like a... a \r\ndress, what do you call the frame you hang a dress on to \r\nfit it?  And you fitted these aluminum parts on to the jig, \r\nand then they had places where you drilled through to get \r\nthe holes where they belonged.  We learned to use, well, \r\nhand drills, electric drills.  Well, we used twelve-inch \r\nlong drills where they had to put a piece of big light with \r\na hole in it to guide the drill.  You could bend those \r\nthings.  ‘Course, once in a while they’d break.  That was \r\nkind of dangerous. \r\nBut you drilled all the holes, then you’d take it out \r\nof the jig and put the rivets in and put it together.  And \r\nif you clenched a rivet, they called, if a rivet clenched, \r\nit went off sideways, you had to drill it out.  So then you \r\ntake a drill and drill through the head to the rivet and \r\ntry not to make the hole any bigger ‘cause then you had to \r\nuse a bigger rivet, and they didn’t like that.  Uh, some of \r\n----------------Page (17) Break----------------\r\nthe rivets were round heads, and some were flat-heads.  So \r\nyou had to countersink the hole, you had to learn to \r\ncountersink the hole so that it would lay flat against the \r\naluminum.  And, uh, that’s about generally what you did. \r\n \r\nDe Mare:  Did you, um, did you enjoy the work? \r\n \r\nNakashima:  I loved it.  Because doing that kind of work, I \r\nliked to do different kinds of work.  It was sure a lot \r\nbetter than housework.  It still would be.  I like that.   \r\n \r\nKelly:  And what... what... so what happened after the... so \r\nafter you found out the war was done, what happened after \r\nthat?  I mean, did you keep working, were you... \r\n \r\nNakashima:  I had that period from May ‘til Jul... to August \r\nthat I didn’t work.  I stayed home and my husband’s family \r\nmoved out.  And I was helping sisters with school work and \r\nstuff like that.   \r\n \r\nDe Mare:  And then what did you go on to do? \r\n \r\n00:17:48:09------------------------------------------------ \r\n \r\n----------------Page (18) Break----------------\r\nNakashima:  I went to this Navy base and started out in \r\nclerical, and then I got a chance to take a six month \r\ncourse in electronics.  Then I became an electronic \r\nequipment assembler.  And they decided I was... would be \r\nqualified for electronic mechanics, so they put in for me \r\nand I was turned down.  And my department head called me \r\nin, and this was like early sixties, and he said, “The only \r\nreason we can decide that you were turned down is because \r\nyou are a woman.”  And they could tell you that then.  And \r\nI had to accept it.  They... their excuse was I didn’t work \r\non small... or big enough parts.  We were sub-minaturizing \r\nthings.  So the guys I worked with said, “We’re gonna put \r\nup a big panel with great big knobs and big dials and show \r\n‘em what you do.”  That it would be big enough parts.  But \r\nit was because I was a woman.  They hadn’t ever had an \r\nelectronic mechanic... \r\n \r\nDe Mare:  How did that... \r\n \r\nNakashima:  ...woman. \r\n \r\nDe Mare:  How did that make you feel? \r\n \r\n----------------Page (19) Break----------------\r\nNakashima:  Very bad.  I felt almost inferior, you know?  I \r\nwas good enough but I was a woman.  But, heck, I can do \r\nthis.  But eventually then I became an electronic \r\ntechnician, which sounded a little more like a woman’s \r\nwork.  And they were getting into the, uh, getting women’s \r\nrights... \r\n \r\nKelly:  Was it... \r\n \r\nNakashima:  ...established. \r\n \r\nKelly:  Was that... were you... because of what happened to \r\nyou, was it... were you... how was your feelings about the \r\nrights that the... they were trying for in the sixties and \r\nseventies? \r\n \r\nNakashima:  Well, I certainly believed in women’s rights, \r\nand I still do.  I used to say I was the original women’s \r\nlibber because they can do anything a man can do as long as \r\nthey’re physically able.  And I stick to that.  I fight for \r\nthat.  Even now. \r\n \r\n00:19:45:11------------------------------------------------ \r\n \r\n----------------Page (20) Break----------------\r\nKelly:  Were you in... were you in involved in any of the, \r\num, work that... that the... the... what they call the women’s \r\nmovement was doing or did... \r\n \r\nNakashima:  No, I didn’t get... get... being on a Navy base... \r\nbase, out in the desert, you weren’t like, downtown, where \r\nyou could go to a demonstration or something.  Fact, you’d \r\nbe... didn’t dare demonstrate at the Navy base, of course.  \r\nBut they came around and they’re... they’re good. They gave \r\nwomen chances.  I think in lots of cases the wages aren’t \r\nup to men’s wages, but they’re getting closer and some of \r\nthem are caught up. \r\n \r\nDe Mare:  Yeah. \r\n \r\nNakashima:  Or they will be.  You have to remember I was \r\nborn three years before women got the right to vote.  They \r\ncouldn’t even vote.  Where I lived it was very rare to see \r\na woman drive a car because women just didn’t do that.  \r\nThey weren’t able.  They were women.  But, we showed ‘em.   \r\n \r\nDe Mare:  Yeah. \r\n \r\nNakashima:  Mm-hm.   \r\n----------------Page (21) Break----------------\r\n \r\nDe Mare:  Is there... are there any stories that she’s not \r\nshared?  That’s she’s not telling us?  (Laughter)  Is there \r\nany... \r\n \r\nKelly:  (unintelligible) \r\n \r\nMiller:  Well, when she talked about having to work just to \r\ngo to high school, um, she would be, I was impressed with \r\nhow hard she worked that she would have to on a Sunday \r\nevening she’d be strong enough to walk ten miles to go to... \r\nwas it ten?  \r\n \r\nNakashima:  Mm-hm.  In one place it was ten.  The other \r\nplace it was eight across the pastured hills. \r\n \r\nMiller: (overlapping) (unintelligible) Just to go to high \r\nschool, um, so at one of her jobs, before school, she would \r\nget up and kill a couple chickens for dinner... \r\n \r\nNakashima:  But that was in the summertime. \r\n \r\nMiller:  Go clean the chickens, and then cook them for \r\ndinner.  This is a girl who went through high school.  And \r\n----------------Page (22) Break----------------\r\nI think of, you know, how people are who had to work their \r\nway through college and high school, kids would just be \r\nappalled to have to do something like that.  So. \r\n \r\n00:21:55:02------------------------------------------------ \r\n \r\nNakashima:  I would work during the summer and save my \r\nmoney for school for the winter.  At three dollars a week, \r\nI could collect enough to buy a few clothes and what I \r\nneeded. \r\n \r\nDe Mare:  Do you... do you th... do you remember when you \r\nstarted getting paid the amount... when you started working \r\nand getting paid for the d... for the defense work, what were \r\nsome of the things you spent your money on? \r\n \r\nNakashima:  Well, the first thing my husband and I did was \r\nbought a new car.  It was used.  It was a 1938 Ford Coupe.  \r\nWe had a ‘33 Ford Coupe that was on its last legs.  It did \r\nget us to California, and we bought this ’38 Ford Coupe, \r\nwhich was wonderful.  And we... it was five hundred dollars.  \r\nSo we got that paid off.  That was what we did with our \r\nfirst checks.  But we felt rich.  Golly, we got sixty \r\ncents... sixty-six cents an hour, you know.  But we lived \r\n----------------Page (23) Break----------------\r\nwith my husband’s brother, his cousin and a friend.  The \r\nfive of us lived in an apartment where the guys had their \r\nroom and we had the pull-away bed- a Murphy bed in the \r\nliving room.  And we all worked the swing shift.  We’d go \r\nto work and get off work and all race for Bill’s Hot Dog \r\nStand, and get a hot dog, and then we’d come home or we’d \r\nstop at the store and get some groceries and get a gallon \r\nof ice cream and sit around the table with our own spoon \r\nand eat the ice cream.  It was just living high.  But it \r\nwas a lot of fun.  It was... it was like an adventure ‘cause \r\nI had never been in a big city or...  And then we did our \r\nwork, which was also like an adventure. \r\n \r\nKelly:  What did you grow on your farm?  What kind of farm- \r\nI know you said it was a dry-land farm- what... what did you \r\ngrow or what did you... \r\n \r\nNakashima:  Well, my mother had a big garden, and she would \r\ncan vegetables.  And we didn’t have electricity, so we \r\ncouldn’t freeze anything.  We raised... we butchered a steer \r\nin the fall, and a hog.  I had to help butcher the hogs and \r\nI even skinned a calf one time.  We had eight calves that \r\ndied, and my father skinned five, and my brother two or \r\nsomething, and I skinned one.  I was pretty proud of that.  \r\n----------------Page (24) Break----------------\r\n But, uh, we had a lot of chickens, so we had fresh \r\neggs.  We had the meat.  My mother would can the meat or \r\nput salt pork in the big, um, crock container.  And we had \r\ncherry trees so she canned cherries.  And we’d go pick \r\napples.  We couldn’t afford the... the one’s off the tree.  \r\nWe got what were called ‘ground falls’, or something.  The \r\nones that fell off the tree, we’d pick up the best ones, \r\n‘cause they were a lot cheaper.  Then we’d... she’s salvage \r\nwhat she could and can those.  We lived very well.  We had \r\ngood food.  All organic.  \r\n \r\n00:25:04:12------------------------------------------------ \r\n \r\nKelly:  Then what happened on the farms?  I grew up on a \r\nfarm, too, so... \r\n \r\nNakashima:  Yeah.  Well, after we left, all the kids were \r\ngone and went into war work, and my parents were getting \r\nolder and they finally sold the farm and they moved to \r\nCalifornia.  So we got to be with them until they died. \r\n \r\nDe Mare:  So the family came together again in California.  \r\nInteresting.  \r\n \r\n----------------Page (25) Break----------------\r\nNakashima:  Yes. \r\n \r\nDe Mare:  Do you ever go back to Nebraska? \r\n \r\nNakashima:  I’ve gone back every other year for a long time \r\nto our high school reunion.  It was a country high school- \r\na one-room grade school and then a one-room high school \r\nwith two teachers.  But it was great high school.  We \r\ncould’ve gone to the University of Nebraska from there.  \r\nAnd, uh, I had seven in my graduating class.  Four of us \r\nare still living.  And, um, doing pretty well. \r\n \r\nDe Mare:  Seven in your graduating class. \r\n \r\nNakashima:  It’s... \r\n \r\nKelly:  That’s amazing.  I was thinking, well, those class \r\nreunions we would different, right, wouldn’t they?  \r\nWouldn’t they? \r\n \r\nNakashima:  We couldn’t have class reunions.  We had high \r\nschool reunions. \r\n \r\nKelly:  Oh, right. \r\n----------------Page (26) Break----------------\r\n \r\nNakashima:  And then we eventually called it the community \r\nreunion, and we finally said if you even drove through \r\nthere, you could come to our reunion.   \r\n \r\n00:26:22:21------------------------------------------------ \r\n \r\nNakashima:  ‘Cause it was a small country school.  It was a \r\nwonderful school.  No one ever smoked or drank.  And one of \r\nthe mothers in the neighborhood got some material together \r\nso we could have Sunday School.  We’d go to the schoolhouse \r\non Sunday morning for Sunday School, and we’d have our \r\nparties on Friday nights.  They were called Sunday School \r\nparties, for lack of a better name.  And summer we had \r\nrefreshments- kool-aid and cookies, and then winter we had \r\nhot chocolate and cookies.  That was high school. \r\n \r\nDe Mare:  How did you meet your husband? \r\n \r\nNakashima:  He was in high school.  He was a senior when I \r\nwas a sophomore.  And, uh, actually, his father and my \r\nfather knew each other when my father first came to the \r\nUnited States.  And his father helped teach my father to \r\nspeak English.  But we lived in different communities, so \r\n----------------Page (27) Break----------------\r\nwe didn’t get acquainted with their family until we were in \r\nhigh school.   \r\n \r\nDe Mare:  Wow. \r\n \r\nNakashima:  And then I met Glen, and then after he was \r\ndischarged right from... right after Pearl Harbor, then we \r\nwere married.  Well, my husband had a motorcycle when I met \r\nhim and he used to come and get me to take me back to high \r\nschool on this old 1929 Harley Davidson.  And then after we \r\nmarried, uh, we got a... a really deep red Harley.  We found \r\na place, a filling station that would take our car gas \r\nstamps and put ‘em in our motorcycle so we could go a long \r\nways.  We got like sixty miles a gallon on the motorcycle.  \r\nWe could go places that other people couldn’t. \r\n \r\nDe Mare:  Was that... it was not kosher to... you couldn’t just \r\nbuy gas, you had to buy it for a car, you couldn’t buy it \r\nfor a motorcycle? \r\n \r\nNakashima:  You had your gas A stamps were for cars, I \r\nthink, B stamps were motorcycles; C stamps were something \r\nelse.  But you had to use them and put em... but we found one \r\n----------------Page (28) Break----------------\r\nguy that was willing to put our car gas stamps in our \r\nmotorcycle. \r\n \r\n00:28:23:19------------------------------------------------ \r\n \r\nDe Mare:  That seems like it would be good thing because \r\nyou were getting more mileage out of the gas.  You were \r\ngetting more... \r\n \r\nNakashima:  We were going places we weren’t supposed to go, \r\nlike up to San Luis Obispo or down to San Diego.  And then, \r\nuh, we sold that and got an airplane.  We bought a brand \r\nnew airplane from... first we bought an airplane from the \r\narmy; an old Oranco that we kind of fixed up but we flew \r\nthat all over.  Then we sold that and bought a brand new \r\nAir Coupe from the factory in River... Riverdale, Maryland.  \r\nAnd we rode a Greyhound bus clear across country from \r\nThursday night to Sunday morning, I think.  And, uh, got \r\nthe airplane and flew it back to Ridgecrest. \r\n \r\nDe Mare:  And who was the pilot?  Was it you or your \r\nhusband? \r\n \r\n----------------Page (29) Break----------------\r\nNakashima:  My husband was the pilot.  I was the navigator.  \r\nI would say ‘navigator to pilot’, and I would...  I had the \r\nair maps and I would check the ground and make the map \r\nmatch the ground.  And then we sold that and got a \r\nLoscombe.  Bought it in Washington State and flew it to \r\nCalifornia.  Then we had kids, and then we got a... so we got \r\na... a four place airplane, a Cesna 170, and we flew from \r\nRidgecrest to Nebraska.   \r\nWe’d set the kids- Barb was one and Buzz was three- \r\nand we’d set ‘em up in the seat and tie ‘em in ‘til we got \r\nwhere we were straight and level up.  And we had little \r\nquilts.  We put one of ‘em on the floor and one on the \r\nseat, and they’d sleep.  They slept good at night, but \r\nthey’d sleep as long as we were flying and then they’d come \r\ndown and we’d tie ‘em in and they just did fine.   \r\nThen after that we built an airplane from a kit.  A  \r\n‘Stitz’.  A Stitz Flutterbug.  And, uh, we... I didn’t get \r\nmany rides in that ‘cause I was taking care of little kids, \r\nbut....  And we sold that and got race cars because our kids \r\nwere quarter midget race drivers.  And we raced in Oregon, \r\nWashington, California and Arizona.  And, uh, it was fun, \r\nwe did that for about seven years. \r\n \r\nKelly:  You like... you like the thrill life. \r\n----------------Page (30) Break----------------\r\n \r\nNakashima:  Oh, yes.   \r\n \r\n00:30:45:19------------------------------------------------ \r\n \r\nKelly:  Did you see that look? \r\n \r\nNakashima:  (overlapping) I look... \r\n \r\nKelly:  She’s like...   \r\n \r\nDe Mare:  Yes. \r\n \r\nNakashima:  The Air Coupe was a two control.  You didn’t \r\nhave any foot pedals; you did the...  The steering wheel, it \r\ndidn’t have, it just had a wheel.  You could pull back to \r\nmake it go up, push forward, or turn left or turn right.  \r\nOthers had rudder controls with your feet, but this was \r\nsimple.  And it was not supposed to be able to spin.  So we \r\ntook it up one time to about ten thousand feet and tried \r\neverything in the book and we could not make it spin.  But \r\nit was fun. \r\n \r\nKelly:  That’s a little dangerous. \r\n----------------Page (31) Break----------------\r\n \r\nNakashima:  No, not at that altitude, ‘cause you can always \r\npull out of whatever you were in.  We did loops.  One time \r\nwe did a loop and when we were coming around, I saw the \r\nmountains and I said, “That looks like a negative.”  You \r\nknow, the... the ground was up here and the sky... and it \r\nlooked like a negative.  So we did a second one real \r\nquickly, I thought, “I’ll see if it looks like a negative \r\nthis time.”  And the darkness closed in and I... I blacked \r\nout, and then it just opened up again.  Just down to a \r\nlittle peephole and then it opened back up.  I blacked out \r\non the second one.  So I didn’t get to see if it looked \r\nlike a negative.   \r\n \r\nDe Mare:  Well, you must’ve been a fun mom. \r\n \r\nNakashima:  She and I have done a lot of adventures.  We \r\nbackpacked through the Sierra Nevada Mountains.   \r\n \r\nKelly:  That’s a... that’s an amazing mother/daughter thing \r\nto do.  \r\n \r\nNakashima:  Oh, it was great.  We had a lot of fun.  \r\n \r\n----------------Page (32) Break----------------\r\n00:32:26:04------------------------------------------------  \r\n \r\nDe Mare:  So what’s the next trip? \r\n \r\nNakashima:  Well, she’s busy and I... I’ve climbed Mount \r\nWhitney twenty times.  It’s the highest peak in the \r\ncontinental United States. \r\n \r\nMiller:  Last time on her eightieth birthday. \r\n \r\nNakashima:  I tell people I’m training to do it on my \r\nninetieth birthday, but I doubt if I’ll... but you have to \r\nhave goals.  She and I are planning to do a half marathon \r\nin October.  Oh, I’ll walk it, but I don’t run anymore.  I \r\nused to run but I don’t run anymore.  I walk.  She runs.  \r\nBoy.  \r\n \r\nDe Mare:  I’d love for you to just put us in context and \r\ntell us again that you did this kind of work and what your \r\ndaughter is doing now. \r\n \r\nNakashima:  Okay. \r\n \r\nKelly:  And why you’re here. \r\n----------------Page (33) Break----------------\r\n \r\nDe Mare:  Yeah, and why you’re here.  Tell us why... why \r\nwe’re all here. \r\n \r\nNakashima:  Well, first, I was an electronic technician, \r\nand she got the opportunity to go to... what was it called?  \r\nA...? \r\n \r\nMiller:  Co-op program. \r\n \r\nNakashima:  Co-op program.  She had to go to college first, \r\nat least twelve units of work at the base, at least six \r\nhours a day, I think it was. \r\n \r\nMiller:  Oh, I could work up to thirty hours a week. \r\n \r\nNakashima:  Oh.   \r\n \r\nMiller:  You had to take thirteen units at college and... and \r\nit was an opportunity to get an education and work.  I was \r\na single parent at the time and my mom helped... \r\n \r\nNakashima:  And of course... \r\n \r\n----------------Page (34) Break----------------\r\nMiller:  Took care of the kids and I had a career and now \r\nit’s almost thirty years later and I’m an electronic \r\ntechnician still but now I’m a supervisor.  Mostly men.  I \r\nwork on the Ranges, which is typically, mostly, men, uh, do \r\nthe work.  I... \r\n \r\n00:34:09:04------------------------------------------------ \r\n \r\nNakashima:  She was a tracker. \r\n \r\nMiller:  I worked on the Range.  Not too many women, I \r\nthink, really cared to do that kind of work that I did, and \r\nI’m sure it’s because my mom taught me to... to work hard \r\nand, uh... \r\n \r\nDe Mare:  Can you explain what the Range is to people who \r\ndon’t know? \r\n \r\nMiller:  The Range, uh, well, where I work in trial, like \r\nthe Ranges, are a... a testing, a weapons testing facility.  \r\nAnd so they... we have a large land area in the desert where \r\nthey can drop bombs, test missiles on the Ranges.  And, uh, \r\nthe department I work in, uh, provides it’s instrumentation \r\n----------------Page (35) Break----------------\r\ncoverage, uh, video coverage of the, uh, weapons, uh, \r\ntesting.  So. \r\n \r\nNakashima:  Can I tell the story about your first tracking \r\nexperience? \r\n \r\nMiller:  Uh, I hope it’s not classified.   \r\n \r\nNakashima:  She was... \r\n \r\nKelly:  She’ll tell us, and then you’ll have to kill us.    \r\n \r\nMiller:  Yeah, I’d have to kill you.   \r\n \r\nNakashima:  She was worried, of course, the first time \r\ntracking.  It’s a big tracking mount that opens up like a \r\nclamshell. \r\n \r\nMiller:  Optical tracking mount that you sit in the seat \r\nand drive it with a joystick with cameras on the arms that \r\nyou point at the aircraft. \r\n \r\nNakashima:  And they fired the missile and she said, “I’ve \r\ngot it.  I’ve got it.”  And she thought, ‘This missile is \r\n----------------Page (36) Break----------------\r\nslowing down.’  It turned around and went back.  She had \r\nlocked on to a bird. \r\n \r\nMiller:  (overlapping)  ...to a bird. \r\n \r\n00:35:45:16------------------------------------------------ \r\n \r\nMiller:  I don’t have it. \r\n \r\nNakashima:  First (unintelligible) but she became an \r\nexcellent tracker.   \r\n \r\nKelly:  That’s funny. \r\n \r\nMiller:  I guess that’s not classified.   \r\n \r\nKelly:  I’m sure it happens a lot.   \r\n \r\nNakashima:  Her boss said, “You’re not the first person \r\nthat did it and you won’t be the last one.” \r\n \r\nMiller:  They call those a “B-1-R-D” \r\n \r\n----------------Page (37) Break----------------\r\nNakashima:  She is a Rosebud, because I finally got to go \r\nto my first, I’ve been a... \r\n \r\nMiller:  Rosie. \r\n \r\nNakashima:  ...Rosie officially for several years but then \r\nthey had the convention in Las Vegas and it was close \r\nenough to home to go to it.  There I met Rosebuds and I \r\nrealized, “Hey, Barb could be a Rosebud.”  So I went home \r\nand signed her up as a Rosebud. \r\n \r\nMiller:  Well, then I heard about her time at the \r\nconvention and, in Las Vegas, and about the organization \r\nand I wanted to come.   \r\n \r\nNakashima:  And we’ve had a ball.  \r\n \r\nMiller:  Yeah, we have.  We really enjoyed it.  We met a \r\nlot of wonderful ladies. \r\n \r\nDe Mare:  What was... what’s that been like for you?  Being... \r\nbeing reunited with the... not reunited because you didn’t \r\nknow them, but meeting other women who did this kind of \r\nwork? \r\n----------------Page (38) Break----------------\r\n \r\nNakashima:  Oh, it’s very interesting to me and I am amazed \r\nthat we’re five here in their nineties.  I’ll be eighty-\r\nseven in three weeks, but I hope I can hang in there ‘til \r\nI’m ninety-five.  I kind-of plan to. \r\n \r\nMiller:  I’m sure you will. \r\n \r\nNakashima:  I have goals.  One of my goals is to be a \r\nhundred and two, so I’ll probably make it. \r\n \r\n00:37:24:14------------------------------------------------ \r\n \r\nNakashima:  It used to be a hundred and twenty, but as I \r\nget older, I think, do I want to hurt this much for that \r\nmany years?   \r\n \r\nMiller:  (overlapping)  This is... \r\n \r\nNakashima:  No, I... I’m gonna live for a while. \r\n \r\nDe Mare:  Yeah.  I think so.  I think so. \r\n \r\nKelly:  You’re doin’ half marathons and... \r\n----------------Page (39) Break----------------\r\n \r\nDe Mare:  Yeah. \r\n \r\nKelly:  ...you know.   \r\n \r\nNakashima:  Well, we’ll see if I can do that.   \r\n \r\nMiller:  I’m sure you can. \r\n \r\nNakashima:  I could except I had a knee replaced about two \r\nand a half years ago and it’s not doing right.  I think I’m \r\ngonna have another surgery in July.  Much smaller than a \r\ntotal replacement, and I think I can have time to get \r\ntrained til... by October 8\r\nth\r\n, or whatever.  I will if I can.   \r\n \r\nKelly:  And what has it meant, Barb, what has it meant to \r\nyou to have your mom at this point in her life, to see her \r\nkind-of reconnect with this Rosie business? \r\n \r\nMiller:  Oh, to me it’s been a very inspirational, uh, to \r\nsee all the women that did the work during the work and I... \r\nI knew about it but being present here, uh, it... it came \r\nalive for me and, uh, hearing their stories and the jobs \r\nthey did and, just, uh, so proud of them and so proud of my \r\n----------------Page (40) Break----------------\r\nmom, um, that I... I’ve... I’ve always known she was a... an \r\namazing woman. \r\n \r\nNakashima:  Oh. \r\n \r\nMiller:  Uh, uh, to really see what she did during the war \r\nand then how she continued afterwards and being such a \r\nchampion for women, um, for everybody, really.  And, uh, \r\nit... it’s opened my eyes to see the... the background that, \r\nyou know, she came from and, um, the only one that did that \r\nkind of work as well.  It’s been really, really fun. \r\n \r\n00:39:21:09------------------------------------------------ \r\n \r\nNakashima:  One thing to me that’s inspirational is reading \r\nthese books of the Rosie stories.  One lady wrote that it \r\nwas midnight, a train was coming, and she had to run a \r\nquarter of a mile, through the dark, on a path to throw a \r\nswitch so that the train could get on the right track.  She \r\nsaid, “But I don’t want to run that.”  They said, “You have \r\nto.”  So she ran down this, in the dark, quarter of a mile, \r\nand threw the switch.  Think that they welded big things in \r\nships and my little riveting was really nothing compared to \r\n----------------Page (41) Break----------------\r\nwhat some of those ladies did.  They drove trucks.  They \r\ndid a lot of things. \r\n \r\n \r\n \r\n \r\n----------------Page (42) Break----------------\r\n"}}]