[{"type":"add","id":"thelma-edgar","fields":{"identifier":"ROSIE_INTERVIEW_030","url":"/interviews/thelma-edgar","label":"Thelma  Edgar","description":"Thelma Edgar took the job of the male coach at the local high school when war broke out.  ","image":"/images/ROSIE_INTERVIEW_030-interview-thumbnail.jpg","content":" 1 \r\nThelma Edgar \r\n \r\n \r\nThe Real Rosie the Riveter Project \r\nInterview 30 \r\n \r\n \r\n \r\nInterview Conducted by  \r\nElizabeth Hemmerdinger \r\nJune 26, 2010 \r\nNashville, Tennessee  \r\n \r\n \r\n \r\nFor The \r\nFor the Tamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n----------------Page (0) Break----------------\r\n 2 \r\nInterview: Thelma Edgar \r\nInterviewers: Elizabeth Hemmerdinger  \r\nDate: June 26, 2010 \r\nPlace: Nashville, Tennessee \r\n \r\nEdgar: My name is Thelma Norton Edgar. \r\n \r\nHemmerdinger: And where were you born? \r\n \r\nEdgar: I was born in Tokaloka, Alabama.  \r\n \r\nHemmerdinger: And when did you learn to spell that? \r\n \r\nEdgar: Before I started school. My mother was a good \r\nteacher. Sh- \r\n \r\nHemmerdinger- That’s terrific- I’m sorry, go on. \r\n \r\nEdgar: She taught us all at home. \r\n \r\nHemmerdinger: She taught you at home? \r\n \r\n----------------Page (1) Break----------------\r\n 3 \r\nEdgar:  Until most of us got into second or third grade \r\nbecause we had to walk four miles to school. There were no \r\nschool buses. \r\n \r\nHemmerdinger: Oh my god. \r\n \r\nEdgar: So she was excellent because I skipped a grade when \r\nI started real school. \r\n \r\nHemmerdinger:  Well how did it feel to be the youngest in \r\nthe the real school? \r\n \r\nEdgar:  Well I guess the teachers were just smart because \r\nand made everybody feel comfortable. \r\n \r\nHemmerdinger:  Then did you stay- I can’t pronounce it, did \r\nyou stay in that place for your whole life? \r\n \r\nEdgar: No no, I moved from there with our family to another \r\nsmall town. My dad was a saw miller.  He moved his saw mill \r\nto another town. So we moved there and I started school at \r\na little school called Union Grove. And it was Methodist \r\nschool but you didn’t know what it was because they didn’t \r\nemphasize it. \r\n----------------Page (2) Break----------------\r\n 4 \r\nHemmerdinger: Then after high school did you go to work? \r\n \r\nEdgar: after high school I got a scholarship grant to go to \r\nschool at Jackson State University and I went to work over \r\nthere and I earned a whole amount of $21 a month. \r\n \r\nHemmerdinger: A month?  What were you doing? \r\n \r\nEdgar: I helped in the office and I did janitorial work. I \r\ncleaned the bathrooms and all the things that needed to be \r\ndone like a janitor do. \r\n \r\nHemmerdinger:  And then came the war? \r\n \r\nEdgar:  Not right then because I got my degree at Jackson \r\nState in 1940 and went to teaching school at Alexander \r\nCity, Alabama. That fall, was teaching there and that’s \r\nwhen the war came. Took me away from there and I had just \r\nmeet the love of my life there.  He was the coach for the \r\nboys.  He came there but he was the one who had to leave \r\nyou know. \r\n \r\nHemmerdinger: He had to leave to go to war? \r\n \r\n----------------Page (3) Break----------------\r\n 5 \r\nEdgar: Mm uh And I went back. My dad called said things \r\nhave opened up here and I want you closer to home.  It’s \r\nwartime and I want you closer to home. So I went back to \r\nGlen Cove and that’s when I took over the man’s job and did \r\neverything they had to do except go in the restroom with \r\nthe kids.  I had to have someone else help do that you \r\nknow. And we had a college student who was working on what \r\nthey called NYC that was a program, National Youth Council, \r\nI think that’s what they- NYC anyway.  They could work \r\ntheir way through school that way and that’s what he was \r\ndoing. \r\n \r\nHemmerdinger: So you were the couch and he was the \r\nassistant? \r\n \r\nEdgar: Yes. And later on it was so funny because I had to \r\nhave someone to go because I was a lady there I had to have \r\nsomeone go in that way.  Later on when I retired, I took on \r\nthe girls- I coached the girls basketball team at my school \r\nbecause they had to have a lady ride with them but they had \r\na really good coach who did the coaching. And I just rode \r\nwith them in the advice. \r\n \r\nHemmerdinger: So now, during World War II- \r\n----------------Page (4) Break----------------\r\n 6 \r\n \r\nEdgar: During World War II \r\n \r\nHemmerdinger: You were coaching in this school, how many \r\nkids were you influencing? \r\n \r\n04:15:15------------------------------------------------- \r\n \r\nEdgar: I had 126 kids all day long.  It was all the boys \r\nP.E. and all the girls were combined.  We had them in the \r\nsame classes. It was 126, I believe. \r\n \r\nHemmerdinger: 126 in the whole school? \r\n \r\nEdgar: No in the P.E. classes. \r\n \r\nNaides: They combined boys and girls?  That was pretty \r\nunusual-  \r\n \r\nEdgar: No other way to do it when you didn’t have a coach. \r\n \r\nHemmerdinger: You coached what sports? \r\n \r\n----------------Page (5) Break----------------\r\n 7 \r\nEdgar:  I coached football. Don’t ask me now, I can tell \r\nyou what plays are on when you get on the field. I coach \r\nbasketball which was my physical education degree and co- \r\nbasketball was my choice. And then when spring time came we \r\nhad baseball? \r\n \r\nHemmerdinger: And how did you teams do? \r\n \r\nEdgar: Well we won two titles, one state title. \r\n \r\nHemmerdinger: In which sport? \r\n \r\nEdgar: In basketball. \r\n \r\n05:22:06--------------------------------------------------- \r\n \r\nHemmerdinger: So the love of your life was then off in the \r\nwar? \r\n \r\nEdgar: Yes. \r\n \r\nHemmerdinger: And how was that? \r\n \r\n----------------Page (6) Break----------------\r\n 8 \r\nEdgar: It was sad. We were just friends and he had gone out \r\nto California at Camp Callan. They had- they gave him tests \r\nbecause then Pearl Harbor hit. And when that happened we \r\ndidn’t have enough military officers to take over and do \r\nthe things that needed to be done so they had him.  They \r\ntested him and he tested real high in the mathematics, in \r\nthe at field, took it for them- He was sent off to Cadet \r\nschool and they called him a 90 day wonder, that’s how \r\nquickly they got through there. And he stayed with it and \r\nstayed in uh National Guard after he got home.  He made the \r\nrank of Major before he came out to that and then later on \r\nhe was offered Lieutenant, General- he made Colonel then \r\nmade General. And uh I would have made it but then he said \r\nnope I had my- I think he said belly, I’m not sure of that. \r\nHe said I want to go home and teach boys and girls. So he \r\ncame back to high school to coach the job was open so he \r\ngot it.  We worked together then 32 years until he died. At \r\nthe same school. \r\n \r\nHemmerdinger: You continued to coach? \r\n \r\nEdgar: Yes, I gave up the coaching because there was so \r\nmuch traveling to do and I enjoyed being in the school \r\nafter school helping the children who got behind in school. \r\n----------------Page (7) Break----------------\r\n 9 \r\nAnd then it it’s a long story I could talk forever about \r\nit. \r\n \r\nHemmerdinger:  What skills do you think developed when you \r\nhad this opportunity you wouldn’t have had otherwise? \r\n \r\nEdgar: First thing is patience. And I think I have that to \r\nthe end. And I think that’s one of the things that gave me \r\na lead over other people that applied for the job. I uh, \r\ntraining grants high school gathered some counseling \r\ncourses so I got a grant to go to the University of Alabama \r\nthen to get my Guidance Counselor all paid for. All my \r\ngrant.  Then I went back to the same school when I got that \r\nbecause by that time they started hiring a counselor for \r\nall the little schools.  For a long time, one counselor had \r\nto go from one school- The first part of my counseling I \r\ndid go to five different schools in the county.  \r\n \r\nHemmerdinger: How was it for the children and other \r\nteachers who might have been separated from their loved \r\nones...take us back in time a little bit. \r\n \r\nEdgar: Well, I learned quickly how to handle children whose \r\nparents had gone off to war.  And some of them lost a \r\n----------------Page (8) Break----------------\r\n 10 \r\nparent. And I guess that was the real beginning of my \r\ncounseling, the grief counseling and I spent many times I \r\nremember when one student had lost both grandparents in \r\njust natural deaths within a month of each other and they \r\nwere really upset then next the dad was killed in service \r\nso I was able to handle that and I’m sure that was the \r\nbeginning of my looking out for opportunities to become a \r\ncounselor and work with children, young people. And I guess \r\nI’m still doing it because I have uh, now I have a senior \r\ncitizen’s complex and I counsel my old folks, every once \r\nand a while they have problems they can’t handle and they \r\ndon’t mind coming to see Thelma, see if she’d give them a \r\nlittle advice.  I don’t give advice, I just give \r\nsuggestions you know to what they could. I give them \r\nalternatives they can work with. \r\n \r\nHemmerdinger: How many people do you think you influenced \r\nin this positive way since you started coaching? \r\n \r\nEdgar: oh my goodness, how many? Well one time when I was \r\nfixing to retire in 1980 from the school, I had them check \r\nthe record of the different students I had and up to then I \r\nhad 3981 that had come through my- I say 81? that’s right \r\n81. I had it in my head it might have been 91. \r\n----------------Page (9) Break----------------\r\n 11 \r\n \r\n10:43:03------------------------------------------------- \r\n \r\nEdgar:  I was teaching at another school and they had six \r\ngrades in the same school one through six and I was there \r\nteaching. And I was supposed to be teaching reading, \r\nEnglish writing and I had classroom three times as big as \r\nthis. And there was a section here and section for the \r\ndifferent grade levels.  And I was teaching English and was \r\nteaching conjugating the verbs you have to do and they got \r\nto giggling over at that table and giggling and I said, \r\nalright you need to quiet down over there. And they just \r\nkept laughing, they couldn’t quit and I said, alright what \r\nare you laughing about or I’m going to send you to the \r\noffice if you don’t settle down.  And a little bit, and one \r\nof the boys said, “Miss Edgar, you don’t want to know.” And \r\nI said, “Yes I do.” And he said, “Well, Andrew let a fart.”  \r\nThat’s the funniest one that happened in all my teaching \r\ncareer. And that’s what I told my- the County of Education \r\nwhen they interrogated us some little meeting we had.  I \r\nsaid, “You’ll fire me if you hear this one but it’s true.” \r\nAnd it was and that boy grew up to make a fine person. I \r\nfollowed him on and he became a coach. \r\n \r\n----------------Page (10) Break----------------\r\n 12 \r\nHemmerdinger:  If you could go back in time and talk to \r\nthat young girl, young women who became a coach? What would \r\nyou say to that? \r\n \r\nEdgar: Well, I’d get up stand up because I learned a long \r\ntime, if I want people to teach and not keep their seats to \r\nstand up and I would get up and stand up and talk to them \r\nthat they didn’t get a afraid to get up in any crowd where \r\nthey are. And that’s what I’d tell them today, to stand up \r\nfor what you believe, but I mean actually get up on your \r\nfeet and stand because they’ll listen to you and nobody is \r\ngoing to listen to you sitting down. \r\n \r\n12:57:13--------------------------------------------------- \r\n \r\nHemmerdinger: How did you psych up the team before it went \r\nout to? \r\n \r\nEdgar:  I’d just say, “Look around, you don’t see anybody \r\nin here better than you are.” And I said, “You can stand up \r\nto any of the out there.”  I said, “if you make a mistake, \r\ndon’t worry about it, everybody makes mistakes.  You can \r\nbeat that other fellow, go to it.”  That’s about what I \r\nsaid. \r\n----------------Page (11) Break----------------\r\n 13 \r\n \r\nHemmerdinger: And did the children misbehave or not around \r\nyou? \r\n \r\nEdgar:  We did not have the much trouble with children in \r\nschool then because they knew if you got sent to the \r\nPrincipal’s office, the next place you’d be going was home \r\nand your parents would bring you back not fussing but \r\nthanking the teacher and the principal for disciplining \r\ntheir child. \r\n \r\nHemmerdinger:  And how do you compare life then, during \r\nWorld War II, with what you see now in the way children are \r\ntaught in schools in schools and the value’s that they \r\ncarry now? \r\n \r\nEdgar: Well I think really now the teaching profession and \r\nteachers get a lot of criticism but I think if they sit \r\ndown at eye level with the children and discuss problems, \r\nthey’d have a lot less trouble and they when you get ready \r\nto send that one back to his classroom or the Principal, \r\nget up and put your arm around them and say just let \r\neverything go and do what you know is right, that’s what \r\nI’d tell them. \r\n----------------Page (12) Break----------------\r\n 14 \r\n \r\nHemmerdinger:  You mentioned putting your arm around them.  \r\nI understand now in school, teachers can’t go- \r\n \r\nEdgar:  I know, I’d change that, I’d get fired because I \r\nbelieve that there is nothing that makes you feel better \r\nthan someone their hand across your shoulder. I don’t mean \r\nhug them tight but just ‘cause a touch is a healing thing. \r\n \r\nHemmerdinger: And how did we get to where we are now how \r\nteacher’s work in schools and how they are told how they \r\nhave to behave verses what you did instinctually? \r\n \r\nEdgar: Well, part of that came when they abolished \r\nsegregation. And that was easy for me to do because we had \r\nfive blacks come to our school at the same time and their \r\nmother had been our kindergarten keeper at church and it \r\nwas such a blessing.  And if you ask one of those kids, if \r\nit was hard to start school at Glen Cove High School, \r\nthey’d tell you no because Miss. Edgar made us feel like we \r\nbelonged and that we were their to learn. And learned to \r\nget along with people, each other and that’s still what I \r\nwould tell them, learn to get along, be patient and really \r\nit’s easy to learn everybody, one experience I was teaching \r\n----------------Page (13) Break----------------\r\n 15 \r\na seventh grade class and there must have been I think it \r\nwas 51 in that class they were crowded, maybe in a space \r\nnot much bigger than this. And they were laughing and \r\ntalking and I told them to just- little old Jimmy Archorage \r\nas I remember him, he’s still a great man now had come up \r\nbe in trouble and I would make him stand by my desk and uh \r\nhe said, what makes you be so kind? And I said, I learned a \r\nlong time ago to love everybody that was good, some good in \r\nevery person you come into contact with.  He said, “What do \r\nyou see in me?” I said, “well I see you are full of \r\nmischief and you don’t mean to get in trouble and I see \r\nthat you love people” and he went on, finished high school- \r\nhe was in what- back then they called it mentally retarded, \r\nhe was not that.  He was held back because he failed to \r\nturn in schoolwork not because he couldn’t do it but \r\nbecause his situation at home was such a bad situation he \r\ndidn’t get any homework at home and his parents didn’t give \r\na hoot about him. And he stayed in school, had some bad \r\ngrades, I thin he had about a C- average overall from 9\r\nth\r\n \r\ngrade to 12\r\nth\r\n when he graduate. And he said, I’d like to go \r\nto college but I know I can’t make it. I said you can do \r\nit, if you want to. That’s all it takes.  He went on, he \r\ngot through.  And now he teaches at the junior college \r\nwhere- it was just a school it was just a school, but it’s \r\n----------------Page (14) Break----------------\r\n 16 \r\na junior college now and he’s teaching there.  He’s in the \r\nSocial Sciences department and he’s fixing to retire \r\nbecause he’s 70. You have to retire at 70 but I think he’ll \r\nbe 70 at his next birthday, couple birthdays away I think \r\nit is. That’s it. That’s my story. \r\n \r\nHemmerdinger: You were coaching the girls team?  How was it \r\nto be a high school student in 1945? \r\n \r\nEdgar: Well, I hadn’t thought of it just like that, except \r\nmy girls were taught it was not good to go out and go \r\nparking somewhere. And they didn’t, they didn’t do much of \r\nit. Sometimes they did.  One time, one girl was fixing to \r\nmarry the boy she was dating and she had gone out and they \r\nhad parked, there was this bridge that there was never any \r\nparking on, the new bridge so they were parked there and uh \r\nthe police came around because you didn’t park in that \r\ncanyon. And uh, drove up and flashed his lights in there \r\nand said, “What are you doing there?” And he said, “Well, \r\nCaptain, Captain-“ and he stuttered, he just couldn’t say \r\nit.  He said, “I just proposed to my girlfriend and we \r\nthought it was time to stop and kiss.” And that’s it. \r\n \r\n20:19:12------------------------------------------------  \r\n----------------Page (15) Break----------------\r\n 17 \r\n \r\nEdgar: One of my favorite stories is about a little girl \r\nnamed Margie and she was not supposed to be dating yet but \r\nshe had slipped off and a couple- she went out with another \r\ncouple and a boyfriend and saw as they were crossing the \r\nbridge- Catalanta Bridge in Ellic City, Taposus County, \r\nthey were going on and uh the police came up, asked them \r\nwhat they were doing there and they said, “Well, we’re not \r\ndoing anything, the light changed and he just wanted to \r\nkiss me.” \r\n \r\nThe End. \r\n----------------Page (16) Break----------------\r\n"}}]