[{"type":"add","id":"winona-gillespie","fields":{"identifier":"ROSIE_INTERVIEW_029","url":"/interviews/winona-gillespie","label":"Winona  Gillespie","description":"Winona Gillespe worked in a shirt factory before she moved to Michigan and found a job helping build bomber planes.","image":"/images/ROSIE_INTERVIEW_029-interview-thumbnail.jpg","content":" 1 \r\nWinona Gillespie \r\n \r\nThe Real Rosie the Riveter Project \r\nInterview 29 \r\n \r\n \r\n \r\nInterview Conducted by  \r\nElizabeth Hemmerdinger \r\nJune 25, 2010 \r\nNashville, Tennessee  \r\n \r\n \r\n \r\nFor The \r\nFor the Tamiment Library, Robert F. Wagner Labor Archives \r\nElmer Holmes Bobst Library \r\nNew York University \r\n \r\n----------------Page (0) Break----------------\r\n 2 \r\nInterview: Winona Gillespie \r\nInterviewers: Elizabeth Hemmerdinger  \r\nDate: June 25, 2010 \r\nPlace: Nashville, Tennessee \r\n \r\nGillespie: Winona Gillespie \r\n \r\nHemmerdinger: And where were you born? \r\n \r\nGillespie: I was born in Tennessee in a small town of \r\nSparta, Tennessee. \r\n \r\nHemmerdinger: What was it like in Sparta? \r\n \r\nGillespie: Very small. I didn’t finish school there but I \r\ndid get most of my education there but not the whole thing. \r\n \r\nHemmerdinger: So then you went to work?  \r\n \r\nGillespie: I went to work. \r\n \r\nHemmerdinger: And you worked where? \r\n \r\n----------------Page (1) Break----------------\r\n 3 \r\nGillespie: There wasn’t much to do there so you had to try \r\nto make a living. \r\n \r\nHemmerdinger: So where did you go to try and make a living? \r\n \r\nGillespie: Well I worked in the shirt factory and that was \r\nmy beginning with the army. Uh because we made dress shirt \r\nfor the officers in the army. And you know it just gave you \r\na feeling that it was good and uh also helped my daddy and \r\nhis brother. Uh all the boys were gone and me and my sister \r\nwere the only one who could drive and I drove them around \r\nso they could take care of their business. They went out in \r\nthe country and bought furs and they would ship them to New \r\nYork. \r\n \r\nHemmerdinger: Oh really, what kind of furs. \r\n \r\nGillespie: Beaver and uh fox. I don’t remember the rest. \r\n \r\nHemmerdinger: So then you went to work in the shirt \r\nfactory- \r\n \r\nGillespie: And mink of course. \r\n \r\n----------------Page (2) Break----------------\r\n 4 \r\nHemmerdinger:  And mink...and then from the shirt factory, \r\nwhat happened? \r\n \r\nGillespie: I went- my sister moved to Michigan and uh she \r\nwas making very good money and I thought, that sounds good \r\nto me and so I went up and stayed with my sister and got me \r\na job. \r\n \r\nHemmerdinger: What kind of job? \r\n \r\nGillespie: I was working in the uh uh where they built the \r\nbombers for World War II and uh um a lot of my friends that \r\nI grew up with were also there and we just worked and \r\nenjoyed it. \r\n \r\n02:30:16-------------------------------------------------- \r\n \r\nHemmerdinger: What kind of work were you doing there? \r\n \r\nGillespie:  uh well we took a course about the whole- about \r\nthe whole plane that we worked on and uh um we could do any \r\nof the jobs that it called for- rivets and drilling and uh \r\ncleco. I know I was in the plane one day and we were \r\nsupposed to wear our haired tied up you know.  And I had \r\n----------------Page (3) Break----------------\r\n 5 \r\nthe drill you know and it was over a foot long and didn’t \r\nhave my hair up and I had real long hair and it got my hair \r\ncaught in it and it got all the way to my scalp. And it \r\nscared me death.  I wore my cover from then on. And uh- \r\n \r\nHemmerdinger:  What’s cleco?  \r\n \r\nGillespie: It uh goes into the hole you drill to make the \r\nrivet. Well there was some inside the plane and some \r\noutside and we would drill the holes with the drill gun and \r\nuh put this in there and somehow outside, I know did them \r\nboth I can’t remember exactly how it went but anyhow it \r\ncompleted that part of the plane. It was aluminum of course \r\nand it was around the Bombay door and it was a lot fun.  \r\nThat’s when we started wearing pants, climbing into he \r\nplane and everything. It was a hard job but I really \r\nenjoyed it. \r\n \r\nHemmerdinger: So you were wearing the pants, you’d be \r\nclimbing into the planes and mostly women building this \r\nplane? \r\n \r\nGillespie:  Lots of women, yea and a few men. \r\n \r\n----------------Page (4) Break----------------\r\n 6 \r\nHemmerdinger: And what kind of jobs were the men doing \r\nwhile you were building the plane? \r\n \r\nGillespie: Uh you mean at the plant? Same thing.  We were \r\ndoing the same thing. \r\n \r\nHemmerdinger: Were they beside you or were they inspectors? \r\n \r\nGillespie: Beside us, right. \r\n \r\nHemmerdinger: Were there unions? \r\n \r\nGillespie: Yes. UWA, CIO. \r\n \r\nHemmerdinger: You joined the union? \r\n \r\nGillespie: Um uh. \r\n \r\nHemmerdinger: How’d they treat ya? \r\n \r\nGillespie: Great. Really really good.  \r\n \r\nHemmerdinger: So what was a challenging day like? What was \r\na day when things didn’t go right like? \r\n----------------Page (5) Break----------------\r\n 7 \r\n \r\nGillespie: Well it seemed like everyday went pretty smooth \r\nwith us.  We worked great as a team and things just went ok \r\nand we were such a team, we’d get our job done sooner than \r\nexpected. And our boss would tell us if the inspectors come \r\naround, pretend you’re working. But we had so much to put \r\nout each day. \r\n \r\n05:43:19--------------------------------------------------- \r\n \r\nHemmerdinger: Eight women on a team? \r\n \r\nGillespie: Pardon me? \r\n \r\nHemmerdinger: Eight women on team? Twenty? How many? \r\n \r\nGillespie: Yea, a whole crew.  I would say there was about \r\n20. Ten to twenty.  There were...Well each day was uh was \r\njust exciting to me because it was so different. \r\n \r\nHemmerdinger: Where did you live?  \r\n \r\nGillespie:  Uh I lived with my sister part-time then me and \r\nsome of the girls got an apartment together and shared an \r\n----------------Page (6) Break----------------\r\n 8 \r\napartment.  It was hard to find one though.  It fact, we \r\nlived in some private homes where they’d rent out some \r\nrooms. \r\n \r\nHemmerdinger: And what did you do with the checks every \r\nweek? \r\n \r\nGillespie: The checks? \r\n \r\nHemmerdinger: The money? \r\n \r\nGillespie:  Well we went out celebrated every Friday \r\nevening. We found a restaurant that served southern food. \r\nAnd we would go there every Friday time and have our food. \r\n \r\nHemmerdinger:  Tell me what a meal was like? \r\n \r\nGillespie: Well it was pretty much like at home. We had \r\nbeans, cornbread, you know the regular old southern food. \r\n \r\nHemmerdinger:  Well, was it more fun to be with this group \r\nof girls, women than to be at home? \r\n \r\n----------------Page (7) Break----------------\r\n 9 \r\nGillespie: well I was always home sick but I was making \r\ngood money and that meant a lot and I would send mom and \r\ndaddy money. \r\n \r\nHemmerdinger:  Kept some for yourself? \r\n \r\nGillespie: Pardon me? \r\n \r\nHemmerdinger: Kept some for yourself? \r\n \r\nGillespie: well yea, yea and even after I come home and the \r\nwar was over and everything. I just kept getting checks, \r\nchecks, checks. That was a thrill.  The war was over and we \r\nheard Roosevelt you know says his uh speech about the war. \r\nOh it was one exciting time.   \r\n \r\nHemmerdinger: Did you hear the day he declared war?  You \r\nknow after Pearl Harbor, did you listen- what was it like \r\nto listen to that speech? \r\n \r\nGillespie: Unreal, just unreal-  \r\n \r\n08:27:00--------------------------------------------------- \r\n \r\n----------------Page (8) Break----------------\r\n 10 \r\nGillespie: It was just so thrilling, beautiful thing. \r\n \r\nHemmerdinger:  What did you think of Eleanor Roosevelt? \r\n \r\nGillespie: Oh I liked Eleanor.  She was a fine lady. \r\n \r\nHemmerdinger: she was a good example to other young women? \r\n \r\nGillespie: Very good, very good lady- Well I had three \r\nbrothers that went to war, and a first cousin who got \r\nkilled in Germany.  And of course my two sister’s husbands \r\nwere there. So I had a lot of relatives in the war and uh \r\nthey had maneuvers come through that area at that \r\ntime...during the war or after the war? Oh I don’t know.  But \r\nanyway my mother was so worried about my brother, he was in \r\nGermany and she was would just get sick, she was so \r\nworried. And uh in fact she did get sick but uh these- well \r\nwhile he was gone, she let some of these soldiers that were \r\nmaneuvers stay at my brothers home. It was next door an uh \r\nshe said that I was about 17/18- \r\n \r\nHemmerdinger: -And what was it like when you went shopping \r\nfor stuff? Now you had your own money, what did you spend \r\nit on? \r\n----------------Page (9) Break----------------\r\n 11 \r\n \r\nGillespie:  Oh we went shopping. I always loved clothes ad \r\nwe’d go shopping some of the best shops. And buy us a new \r\noutfit just real often and everything. \r\n \r\nHemmerdinger: Did rationing get in your way at all \r\n \r\nIn a way...what saved us was my dad mostly he worked in a \r\nstore and he was able to get some thing s that normally we \r\nwouldn’t have had.  Yea, we- he would also mail us some \r\nthings because he didn’t really need it all. I don’t mean \r\nhe got so much but he would share it. But uh living with \r\nher and everything she was kind of like my mother figure. \r\nShe was ten years older than me and she was a big help to \r\nme. \r\n \r\n11:30:00----------------------------------------------- \r\n \r\nHemmerdinger: and so all the two brothers-in-law and your \r\nbrother, they came home? \r\n \r\nGillespie: They came home. \r\n \r\n----------------Page (10) Break----------------\r\n 12 \r\nHemmerdinger: So tell us what the day was like when they \r\ncame home? The days? \r\n \r\nGillespie: just unreal, just unreal. \r\n \r\nHemmerdginer:  Happy. \r\n \r\nGillespie: Oh so happy.  \r\n \r\nHemmerdinger: Did they have stories to tell you that you \r\ncan tell us? Or should we- \r\n \r\nGillespie:  I’ve got letters now that my brother wrote to \r\nmy sister after mother died.  He was in the Philippines in \r\nthe Korean War.  One brother was in the Navy in Japan. My \r\nolder brother was in Germany. He drove a Jeep for a patent. \r\nHe got- his feet were frostbitten and my brother in the \r\nNavy, he he had trouble with his feet and legs from then \r\non.  You know, it wasn’t an easy time.  I try not to think \r\nabout the hard times but we had hard times too, very hard \r\ntimes.  \r\n \r\n13:04:22-------------------------------------------------- \r\n \r\n----------------Page (11) Break----------------\r\n 13 \r\nGillespie: But he was a wonderful man.  \r\n \r\nHemmerdinger: But we are grateful to him as a country for \r\nwhat he did to save us. \r\n \r\nGillespie: Absolutely, absolutely, and it thrills me to \r\nknow that I helped. \r\n \r\n13:17:00------------------------------------------------ \r\n \r\nHemmerdinger: So back to Friday night!  What happened after \r\nthe dinner? \r\n \r\nGillespie: Oh we went to the ballroom. And there would be \r\nthe big band and all the all the bandleaders would be there \r\nand a lot of times we would have to dance with the women \r\nbecause the men were so scared. And uh well when the boys- \r\nback to the boys when they were on maneuvers, they had a \r\nbig band in the downtown area and everybody in town was \r\nthere and dancing up a storm. It was on big party.   \r\n \r\nHemmerdinger: What was the music like then? \r\n \r\nGillespie: Oh it was good. \r\n----------------Page (12) Break----------------\r\n 14 \r\n \r\nHemmerdinger: Give us a song. \r\n \r\nGillespie: Glen Miller all the big bands of that era and uh \r\nof course I love it now, watched Lawerence Wilber every \r\nSaturday night. 7 o’clock. \r\n \r\nHemmerdinger: How about the jitterbug? Were you doing the \r\njitterbug? \r\n \r\nGillespie: Oh yea, the jitterbug big time.  \r\n \r\nHemmerdinger: How did you wear your hair? What did your \r\nhair look like? \r\n \r\nGillespie: Well I had these little tight curls up here and \r\njust long and casual and then I would wear it in a French \r\nbun, a French twist. And always had good hair and it would \r\ndo anything I wanted. \r\n \r\nHemmerdinger: So were you dating there, were you meeting \r\nthe fellows? Were they all too shy or were there one or two \r\nthat stepped up. \r\n \r\n----------------Page (13) Break----------------\r\n 15 \r\nGillespie: Oh we had plenty of good guys. And we would meet \r\na lot of the solders. In fact, I dated one from New York \r\nand he was a little bit shorter than me but we could sure \r\njitterbug.  I feel mean talking about that. \r\n \r\nHemmerdinger: Why? \r\n \r\nGillespie: Well some people look down at dancing.  Best \r\nexercise I ever did. But it we also had fun. It wasn’t all \r\ngloom and doom. \r\n \r\n16:02:10--------------------------------------------------- \r\n \r\nHemmerdinger: Why was it so gloomy and doomy?  \r\n \r\nGillespie:  Well we wanted that war to over. \r\n \r\nHemmerdinger: Tell us about the cost of living?  What did \r\nit cost to go to a movie? \r\n \r\nGillespie: Oh well my first movie was a five cents, a \r\nnickel. \r\n \r\n----------------Page (14) Break----------------\r\n 16 \r\nHemmerdinger: And did you get to go often to that movie? \r\nYou know to the movies? \r\n \r\nGillespie: Yea each time it would, a new movie would come. \r\nI would be there and it was about the only place to go in \r\nthem days. You could go over and over again and see the \r\ncowboy shows and the hehe... \r\n \r\nHemmerdinger: Then the war came because that was before the \r\nwar, right? \r\n \r\nGillespie: That was before the war. \r\n \r\nHemmerdinger: What did Monday morning feel like at work? \r\n \r\nGillespie: Monday morning we just knew we had a job to do \r\nand everybody was just happy to be there and we we like I \r\nsaid we worked well together. \r\n \r\nHemmerdinger: Did you miss it when the war was over? \r\n \r\nGillespie: I did. I did. I missed it a lot. \r\n \r\nHemmerdinger: Did you continue working? \r\n----------------Page (15) Break----------------\r\n 17 \r\n \r\nGillespie: Um uh \r\n \r\nHemmerdinger:  What did you do? \r\n \r\nGillespie: Well I came back home and then I moved to \r\nNashville and I’ve been here since the ‘50s and uh my \r\nhusband was a contractor. He built bridges. And I worked \r\nfor him all those years and so did Caroline, she was his \r\nsecretary for many years. And uh we sort of made a family \r\nthing out of that. \r\n \r\nHemmerdinger: So you worked for him?   \r\n \r\nGillespie:  I did. \r\n \r\nHemmerdinger: You didn’t work with him? \r\n \r\nGillespie: I worked with him but not out on the job. I sort \r\nof- I did all the driving and there was a lot driving and a \r\nlot of his work was out of town of course, and we would go \r\nhome on weekends and go back out to the job Sunday \r\nafternoon.  It just went on for all them years. \r\n \r\n----------------Page (16) Break----------------\r\n 18 \r\nThe End. \r\n \r\n \r\n----------------Page (17) Break----------------\r\n"}}]